{
    "total_ratings": "1,290", 
    "ratings": {
        "2 star": "53", 
        "1 star": "196", 
        "4 star": "302", 
        "3 star": "112", 
        "5 star": "627"
    }, 
    "price": "₹ 10990.00", 
    "reviews": [
        {
            "review_author": "Amazon Customer", 
            "review_header": "Poor Performance and Poor customer Service by SAMSUNG TEAM", 
            "review_posted_date": "16 July 2016", 
            "review_text": "I have purchased a mobile samsung j 7 in april 2016 and its diaplay not worked properly  so i sent the same to their service centre and their they confirmed that the diaplay is not working properly  due to some internal issue and its cost around Rs.6000 and when i told to them that same is under warranty  and needs to do free of cost then  they replied  ok they will sent my request to your head office and revert to meAfter 2 days I received  a call from your customer service centre that  request has been approved and  i will  get a new handset with in 10 to 15 working days and for the same i need to submit1.Invoice copy2.Address proof3.Cancelled cheque4.Detail assessory  of the phoneThe above  items i have submitted day after receiving call from your customer service and they assured  me that handset will come with in 10 to 15 working days.When I followup  for my Handset today your customer service executive updated  me that  i will get refund money approx 9000 after deducting the charges of Display which i denied the to them to take the money refund backIf  Samsung team is ready to  refund money to me then please refund actual cost  of handset  i.e not  deducting  any thing....This type of harshment to customer is not acceptable at allI need  a new handset or.money back total cost of the mobile or else i will urge to ho to consumer court", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "First the display is big and awesome, the touch is even better than other samsung ...", 
            "review_posted_date": "30 January 2016", 
            "review_text": "I will write this review step by step. First the display is big and awesome, the touch is even better than other samsung phones and can be comparable to samsung s6 and far better than micromax and etc. I bought the phone 2 months ago and it got fell down 3 times since then but it is working as good as new. The 3000mah battery is really awesome no heating issue at all, playing asphalt 8 for 2 hrs and it gives me 24 hr full backup on single charge, yes i used it for 24 hrs(Day+ Night)  on single charge while on a vacation. Dont worry about the 1.5 gb ram trust me it works better than micromax phone having 2 gb ram. My phone never hang at all although i'm a heavy gamer playing asphalt8 all day. And the camera is just awesome both the front and rear. I'm uploading a photo i have clicked on my phone camera.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Shreyas", 
            "review_header": "Highly recommended phone", 
            "review_posted_date": "26 January 2017", 
            "review_text": "Excellent phone...I have been using this phone for more than a year and I can assure you that you will not regret buying this one. I bought mine from Samsung retail store so I cannot talk about amazon service for this product.The only problem with J7 is that it does not feature Corning Gorilla glass. But if you get a tampered glass, the phone's screen will be protected from dust and scratches. If you need gorilla glass protection, you might want to buy J7 prime. It has all the features of J7 2015 model except AMOLED display which I think is far better than IPS display in terms of color depth and brightness of the screen.When it comes to gaming performance, this phone is the beast. You can play almost all games on the play store without any lag whatsoever. I have tested following games on my phone with maximum possible graphics settings- NOVA 3, GTA San Andreas, Gangster Vegas, Modern Combat 5.Battery backup on this phone is also very impressive. Once fully charged, you can use it for almost two days with normal use (wifi turned on, phone calls (~2 hours a day), music (~1 hour a day).If you are looking for a budget phone with all the essential features, Galaxy J7 is the right phone for you.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Walnut delivered", 
            "review_posted_date": "2 March 2016", 
            "review_text": "Inside Mobile package gate wall nut ....... making call by using walnut", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Hari", 
            "review_header": "worst from AMAZON", 
            "review_posted_date": "27 July 2016", 
            "review_text": "got a dummy mobile .....worst from AMAZON", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Apoorv Vibhandya", 
            "review_header": "Its Not That Great But Okay For Light Users", 
            "review_posted_date": "27 March 2017", 
            "review_text": "Hello Apoorv Here From Tech News By Apoorv And Here Is My Review For This DeviceGreat Viewing Experience with Capacitive Touch screenThe 5.5-inch Super AMOLED HD touchscreen of Samsung Galaxy J7 SM-J700F provides you with the best display. The screen comes with a resolution of 720 x 1280 pixels, 267 ppi pixels of density and colour support of 16M for further enhancement of picture quality. The touchscreen is super responsive to the tap of your fingers so that you can smoothly glide through the pages and widgets of the phone.Snaps and Selfies ZoneIf you prefer a smartphone that features a great camera, the Samsung Galaxy J7 could just be your device. The two hi-tech cameras offered by this Smartphone allow you to capture beautiful and charming shots and selfies. The 13 megapixel main camera is equipped with features like LED flash, Auto Focus, Panorama, Beauty Face, Sound & Shot, Continuous Shot and HDR (High Dynamic Range) to provide you with crystal clear images. Also, there is front 5 megapixel camera to capture ideal and cool selfies. Forget blurred and vague images and cherish beautifully captured memories with Galaxy J7 by Samsung.Sturdy and Durable BatteryThis Smartphone provides you with a solid 3000mAh battery of lithium-ion make which is not only long-lasting but also high on strength. You can now watch more videos, movies and play games for extended hours with Samsung Galaxy J7.High on PerformanceThere is 1.5GHz Octa Core Processor and 1.5GB RAM to ensure that you can seamlessly multitask on your Galaxy J7 at a fast pace. The Android 5.1.1 Lollipop Operating System provides a perfect platform to this Smartphone for smooth working of all the applications.Added FeaturesThere is internal memory space of 16GB in the Galaxy J7 by Samsung, which can further be expanded to 128GB with the help of an external SD card. So, now there is more room for storing all your important data and other multimedia files. This Smartphone works on dual SIM.Buying Link- Samsung Galaxy J7 (Gold)", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "manjunath", 
            "review_header": "Fake n refurbished phone", 
            "review_posted_date": "25 March 2016", 
            "review_text": "A used phone. The screen had visible scratches. The seal was was broken when I received the item. Very untidy container, with torn compartments", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "The Phone is really good but dont buy this phone from amazon or flipkart ...", 
            "review_posted_date": "20 April 2016", 
            "review_text": "The Phone is really good but dont buy this phone from amazon or flipkart coz the cost of the phone is just Rs.13800 when u buy it from a local shop!!!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Diya", 
            "review_header": "j7", 
            "review_posted_date": "26 December 2015", 
            "review_text": "Excellent mobile", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "i am loving it batter than Oppo,Vivo mobiles below 18k", 
            "review_posted_date": "14 March 2017", 
            "review_text": "I bought 10 days ago its simply awesome front camera is superb with flash it works fantastic. i loved it...... i bought it for selfies only and works well. i have installed two games of 2GB each and no hanging issue works pretty good in case of gaming no heating at all 1.5 GB RAM enough.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Very sad experience. Can't expect from amazon and blue dart", 
            "review_posted_date": "7 October 2016", 
            "review_text": "Very sad experience. Can't expect from amazon and blue dart. Product was given to the watchman by blue dart person where as me was there at home and spoke with that person one minute before. Product is good but after little use become very hot.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "ANKIT KUMAR", 
            "review_header": "excellent display", 
            "review_posted_date": "28 November 2016", 
            "review_text": "The phone has an excellent display with very good touch response.the rear 13 mp serves well in well lit conditions also the front flash provides an extra edge.apps and games run very smoothly on snapdragon 430.the build quality is not upto to the mark.though a good phone to buy.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Identity", 
            "review_header": "Review-read it carefully", 
            "review_posted_date": "26 October 2015", 
            "review_text": "I did not expect this phone from samsung with such a wornderful price tag and features.. I was able to get it for 12600 INR. The only drawback i found is its low speaker volume,, but that did not bother me because there is a workaround to increase its volume.. Samsung really working hard to make its touchwiz snappier and this time,, they managed it to be more snappier than pure android. Gaming performance is awesome.. Display is awesome.. I did not liked the earphones.. So i ordered another earphone to use with this.. RAM is less but performance is far better than higher RAM models.. I compared it with moto x play and overall j7 is clear winner.Android 5.1 out of the box. Battery life is awesome compared to rebranded phones in market and no heating issues which is the most common problem in xiomi, yureka, lenovo.. Belive me guys i bought this phone after a lot of reasearch and i bought this phone to give me peace of mind.. I did not wanted my phone to get heat up  everytime i use it for 5 minutes. .Thank you samsung for this great phone and amazon for great offer.Pardon typos...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "KUNJAR  MURLIDHAR BHATT", 
            "review_header": "It is marvellous", 
            "review_posted_date": "12 March 2016", 
            "review_text": "This much I can say, considering all parameters it is really an user friendly mobile. It is very good among 4G compatible mobiles.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Arun", 
            "review_header": "very good with this price", 
            "review_posted_date": "9 May 2016", 
            "review_text": "very good with this price.. camera quality is unbelievable.. phone is soo fast nd the new feature theme will make ur ph look good.. i m posting one of the pic taken from my j7", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "manju dazGrt", 
            "review_header": "very good product, I love my phone very much", 
            "review_posted_date": "25 March 2017", 
            "review_text": "very good product,I love my phone very much.amazon is only my favorite on online shopping.guarantee customer service. I bought many products.samsung galaxy J7 .  money worth.features are good.picture clarity and 4G more advanced in cheap rate.I bought 14999/-.but now I think 10000/-.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Mahendran", 
            "review_header": "AMAZING Phone..BEST phone....LOVED it", 
            "review_posted_date": "22 February 2016", 
            "review_text": "I bought this phone yesterday.....AMAZING and WONDERFUL experience with this phone...1) Display Clarity super2)Long Lasting Battery Charge3)Camera Very NICE4)Attractive Look5)Internet SPEED amazing6)Best touch experience with AMOLED screen7)Wonderful phone for GAME......I  played Asphault 8 airborne ...It never hangs...I really wondered with this phoneI am sure .....u will not be disappointed with this phone..Overall this phone is VERY BEST phone to buy this range.........don't see some idiots bad review....I have used Micromax, lenovo,htc,moto.......But J7 only ROCKZZZZZZZ......Just go for it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Worst product", 
            "review_posted_date": "19 September 2016", 
            "review_text": "worst product i received.Phone is getting heated while charging. phone battery is draining without using it.  i applied for return on 12th September but still i didn't get any call from them. do my phone get replaced ???. amazon guys. please contact me", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Nihal Sheikh", 
            "review_header": "Wowww!!", 
            "review_posted_date": "24 August 2016", 
            "review_text": "This is an Ammazing phone..at this price range", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "N Paulpandian", 
            "review_header": "Review of items recently purchased from amazon", 
            "review_posted_date": "27 June 2016", 
            "review_text": "All the above items were received good condition and meet my expectations and purpose.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "shravan", 
            "review_header": "Kuch din huye maine samsung j7 kharida. mein to ...", 
            "review_posted_date": "26 January 2016", 
            "review_text": "Kuch din huye maine samsung j7 kharida .mein to bahut khush hu...battery bkup accha hai .no hagging problem ...camera accha he dono...kahe to vesha vasul hai...so tnxxx samsung", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "gautam", 
            "review_header": "Speaker volume is pathetic.", 
            "review_posted_date": "13 September 2016", 
            "review_text": "Phone is OK. Speaker volume is pathetic.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Krati", 
            "review_header": "Had a really very bad experience with this cell phone", 
            "review_posted_date": "14 March 2017", 
            "review_text": "Had a really very bad experience with this cell phone.. If you wanna buy, will request rather not to go for this cell.. Within the very first month of warranty period, the display was broken, and it took 6500 to get it repaired, which worked for approx one year, and now again same problem.. so a total of 21k is been already spent...Better go for other Brand..This is not good. #FeelingAnnoyedThanks.", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Atul Upadhyay", 
            "review_header": "Best smartphone......!!!!", 
            "review_posted_date": "15 April 2016", 
            "review_text": "Awesome cell... Don't think to much .. Just go for it... I choosed one day delivery n got next day early morning. Working smoothlyyyyyy...fastt n furious... Internet speed is too fasttttt if u compare wid other frnd's cellphone at the same time connected in same network.. Camera front and back both are OK n good. 1.5gb ram ...less but Seems like it has above 2gb ram. Happy aftr purchasing this product.. !!!!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Karan Singha", 
            "review_header": "Should I buy it???", 
            "review_posted_date": "3 April 2017", 
            "review_text": "HELLO GUYS WELCOME. IN THIS REVIEW I AM GOING TO TELL YOU WHETHER WE SHOULD BUY THIS PHONE OR NOT. SO LETS START.  THIS REVIEW INCLUDES ABOUT THE SPECS, PROS AND CONS AND OF COURSE MY PERSONAL OPINIONS.SPECIFICATIONS AND PROS OF THE PHONE-CAMERA-  13 MP primary camera with auto focus, LED flash, geotagging, touch focusface detection, panorama AND 5 MP front facing camera. Camera is very good.DISPLAY- 5.5-inch (13.97 centimeters) Super AMOLED capacitive touchscreen720 x 1280 pixels resolution, 267 ppi pixel density16M color supportOPERATING SYSTEM-Android v5.1 Lollipop operating system1.5GHz octa core processorMali T720MP2 GPURAM- 1.5GB RAM, 16GB internalmemory expandable up to 128GB and dual micro SIM (GSM+GSM)BATTERY-3000mAH lithium-ion batteryWARRANTY-1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase  ##############################CONS################################1) BATTERY COULD BE BETTER.2)ONLY Accelerometer, Proximity sensor are present and you may not be able to experience Virtual Reality.3) Processor could be better. You may experience lags and jams while gaming. AlSO RAM IS VERY LESS.  IN THIS PRICE RANGE YOU MAY BUY REDMI NOTE 4 (2GB RAM VARIANT RS. 9999) WHICH IS MUCH BETTER.YOU CAN SPEND SOME MORE AND BUY PHONES LIKE REDMI NOTE 4(3GB RAM OR 4GB RAM).LENEVO VIBE K5 ETC.ACCORDING TO ME PLEASE DONT WASTE YOUR VALUABLE MONEY FOR SUCH PHONE.  Friends if this review was useful then please vote for me . THANK YOU AND HAVE A NICE AND SAFE DAY.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Ravi", 
            "review_header": "SAMSUNG J7 IS trusted device of2015", 
            "review_posted_date": "1 March 2016", 
            "review_text": "Samsung j7Display clarity bestCamera always ahead SamsungFront flash good when traveling at night time16gb good for install applicationsHardware is best octa core no heating issueSoftware decent compared to Samsung old device no hanging issue", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Everything in this product is just amazing..", 
            "review_posted_date": "12 April 2016", 
            "review_text": "Everything in this product is just amazing...picture clarity, sound, etc...but the colour is slightly like affecting ur eyes if u watch for more than 1/2 an hour...else the product is very useful...u must buy it", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Superb phone  galaxy j700", 
            "review_posted_date": "23 October 2015", 
            "review_text": "I'm the j7 user for the past 4 months. .  I find very useful ..display clarity is awesome .  . Good battery backup. . Camera with dual flash.  I give 5 ⭐ its supports  otg .", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Amazing Phone! Amazing camera and photo quality", 
            "review_posted_date": "20 November 2015", 
            "review_text": "Amazing Phone! Amazing camera and photo quality. Sound is lower compared. It gives good with a headset. The back cover is too thin and delicate, thin plastic. The battery backup is quite good. The display is amazing. Sleek and slim. Gold gives an elite and classy feel. Doesnot hang too much. Features like ultra internet saver and ultra battery saver are very good. Overall, its more than worth for the cost!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "equbaljawaid", 
            "review_header": "Good", 
            "review_posted_date": "19 October 2016", 
            "review_text": "Good looking mobile", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Amazing phone...................:)", 
            "review_posted_date": "10 March 2016", 
            "review_text": "I bought this phone yesterday.....AMAZING and WONDERFUL experience with this phone...1) Display Clarity super2)Long Lasting Battery Charge3)Camera Very NICE4)Attractive Look5)Internet SPEED amazingOverall this phone is VERY BEST phone to buy this range.........", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Nisha", 
            "review_header": "Nice phone", 
            "review_posted_date": "3 December 2016", 
            "review_text": "Very good phone .....I got it for my dad and he's too happy to use it....", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "SUBIR CHATTERJEE", 
            "review_header": "samsung at its recent best.", 
            "review_posted_date": "25 December 2015", 
            "review_text": "One of the best phone I've ever come across. The phone is at its peculiar best. Camera being 13 and 5 is all the hunt you need. Music on its mix radio is magnanimous. Ultra saving mode is really a hero. Thankyou Samsung for such a discovery within 15k.Amazon is worth a trust with this. Delivery is proper as well. Thankyou amazon for the quickest of delivery. Fin.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Best mobile at rs15000", 
            "review_posted_date": "19 January 2016", 
            "review_text": "Best mobile at rs15000 ...the best part of this mobile is its display and power full processor.. all the high end games in google play runs smoothly even though the ram is lil bit low 1.5 gb ...but it never hangs yet i m using it from oct2015  ..great job by samsung ......coming upto amazon service its really nyc i received myproduct in 48hrs ...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Nice phone with given specifications", 
            "review_posted_date": "24 January 2016", 
            "review_text": "Nice phone with given specifications. Bit costly just for an extra 8GB of internal memory compared to Galaxy On7. The only problem within first day of usage is that its ring volume is extremely low. If you keep the phone on bed, then you might not be able to hear the ringtone. Rest all is as expected. Good faster delivery from Amazon.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Awesome product", 
            "review_posted_date": "25 September 2016", 
            "review_text": "I m using this mobile since a monthIt's really a awesome product.The clarity of images are more or less equal to cannon 1200d pics .In simple words,a handy gadget for all my electronic needs.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "priti Gupta", 
            "review_header": "Sound problem rest a very good phone", 
            "review_posted_date": "11 August 2016", 
            "review_text": "This phone is very good but the only problem is its sound,it's very very low I cannot able to hear also", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "nitish", 
            "review_header": "j7 loves u", 
            "review_posted_date": "8 April 2016", 
            "review_text": "One word awsm ......1 - The phone doesnot heat at all on exynos versionBut who got snapdragon may got heating problem.......2 - Awsm touch experience. ....3 -  No laging or hanging at all....4 -  1.5 gb ram is good enough with comparison of other Chinese 3gb ram phones.......5 -  Octacore makes work easy  and fast ......6 -  I personally a heavy user of cellphones and it's battery backup is amazing approxiamete 1.5 days on power saving mode and more than 2days on ultra power saving mode and if you are a moderate user then it go for 2days normally without apply power saving...7 - Look is fabulous and superb....and gold colour is more classy and gives premium loop to your good looking personality. ...8 -  Video quality is superb and support almost all type of video and audio format which is hardly you found in today's mobile model........9 - Super amoled screen rocks again.....10 - Try to use ultra data saving its really save your data3g downloading speed is very good in comparison of other  1gb movie download in approxiamete 12 to 15 minutesAnd browsing on 2g is goodI not tried on 4g .......11 - Camera is terrific both rear and front have flash with panorama which is superb .......12 - Call quality is good and good enough .......I hope you guys got some benefit with this review and have no doubt before buying this lovely Samsung galaxy j7 .......Not found any cons except the screen protection ....but we manage by applying temper glass...Note_ please use class 10 memory card with all premium smartphones including j7........Thanks for reading my review", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Stephen D'souza", 
            "review_header": "Five Stars", 
            "review_posted_date": "15 March 2017", 
            "review_text": "Good Product, slim and sleek design, best mobile for average users.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "15 April 2016", 
            "review_text": "awesome mobile......every thing is awesome I loved it.....but charger quality is not good that's all", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Ansari k.", 
            "review_header": "One Star", 
            "review_posted_date": "13 October 2016", 
            "review_text": "I not get the mobile and I had paid the amount", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Arun", 
            "review_header": "very good with this price", 
            "review_posted_date": "9 May 2016", 
            "review_text": "very good with this price.. camera quality is unbelievable.. phone is soo fast nd the new feature theme will make ur ph look good.. i m posting one of the pic taken from my j7", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "B. VENKATESH KUMAR", 
            "review_header": "2015 certified buyer Awesome Phone This Phone is Simply Awesome", 
            "review_posted_date": "13 March 2016", 
            "review_text": "Mohit MakhijaAug 24, 2015certified buyerAwesome PhoneThis Phone is Simply Awesome.If you are looking to buy phone under 15k this is perfect phone.Review after 2 days of use..will update after 30 days of use.PROS:1) Display is pretty good with vibrant colors.2) Touch is smooth and responsive.3) Build quality is good and look of this phone in gold color is great.4) Camera quality is simply Brilliant(Both front and rear)5) Battery backup is goodas you expect from 3000maH battery.6)No lag or hanging problem as of now and you shounld not expect hanging problem with 1.5GB of RAM and Octacore processor.7)Slim and Light Weight.8) Front Flash", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Bakwas", 
            "review_posted_date": "12 March 2017", 
            "review_text": "Is me bhi delivery bakwas thi sweep machine kaam hi nhi kar rhi thi. Bo sukar h Modi ji ka jis ki vjha se mena net banking use ki or problm solve hui", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Ravi", 
            "review_header": "Four Stars", 
            "review_posted_date": "2 March 2017", 
            "review_text": "Good", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Bhaswati Sarkar", 
            "review_header": "Three Stars", 
            "review_posted_date": "11 December 2016", 
            "review_text": "All though the phone is good but the seal of the package was broken.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Gud but volume v. low. u cannot even ...", 
            "review_posted_date": "5 March 2017", 
            "review_text": "Gud but volume v.low. u cannot even here the ring whn u r in another room. Otherwise gud", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "10 January 2017", 
            "review_text": "Good..", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Worst experience ever...", 
            "review_posted_date": "23 March 2017", 
            "review_text": "I have purchased since a week but Sound quality is very poor, not able to hear voice, worst experience ever.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Not happy with quality", 
            "review_posted_date": "23 March 2017", 
            "review_text": "Camera not clear& Very slow processing​Want to return phone", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Screen started flickering after charging and replacement was not possible ...", 
            "review_posted_date": "19 August 2016", 
            "review_text": "Screen started flickering after charging and replacement was not possible after 10 days. It took time to understand the new system so online shopping does not work for me at all. Truely dissatisfied with my online shopping experience. Maybe it's a minute problem even that could not be solved cause the product was purchased online. No support what so ever.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amruta V. Choudhary", 
            "review_header": "not good", 
            "review_posted_date": "21 February 2017", 
            "review_text": "This mobile is not working properly.We dont want this peace kindly replace .We dont have that much time to go galary and collect the repoŕtKindly take the matter seriously and replace the same model at the earliest", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "20 March 2017", 
            "review_text": "Ok", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Worst product sell by amazon.", 
            "review_posted_date": "4 July 2016", 
            "review_text": "Amazon sell very worst product i was buy a phone samsung j7 within 3 month my display has blinking..not working..seller name my dukaan.when I was buy this phn no laminate in display..care set he is dummy set..he ignore for repair the phone..", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Hari", 
            "review_header": "worst from AMAZON", 
            "review_posted_date": "27 July 2016", 
            "review_text": "got a dummy mobile .....worst from AMAZON", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Clarence masih dilawar", 
            "review_header": "One Star", 
            "review_posted_date": "17 March 2017", 
            "review_text": "Very bad phone never buy it. Camera quality is also not good.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "23 March 2017", 
            "review_text": "Ya this is nice phone and picture quility is very best .", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Ashish", 
            "review_header": "Awesome Amoled screen is better than all other competitor High ...", 
            "review_posted_date": "4 March 2017", 
            "review_text": "Just...AwesomeAmoled screen is better than all other competitorHigh end Gaming is awesom", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "manjunath", 
            "review_header": "Three Stars", 
            "review_posted_date": "26 March 2017", 
            "review_text": "Thank you", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Shreyas", 
            "review_header": "Highly recommended phone", 
            "review_posted_date": "26 January 2017", 
            "review_text": "Excellent phone...I have been using this phone for more than a year and I can assure you that you will not regret buying this one. I bought mine from Samsung retail store so I cannot talk about amazon service for this product.The only problem with J7 is that it does not feature Corning Gorilla glass. But if you get a tampered glass, the phone's screen will be protected from dust and scratches. If you need gorilla glass protection, you might want to buy J7 prime. It has all the features of J7 2015 model except AMOLED display which I think is far better than IPS display in terms of color depth and brightness of the screen.When it comes to gaming performance, this phone is the beast. You can play almost all games on the play store without any lag whatsoever. I have tested following games on my phone with maximum possible graphics settings- NOVA 3, GTA San Andreas, Gangster Vegas, Modern Combat 5.Battery backup on this phone is also very impressive. Once fully charged, you can use it for almost two days with normal use (wifi turned on, phone calls (~2 hours a day), music (~1 hour a day).If you are looking for a budget phone with all the essential features, Galaxy J7 is the right phone for you.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "I had purchase samsung galaxy j7 mobile in going offer ...", 
            "review_posted_date": "30 November 2015", 
            "review_text": "I had purchase samsung galaxy j7 mobile in going offer 15% on app 10% on citi bank card but no discount made by you. Please do the needful at your end as soon as possible.thankspraveen kumar9555945927", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Everything in this product is just amazing..", 
            "review_posted_date": "12 April 2016", 
            "review_text": "Everything in this product is just amazing...picture clarity, sound, etc...but the colour is slightly like affecting ur eyes if u watch for more than 1/2 an hour...else the product is very useful...u must buy it", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Fastest prime", 
            "review_posted_date": "25 March 2017", 
            "review_text": "Thank you Amazon for fast delivery of my mobile...And nice handset looking cool in white colour...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Non reliable low quality phone having problems with display and they will never cover it under warranty.", 
            "review_posted_date": "11 October 2016", 
            "review_text": "I have purchased j7 through amazon on 30th october.a few days back a white line appeared on my display and I approached service centre and they are claiming that display went off due to internal damage caused by excessive pressure applied while using the phone and cant be covered under warranty!!!!.my phone looks brand new.they are asking for 6500 rs for screen.i called samsung customer care and they are putting forward absurd reasons:“*putting in jeans pocket*putting in bag etc can cause the display to get damaged and hence not covered under warranty!!!I am going to fight against samsung legally.Also please dont buy j7.j7 is very low quality phone that lacks reliability and hence they are promoting it through online market places like amazon and flipkart.you can get better mobiles from lg motorola etc.u can google reviews about j7 and see the complaints.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "J7", 
            "review_posted_date": "10 January 2016", 
            "review_text": "Got this phone on Jan-07-2016 after many Android  search , comparisons  I selected  this phone simply awesome  nd best in class .Camera  both front and back was best in class as touch factor  good 1 overall  good phone  for midrange  phone buyers.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "3 March 2017", 
            "review_text": "Gr8 phone", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "i am loving it batter than Oppo,Vivo mobiles below 18k", 
            "review_posted_date": "14 March 2017", 
            "review_text": "I bought 10 days ago its simply awesome front camera is superb with flash it works fantastic. i loved it...... i bought it for selfies only and works well. i have installed two games of 2GB each and no hanging issue works pretty good in case of gaming no heating at all 1.5 GB RAM enough.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "First the display is big and awesome, the touch is even better than other samsung ...", 
            "review_posted_date": "30 January 2016", 
            "review_text": "I will write this review step by step. First the display is big and awesome, the touch is even better than other samsung phones and can be comparable to samsung s6 and far better than micromax and etc. I bought the phone 2 months ago and it got fell down 3 times since then but it is working as good as new. The 3000mah battery is really awesome no heating issue at all, playing asphalt 8 for 2 hrs and it gives me 24 hr full backup on single charge, yes i used it for 24 hrs(Day+ Night)  on single charge while on a vacation. Dont worry about the 1.5 gb ram trust me it works better than micromax phone having 2 gb ram. My phone never hang at all although i'm a heavy gamer playing asphalt8 all day. And the camera is just awesome both the front and rear. I'm uploading a photo i have clicked on my phone camera.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Atul Upadhyay", 
            "review_header": "Best smartphone......!!!!", 
            "review_posted_date": "15 April 2016", 
            "review_text": "Awesome cell... Don't think to much .. Just go for it... I choosed one day delivery n got next day early morning. Working smoothlyyyyyy...fastt n furious... Internet speed is too fasttttt if u compare wid other frnd's cellphone at the same time connected in same network.. Camera front and back both are OK n good. 1.5gb ram ...less but Seems like it has above 2gb ram. Happy aftr purchasing this product.. !!!!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Karan Singha", 
            "review_header": "Should I buy it???", 
            "review_posted_date": "3 April 2017", 
            "review_text": "HELLO GUYS WELCOME. IN THIS REVIEW I AM GOING TO TELL YOU WHETHER WE SHOULD BUY THIS PHONE OR NOT. SO LETS START.  THIS REVIEW INCLUDES ABOUT THE SPECS, PROS AND CONS AND OF COURSE MY PERSONAL OPINIONS.SPECIFICATIONS AND PROS OF THE PHONE-CAMERA-  13 MP primary camera with auto focus, LED flash, geotagging, touch focusface detection, panorama AND 5 MP front facing camera. Camera is very good.DISPLAY- 5.5-inch (13.97 centimeters) Super AMOLED capacitive touchscreen720 x 1280 pixels resolution, 267 ppi pixel density16M color supportOPERATING SYSTEM-Android v5.1 Lollipop operating system1.5GHz octa core processorMali T720MP2 GPURAM- 1.5GB RAM, 16GB internalmemory expandable up to 128GB and dual micro SIM (GSM+GSM)BATTERY-3000mAH lithium-ion batteryWARRANTY-1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase  ##############################CONS################################1) BATTERY COULD BE BETTER.2)ONLY Accelerometer, Proximity sensor are present and you may not be able to experience Virtual Reality.3) Processor could be better. You may experience lags and jams while gaming. AlSO RAM IS VERY LESS.  IN THIS PRICE RANGE YOU MAY BUY REDMI NOTE 4 (2GB RAM VARIANT RS. 9999) WHICH IS MUCH BETTER.YOU CAN SPEND SOME MORE AND BUY PHONES LIKE REDMI NOTE 4(3GB RAM OR 4GB RAM).LENEVO VIBE K5 ETC.ACCORDING TO ME PLEASE DONT WASTE YOUR VALUABLE MONEY FOR SUCH PHONE.  Friends if this review was useful then please vote for me . THANK YOU AND HAVE A NICE AND SAFE DAY.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Krati", 
            "review_header": "Had a really very bad experience with this cell phone", 
            "review_posted_date": "14 March 2017", 
            "review_text": "Had a really very bad experience with this cell phone.. If you wanna buy, will request rather not to go for this cell.. Within the very first month of warranty period, the display was broken, and it took 6500 to get it repaired, which worked for approx one year, and now again same problem.. so a total of 21k is been already spent...Better go for other Brand..This is not good. #FeelingAnnoyedThanks.", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "ANKIT KUMAR", 
            "review_header": "excellent display", 
            "review_posted_date": "28 November 2016", 
            "review_text": "The phone has an excellent display with very good touch response.the rear 13 mp serves well in well lit conditions also the front flash provides an extra edge.apps and games run very smoothly on snapdragon 430.the build quality is not upto to the mark.though a good phone to buy.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Walnut delivered", 
            "review_posted_date": "2 March 2016", 
            "review_text": "Inside Mobile package gate wall nut ....... making call by using walnut", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Manish B.", 
            "review_header": "Great Phone from the leader", 
            "review_posted_date": "3 November 2015", 
            "review_text": "I purchased it from flipkart 3 months back. The major highlight of this phone is it's battery and display. I am a hard user of mobile with whole day WiFi use and 20-25 calls. Charging full in morning leaves me with around 45% battery at 10.00 p.m.The display is crisp and bright. Camera is not excellent but very good. Features like smart manager and otg support makes it a good deal. Coupled with extended storage, dual sim, 4g LTE,  it is a steal at this price. Though the Ram is only 1.5 gb still I have never seen this phone lagging. Finally the after sale customer service is very good courtesy to large offline dealership of Samsung. I highly recommend this phone.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "manjunath", 
            "review_header": "Fake n refurbished phone", 
            "review_posted_date": "25 March 2016", 
            "review_text": "A used phone. The screen had visible scratches. The seal was was broken when I received the item. Very untidy container, with torn compartments", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "KUNJAR  MURLIDHAR BHATT", 
            "review_header": "It is marvellous", 
            "review_posted_date": "12 March 2016", 
            "review_text": "This much I can say, considering all parameters it is really an user friendly mobile. It is very good among 4G compatible mobiles.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "A.G.Amal", 
            "review_header": "Look before you leap/buy", 
            "review_posted_date": "11 September 2016", 
            "review_text": "I didn't buy this mobile from amazon but bought it outside for Rs 13,500.All im doing is to give a  detailed review about this phone before buying this.Pros:•Nice design with super AMOLED display•Good battery life•Can be upgraded to marshmallow•1.5GB RAM and 16GB internal•Dual sim support (both 4G) and also supports VOLTE (as stated in reliance jio supported mobile)•13MP back camera and 5MP front (flash supported on both side but front flash can be used only like a flashlight while taking picture) and supports OTG etcCons:•volume from speaker is very very less•No NFC support,No screen mirroring,no noise cancellation mic•If we slightly shake or move the mobile while taking picture,it gets blurred•Even after having less apps,the phone tends to hang sometimesMy genuine opinion:Please go for some other good mobile like galaxy E5(SM-E500F only),it supports everything and price also low(somewhat smaller screen size than j7 and no OTG support)J7 is not a good phone at this range", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "The Phone is really good but dont buy this phone from amazon or flipkart ...", 
            "review_posted_date": "20 April 2016", 
            "review_text": "The Phone is really good but dont buy this phone from amazon or flipkart coz the cost of the phone is just Rs.13800 when u buy it from a local shop!!!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Divyansh joshi", 
            "review_header": "Best phone under 15k", 
            "review_posted_date": "22 January 2016", 
            "review_text": "First of all samsung has proved that their TOUCH WIZ doesn't lag anymore. ..its much more snappier than android vanilla ...Its super amoled so no complains for display ...its just mind blowingOcta care take cares of all your games and apps no problemDecent 13 mp shooter...Nice flash...Awesome battery life...1.5 gb ram but no lag in performance no hangging issue till now...Web surfing is extremely delightful...Just go for it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Nihal Sheikh", 
            "review_header": "Wowww!!", 
            "review_posted_date": "24 August 2016", 
            "review_text": "This is an Ammazing phone..at this price range", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Moni", 
            "review_header": "Five Stars", 
            "review_posted_date": "28 January 2016", 
            "review_text": "I presented to mom n she likes it.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "saif azeez", 
            "review_header": "Five Stars", 
            "review_posted_date": "30 December 2015", 
            "review_text": "Best mobile in this price....nice camera both front and rear....got it in local store for 14900rs with offers selfie stick, screen guard, back cover & casserol..", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "poor speaker volume", 
            "review_posted_date": "16 June 2016", 
            "review_text": "no body informed in any review that speaker volume is low in j7", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Cant hear phone ring and speakers are very low", 
            "review_posted_date": "10 October 2016", 
            "review_text": "The speakers did not work.  Returned the phone.  Had issues with the return and had to call Amazon quite a few times to be successful.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Rockstar", 
            "review_header": "this is really a nice buy, Display is crisp", 
            "review_posted_date": "22 January 2016", 
            "review_text": "I bought it from another website 5 months back, this is really a nice buy, Display is crisp, no lags so far while multitasking. Photos are with lively colors.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Worst experience", 
            "review_posted_date": "24 November 2016", 
            "review_text": "Box not sealed, product is used", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Purushotham", 
            "review_header": "Please do not buy this mobile. 4G will not ...", 
            "review_posted_date": "22 February 2016", 
            "review_text": "Please do not buy this mobile. 4G will not work properly and this is the feedback given by Samsung Service center and and Samsung doenst have any solution for this as of now. Ring tone volume is very less I am suffering because of Samsung", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Swapan K. Mukhopadhyay", 
            "review_header": "Five Stars", 
            "review_posted_date": "7 July 2016", 
            "review_text": "Its a good, but price is high.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Ashish Raj", 
            "review_header": "Very good Phone", 
            "review_posted_date": "5 December 2015", 
            "review_text": "bar guy's This is ashish and today i give a review of galaxy j7I used this phone for 7 days Its A 4G phone so its very fast i used 4G in this phone of airtel and its work quite well in Karnataka.Display ••••••Its super amoled display so its looking very crisp .Very clearSound°°°°°°Very clear sound and its vey loud but not louder than moto x playCamera°°°°°°°13 mp back 5 mp Front with led flashlight very clear both camera and focus very nice.......Processor•••••••Octa core cpu media tek chip setSo all game work quite niceBut one problem its has a 1.5gb ram but i not too bad so over all this phone is very nice🌟🌟🌟🌟🌟", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "28 March 2016", 
            "review_text": "best Samsung mobile for all of us.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "And believe me this phone is as good as s6", 
            "review_posted_date": "12 January 2017", 
            "review_text": "I have using galaxy series from galaxy 1 to galaxy s6 and I just bought j7 . And believe me this phone is as good as s6 .It's just awesome.  Go get it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "15 April 2016", 
            "review_text": "awesome mobile......every thing is awesome I loved it.....but charger quality is not good that's all", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "MOHIT NAGPAL", 
            "review_header": "Five Stars", 
            "review_posted_date": "30 August 2016", 
            "review_text": "No problems and its been almost 6 months i think.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Mahesh B", 
            "review_header": "Five Stars", 
            "review_posted_date": "26 August 2016", 
            "review_text": "Good product, arrived at time and working smooth!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "5 STAR", 
            "review_posted_date": "22 January 2016", 
            "review_text": "Very Nice service by amazon & Samsung J7 also...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Mahendran", 
            "review_header": "AMAZING Phone..BEST phone....LOVED it", 
            "review_posted_date": "22 February 2016", 
            "review_text": "I bought this phone yesterday.....AMAZING and WONDERFUL experience with this phone...1) Display Clarity super2)Long Lasting Battery Charge3)Camera Very NICE4)Attractive Look5)Internet SPEED amazing6)Best touch experience with AMOLED screen7)Wonderful phone for GAME......I  played Asphault 8 airborne ...It never hangs...I really wondered with this phoneI am sure .....u will not be disappointed with this phone..Overall this phone is VERY BEST phone to buy this range.........don't see some idiots bad review....I have used Micromax, lenovo,htc,moto.......But J7 only ROCKZZZZZZZ......Just go for it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "narendra suthar", 
            "review_header": "best mobile in 15000₹", 
            "review_posted_date": "16 April 2016", 
            "review_text": "It is so good. It full fill our expectation", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "2 December 2015", 
            "review_text": "Its quite good phone compare to the other.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "pooja", 
            "review_header": "Perfect phone buy it with out thinking", 
            "review_posted_date": "31 December 2015", 
            "review_text": "Awesome phone", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Cant hear phone ring and speakers are very low", 
            "review_posted_date": "10 October 2016", 
            "review_text": "The speakers did not work.  Returned the phone.  Had issues with the return and had to call Amazon quite a few times to be successful.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "24 March 2016", 
            "review_text": "awesome", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "1 June 2016", 
            "review_text": "Should provide free cover.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Rahul Narayanan", 
            "review_header": "and upload some great photos taken by", 
            "review_posted_date": "16 July 2016", 
            "review_text": "Still Learning Features,Feedback more once all features tested,and upload some great photos taken by J7", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "amrito chakraborty", 
            "review_header": "A good device", 
            "review_posted_date": "27 December 2015", 
            "review_text": "I had previously  Samsung  Grand..worst experience. ...my 18000 went to dustbin...then I bought J7 month ago...awesome experience. ..Samsung move on from its famous hanging problem...no hanging at all...battery back up is good...touch is smooth...play any game without hesitation. ..good camera...nice display...charging is very fast..one problem is that sound is little bit low..it's clear but low so you can't hear in congestive places...overall great experience. ..go for it...you will not regreat", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Rita K.", 
            "review_header": "Samsung Galaxy J7 Gold speaker of the phone sucks! guy's", 
            "review_posted_date": "23 October 2015", 
            "review_text": "Samsung Galaxy J7 Goldspeaker of the phone sucks! guy's,if anybody is thinking of carrying this in your pocket you will not hear the phone ring.", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Display is damaged within 5 months", 
            "review_posted_date": "28 September 2016", 
            "review_text": "I purchased Samsung J7 on 15/12/15. But within a very short time of 5 months it's display shows some problems. It completly gets blurred when brightness reduced and nothing is visible then. As it was in warranty period so I sent it to service centre. They told me to get its feedback after one week. When I asked for it after one week they told me that they could not rectify it as already such type of problems is already pending in their service centre for a long time. They told me to wait again for 15- 20 days. This is complete negligence of customer canplaints and harrasement to customer. Very very disappointed with Samsung service. Will NEVER BUY a SAMSUNG phone.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Phone is Awesome", 
            "review_posted_date": "29 June 2016", 
            "review_text": "I got in delivery time. Handset is in good condition and camera clearity is good. Touch quality is good", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "16 March 2016", 
            "review_text": "Good phone amazing camera quality", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "KISHORE SINGH ADVOCATE", 
            "review_header": "No compare", 
            "review_posted_date": "23 March 2016", 
            "review_text": "I brought this 3rd feb...such a wonderfull set....picture & screen quality is unbelievable ..battery wob", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "deepak", 
            "review_header": "Great Phone by Samsung", 
            "review_posted_date": "29 July 2016", 
            "review_text": "It is a nice phone. Good display, good camera and it never hangs. I have installed multiple apps and it never hangs. This is good product by Samsung. Only disappointment is low speaker volume and I am ok with it. Headphones provided in the box was not good. It has low quality. Overall its a great Phone. I will rate 4/5.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Gaurav", 
            "review_header": "Five Stars", 
            "review_posted_date": "29 March 2016", 
            "review_text": "wonderful mobile ....fast speed, good feature  big disssplay", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "15 March 2016", 
            "review_text": "Very nice phone from Samsung. Excellent service from Amazon.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Good", 
            "review_posted_date": "25 July 2016", 
            "review_text": "Havent buyed it from Amazon but would like to tell that this phone is amazing.. brought it in local store in my city", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "24 May 2016", 
            "review_text": "Great phone in this price range....", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Identity", 
            "review_header": "Review-read it carefully", 
            "review_posted_date": "26 October 2015", 
            "review_text": "I did not expect this phone from samsung with such a wornderful price tag and features.. I was able to get it for 12600 INR. The only drawback i found is its low speaker volume,, but that did not bother me because there is a workaround to increase its volume.. Samsung really working hard to make its touchwiz snappier and this time,, they managed it to be more snappier than pure android. Gaming performance is awesome.. Display is awesome.. I did not liked the earphones.. So i ordered another earphone to use with this.. RAM is less but performance is far better than higher RAM models.. I compared it with moto x play and overall j7 is clear winner.Android 5.1 out of the box. Battery life is awesome compared to rebranded phones in market and no heating issues which is the most common problem in xiomi, yureka, lenovo.. Belive me guys i bought this phone after a lot of reasearch and i bought this phone to give me peace of mind.. I did not wanted my phone to get heat up  everytime i use it for 5 minutes. .Thank you samsung for this great phone and amazon for great offer.Pardon typos...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Superb phone  galaxy j700", 
            "review_posted_date": "23 October 2015", 
            "review_text": "I'm the j7 user for the past 4 months. .  I find very useful ..display clarity is awesome .  . Good battery backup. . Camera with dual flash.  I give 5 ⭐ its supports  otg .", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "24 December 2015", 
            "review_text": "REALLY I LIKE J7 SMART PHONE ITS GOOD PHONE AND FACILITY", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Moni", 
            "review_header": "Five Stars", 
            "review_posted_date": "28 January 2016", 
            "review_text": "I presented to mom n she likes it.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "20 January 2016", 
            "review_text": "Nice phone", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "4 April 2016", 
            "review_text": "Amazing phone at the price point. The display is wonderful and the camera quality is simply fantastic. Well done.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Rahul Narayanan", 
            "review_header": "and upload some great photos taken by", 
            "review_posted_date": "16 July 2016", 
            "review_text": "Still Learning Features,Feedback more once all features tested,and upload some great photos taken by J7", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Fara", 
            "review_header": "Best phone", 
            "review_posted_date": "19 December 2015", 
            "review_text": "Awesome fantastic phone ...worth the price.. bought kn amazon ..battery good.. stereo good... memory good.... canera descent.... screen to body ratio amazing ...best buy", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Worst experience", 
            "review_posted_date": "24 November 2016", 
            "review_text": "Box not sealed, product is used", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "saif azeez", 
            "review_header": "Five Stars", 
            "review_posted_date": "30 December 2015", 
            "review_text": "Best mobile in this price....nice camera both front and rear....got it in local store for 14900rs with offers selfie stick, screen guard, back cover & casserol..", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Phone is Awesome", 
            "review_posted_date": "29 June 2016", 
            "review_text": "I got in delivery time. Handset is in good condition and camera clearity is good. Touch quality is good", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Rockstar", 
            "review_header": "this is really a nice buy, Display is crisp", 
            "review_posted_date": "22 January 2016", 
            "review_text": "I bought it from another website 5 months back, this is really a nice buy, Display is crisp, no lags so far while multitasking. Photos are with lively colors.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Swapan K. Mukhopadhyay", 
            "review_header": "Five Stars", 
            "review_posted_date": "7 July 2016", 
            "review_text": "Its a good, but price is high.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "saimahesh", 
            "review_header": "I am a iphone6 user. then i bought this ...", 
            "review_posted_date": "19 December 2015", 
            "review_text": "I am a iphone6 user .then i bought this phone .but not in amazon.this phone rocks in one word.It is a tough compitator for high budget mobiles.Gaming-5/5Graphics-4.5/5Camera quality-4.5/5Battery-5/5 (lasts gor one day even in rough use)This is a highly recommened product by me in mid range phones .", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Kamal Singh Rawat", 
            "review_header": "It's excellent and has a great display", 
            "review_posted_date": "10 August 2016", 
            "review_text": "i purchased this phone for it's s-bike feature. It's excellent and has a great display. loving it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "31 May 2016", 
            "review_text": "Very handy and proud feeling", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "23 March 2017", 
            "review_text": "i lick it but i dosent know thai its 4 lte or not", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "its awesome phone, gud battery backup", 
            "review_posted_date": "22 June 2016", 
            "review_text": "its awesome  phone, gud battery backup, camera quality good, Voice quality and price also gud", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "me so happy with amazon", 
            "review_posted_date": "28 August 2016", 
            "review_text": "awsm phone  and awsm amazon", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "1 June 2016", 
            "review_text": "Should provide free cover.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "28 March 2016", 
            "review_text": "best Samsung mobile for all of us.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Samsung is known for its display quality and camera.", 
            "review_posted_date": "22 August 2016", 
            "review_text": "Good brand and nice mobile with good features but the sound frequency is too low . :-(", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "manohar singh", 
            "review_header": "Bad packing quality samsung j7 very nice", 
            "review_posted_date": "30 June 2016", 
            "review_text": "Packing depart  qualityvery  low.. Bad packing qualitysamsung j7 very nice", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "J7 best phone", 
            "review_posted_date": "3 August 2016", 
            "review_text": "Good phone..Has great featuresBattery power is greatDoesn't heat up", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "21 August 2016", 
            "review_text": "Awsm phone with awsme features.only ludicrous thing is 1.5 gb ram.wndrful camra both", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Using from last 6 months Nice mobile Good battery backup Good camera Nice screen touch ...", 
            "review_posted_date": "30 August 2016", 
            "review_text": "Using from last 6 daysNice mobileGood battery backupGood cameraNice screen touch feelnot a bad deal in 13490rs", 
            "review_rating": "4.0 "
        }
    ], 
    "name": "Samsung Galaxy J7 SM-J700F (Black, 16GB)"
}