{
    "total_ratings": "86", 
    "ratings": {
        "2 star": "12", 
        "1 star": "13", 
        "4 star": "22", 
        "3 star": "10", 
        "5 star": "29"
    }, 
    "price": "₹ 13490.00", 
    "reviews": [
        {
            "review_author": "Mohit", 
            "review_header": "Read this carefully before going through the negative reviews", 
            "review_posted_date": "14 March 2017", 
            "review_text": "I Bought This Phone 2 Weeks ago====================I have gone through all the reviews and I have picked out the cons of the phone which other users have been stating and would like to confirm if it's true or not.=========================Camera: Users are saying that there is no front led flash and you would get better specs in those China phones for a cheaper price. This is true but it has a selfie flash (the phone screen shines light on your face before clicking the photo) and I have tried phones with both flash and I realized that selfie flash is better. It is used on the iPhone 6 as well... when you use a led flash on some phones, The brightness is too much and it causes the picture to look unrealistic and extra bright. But the light on the selfie flash is convenient and moderate and it brings out crisp and clear photos that look realistic.In Low light the pictures are quite impressive.Battery: Users are saying the phone has poor battery life. This is also untrue, before the first use you have to switch the phone off and charge the phone till it reaches 100% before using it (It is even written in the user manual to charge it before first use) otherwise if you boot the phone directly for the first time after buying it and start using it right away.. the battery performance will be reduced.Battery life: when phone is fully charged, On minimal usage (only 4g browsing and calls) my battery lasts for at least 36 hours and with heavy usage it lasts for minimum 12 hours+Screenshot: I read a review saying it doesn't take screenshots! Oh my goodness such ignorance!! Hold the power button and home button for 3 seconds to take a screenshot. Simple as ABCNo Super Amoled: This is true which makes it difficult to use the screen outdoors under the sun however the display is still very good and clear. (Samsung always has good display) The phone has an outdoor mode which brightens the screen and you can use the phone perfectly.And one last thing, some of these people giving negative reviews may not even have the phone. They might just be writing based on what they've heard from others. Some know nothing about phones and are just writing crap.The phone is excellent. Branded phone is called branded phone for a reason. You buy them and use them for such a long time... just buy it and enjoy the satisfaction of owning a branded phone.Samsung has really done well by giving reasonable features at this price.Some of those China phones don't last long and have lots of problems later in the long run.Besides Samsung gives one year warranty with this phone.So I would advise you to go for this phone if you have 14k to spare.Otherwise if you your expectations are high but your budget is less then go for a China phone.Please indicate if you found this review useful or not. Thanks...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Ureka", 
            "review_header": "You must read this before you buy", 
            "review_posted_date": "23 February 2017", 
            "review_text": "I have got hands on experience with the phone and used it for a week's time.I am not at all going to bore you guys by writing paragraphs--------------------------------------------------------------------------------------------------------------------------------------------------------------------Pros:Good camera.3 Gb of ram (its not in pros but Samsung's 3gb ram phones are rarely found)Very nice display.Faster processing.Separate sim and SD card port.Supports Jio(I know this is very important point)Great looks.Good battery life-------------------------------------------------------------------------------------------------------------------------------------------------Cons:1.5Gb always runs on ram, god knows what forLow internal space on a long run(External SD card is must(necessity))Misses fingerprint sensor.No fast charger.---------------------------------------------------------------------------------------------------------------------------------------------------If we need a budget branded phone with almost semi-flagship phone this is the right choice. You can squeeze at least 2 years of itPlease hit like if you appreciate my quick review", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Tauseef Ahmad", 
            "review_header": "Very Good & decent product by Samsung at this price range (See Detailed Review)", 
            "review_posted_date": "18 March 2017", 
            "review_text": "Guys, I have got hands on experience with the phone and used it for a week's time.So, lets directly come to the review,--------------------------------------------------------------- Inside the Box :--> Samsung Galaxy On8 smartphone in Golden color> 2-pin charger (5V-1.55A)> Micro USB cable> Earphones with microphone> 3300mAh battery> User manual and warranty informationDisplay :--Rectifying its past mistake, Samsung has finally offered a Full HD Super AMOLED display for Galaxy On8 with 5.5-inch.Compared to its predecessor On7 with TFT display, the Galaxy On8 jumps comfortably to the next level with pretty impressive screen contributing a good color reproduction, sharpness, viewing angles and an above average sunlight readability. Being equipped with Super AMOLED display, the power consumption will be quite efficient.The display does attract fingerprints leaving smudges on screen sometimes, even though it shouldn’t be a big issue.Moreover, you can choose any one among the four screen modes — Adaptive display, AMOLED cinema, AMOLED photo, and Basic. To give a heads-up, the ‘Adaptive display’ optimizes the color range, saturation, and sharpness automatically according to your environment.Design :--While Samsung aces in design language on higher end smartphones, the mid-ranger rarely proves to be good. Talking about the form factor, the device measures 76×151.7×7.8mm thick and weigh around 169 grams, which is again a slight difference from its predecessor.Moving on to the design, the Galaxy On8 is a doppelganger of Galaxy J7 with very few changes. This 5.5-inch smartphone fits perfectly in hand and isn’t slippery either, offering a nice grip when holding. Moreover, the company has replaced the leather back cover with a polycarbonate material with a smooth matte finish which looks and feels good.The sides of Galaxy On8 has a shiny chrome rim running around with round corners seen in Galaxy J7 previously. On the front top, there is a 5MP front camera with a f/1.9 aperture along with LED flash for low-light selfies. It also has a proximity sensor, ambient sensor next to ear piece. Besides, it’s disappointing that the smartphone lacks notification light, which is present in almost all mid-range smartphones nowadays.On the whole, the build quality and design language is definitely an improvement over its predecessor. The Samsung Galaxy On8 comes Black, Gold and White colors.Apps and Storage :--Speaking of bloatware, the Samsung Galaxy On8 comes with pre-installed with Google, Microsoft office apps, and other native utility apps as well. Moreover, it doesn’t have any game and a dedicated music player as well. In this case, we opted Google Play for listening to music.All things considered, the audio output on speaker turns out to be poor, yet the sound through headphones are decent. Even there are chances of missing out call in a very noisy environment unless if you choose vibration. This device does come with FM radio with a very simple interface.On the ROM, out of 16GB, the user will get around 13.1GB storage. If you need more storage, you can also add microSD card up to 128GBConnectivity and Dual SIM :--The Samsung Galaxy On8 supports connectivity options including 4G LTE, Wi-Fi 802.11n, Bluetooth 4.1, GPS and NFC. Nowadays, dual SIM slots are mandatory in the mid-ranger and Galaxy On8 neatly ticks the box here. It also has VoLTE (voice-over-LTE) support for Reliance Jio.Both the SIM slots support 4G LTE and dual standby mode, which in turn allows us to take calls from second SIM even if you are on a call from first SIM. It also has USB on-the-go (OTG) support so that you can connect OTG drives easily. In addition, we also tested the call reception and was pretty satisfied with the experience we got.Performance and storage :--The Octa-Core Exynos 7580 processor clocked at 1.6GHz combined with 3GB RAM provides a butter smooth performance without any noticeable lag or hang. The Samsung Galaxy On8 is definitely fast enough for daily usage and multitasking applications. At this price range, the phone has enough power to offer sufficient performance in the everyday task.Battery :--The Samsung Galaxy On8 is powered by a 3300mAh battery without any quick charging technology. With average usage including calls, browsing Wi-Fi, video calls the smartphone is good for one full day.It also comes with Ultra power saver mode, which saves juices by applying a greyscale theme to your home screen and limiting the number of usable apps. Also, you can replace the battery very easily as it comes with the removable battery options.In our battery test the Galaxy On8 achieved a One Charge Rating of 13 hours and 44 minutes, better than the Galaxy On7 that scored a One Charge Rating of 12 hours and 42 minutes.Camera :--The Samsung Galaxy On8 comes with 13MP rear camera with f/1.9 aperture, and 5MP front camera with single LED flash on both sides.The user interface of the camera is the app is simple without any complications and similar to other Samsung smartphones.It comes with varieties of options including — mode (Auto, Pro, Panorama, Continuous shot HDR (Rich tone), Night, Beauty face, sports and sound shots), effects negative, sepia, grayscale), timer, picture size, and settings.This smartphone lets you launch the camera app by just pressing the home button twice and use the volume rockers as a camera shutter. To our surprise, the day light shots and macro shots are impressive with fine amount of details and sharpness. The 5MP front camera also proves to be good under perfect day light conditions.But when it comes to low light, the noises are almost present in all areas with loss of details. When turned on the flash under low light, the detailing of subject is decent without light over powering itConclusion :--On the whole, the Samsung Galaxy On8 is definitely an improvement over it predecessor On7 with few refinements that doesn’t go above and beyond. Even though it doesn’t have creative ingredients, it does fares in most of the part when it comes to the mid-range segment.The Galaxy On8 definitely benefits from the design, display, and front facing LED flash which is the most noticeable feature here. Lack of fingerprint sensor, notification LED, and other such options make us turn our head away from Galaxy On8. To sum it up, the Samsung Galaxy On8 is a pretty neat package at Rs. 15,990, until you take a look at other alternatives/rivals.Lets see its Pros & Cons,Pros :--> Good display> Front selfie flash> Dual SIM slots with 4G LTE support> Decent Battery backupCons :--> Lacks fingerprint sensor> Low loudspeaker output> No fast charging support========================================================You can buy this phone at discount from here :-- http://amzn.to/2nP1ltF========================================================Hope this review is helpful for you all,Please appreciate my review by hitting \"Helpful Vote\" button.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "ASWIN M", 
            "review_header": "SAMSUNG GALAXY on8 VS LENOVO VIBE K5 NOTE  ... THINK BEFORE YOU BUY ......", 
            "review_posted_date": "6 March 2017", 
            "review_text": "3. The RAM is of 3 GB which is more than enough for multitasking without any lags.4. Previous Samsung camera has never been disappointing and so as this one as well. For the primary it has a 13 megapixel sensor which takes very good quality images. It comes with an array of features like animated photo, anti-fog, continuous shot, HDR (high dynamic range), auto beauty face, panorama, sports and pro.5. Apart from the primary one the secondary camera is also very very good in low light conditions because of the larger f/1.9 focal aperture. It also has a LED flash on the front panel which can capture selfies even in absolute darkness.6. It comes with a dedicated memory card slot which can expand its memory up to 128 GB with a microSD card.7. The operating system is the latest version of Android Marshmallow and on top of that it comes with a smooth Samsung TouchWiz user interface.8. The body material is made out of metal which is very premium and also the overall thickness is of only 7.8 mm. So from the design standpoint its without a compromise.9. The 3300 mAh battery is large enough to last throughout the day even for an avid user. However gamers might need to recharge more than once during a day.10. Yes, it also supports USB OTG cable for connecting flash drives (pen drives).11. Does it supports Reliance Jio 4G? Yup, it works with Reliance Jio internet. Also it has VoLTE (voice over LTE networks).12. And the last pros is the dedicate navigational touch buttons which are placed below the screen.Reasons Not to Buy Samsung Galaxy On8 (Cons, Demerits or Negatives):1. The internal memory is of only 16 GB which is too less for a 16k priced smartphone. Moreover in actual only 10 GB out of the 16 GB is left for the user.2. Next Galaxy On8 cons or demerits is that there is no NFC (near field communication).3. Also the Gyroscope sensor is missing which is very important for playing AR (augmented reality) games like Pokemon Go and others.4. For a smartphone this expensive it should have come with a fingerprint sensor.5. There is no LED notification light as well which is a cons.6. It does not have a USB Type-C reversible connector.7. Next Samsung Galaxy On8 cons is that infrared sensor for IR blaster is also absent.8. There is no fast charging technology for the 3300 mAh battery.9. And the last Galaxy On8 cons is the absence of a display protection like Corning Gorilla Glass 3 or Asahi Dragontrail glass.My Verdict:  If you can compromise the cons then its still a great phone. But in case if you cannot compromise then go for better alternatives like Lenovo Vibe K5 Note", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Salman K.", 
            "review_header": "Why You Should Buy This product", 
            "review_posted_date": "5 April 2017", 
            "review_text": "I Bought This Phone 2 Days ago====================I have gone through all the reviews and I have picked out the cons of the phone which other users have been stating and would like to confirm if it's true or not.=========================Camera: Users are saying that there is no front led flash and you would get better specs in those China phones for a cheaper price. This is true but it has a selfie flash (the phone screen shines light on your face before clicking the photo) and I have tried phones with both flash and I realized that selfie flash is better. It is used on the iPhone 6 as well... when you use a led flash on some phones, The brightness is too much and it causes the picture to look unrealistic and extra bright. But the light on the selfie flash is convenient and moderate and it brings out crisp and clear photos that look realistic.In Low light the pictures are quite impressive.Battery: Users are saying the phone has poor battery life. This is also untrue, before the first use you have to switch the phone off and charge the phone till it reaches 100% before using it (It is even written in the user manual to charge it before first use) otherwise if you boot the phone directly for the first time after buying it and start using it right away.. the battery performance will be reduced.Battery life: when phone is fully charged, On minimal usage (only 4g browsing and calls) my battery lasts for at least 36 hours and with heavy usage it lasts for minimum 12 hours+Screenshot: I read a review saying it doesn't take screenshots! Oh my goodness such ignorance!! Hold the power button and home button for 3 seconds to take a screenshot. Simple as ABCNo Super Amoled: This is true which makes it difficult to use the screen outdoors under the sun however the display is still very good and clear. (Samsung always has good display) The phone has an outdoor mode which brightens the screen and you can use the phone perfectly.And one last thing, some of these people giving negative reviews may not even have the phone. They might just be writing based on what they've heard from others. Some know nothing about phones and are just writing crap.The phone is excellent. Branded phone is called branded phone for a reason. You buy them and use them for such a long time... just buy it and enjoy the satisfaction of owning a branded phone.Samsung has really done well by giving reasonable features at this price.Some of those China phones don't last long and have lots of problems later in the long run.Besides Samsung gives one year warranty with this phone.So I would advise you to go for this phone if you have 14k to spare.Otherwise if you your expectations are high but your budget is less then go for a China phone.Please indicate if you found this review useful or not. Thanks...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Decent no nonsense phone where pros outweigh the cons", 
            "review_posted_date": "31 March 2017", 
            "review_text": "Bought it from FlipkartFor all those who are cribbing about lack of features can you get FHD 5.5 amoled display at this price point .Even mi can't beat thisPros display ... The best there is periodDecent back cameraDecent performance for everyday usageSamsung service backupSamsung phones are generally no nonsense honest phones . At least the features they give you work!Os ...They best apart from stock android and cynogenBoth SIM and memory card workNo heating issuesConsYes speaker volume is disappointingly lowFront camera is rubbish ... Only good for fair and lovely commercialsNot for heavy gamesNow decide for yourself... Not for teenagers but for busy folks don't think too much buy it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Anubha", 
            "review_header": "Issue with volume", 
            "review_posted_date": "30 March 2017", 
            "review_text": "The phone is awesome. But there is certainly some problem with the speaker. Even on full volume the youtube videos are not audible at all. Is this the product's fault or all on8 phones have that problem?", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Parmar ranjitsinh bhikhabhai", 
            "review_header": "Five Stars", 
            "review_posted_date": "26 February 2017", 
            "review_text": "Superb phoneGood looking", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "vikramjit singh", 
            "review_header": "this is excellent product in this price range", 
            "review_posted_date": "6 March 2017", 
            "review_text": "this is excellent product in this price range. but memory should be 32gb. i saw system using more than 2gb of ram from 3gb. this is not good. camera is perfect.  Overall Good value for money.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Dev Nandy", 
            "review_header": "Superb phone under 15k", 
            "review_posted_date": "29 March 2017", 
            "review_text": "I bought 2 samsung on8 because under 15K this is feature rich phone .J5 prime is also there but it has Samoled display which is great.Display is a crucial thing in a phone because when you look at your phone and starts useing it it really display  that matters most.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "21 March 2017", 
            "review_text": "Nice product", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "31 March 2017", 
            "review_text": "Good performance", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "vikramjit singh", 
            "review_header": "this is excellent product in this price range", 
            "review_posted_date": "6 March 2017", 
            "review_text": "this is excellent product in this price range. but memory should be 32gb. i saw system using more than 2gb of ram from 3gb. this is not good. camera is perfect.  Overall Good value for money.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "nice phone.", 
            "review_posted_date": "4 April 2017", 
            "review_text": "nice phone......full of features at low budgetamazing designI would recommed to buy this product...worth for money...I like it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Mahendra Kakade", 
            "review_header": "Four Stars", 
            "review_posted_date": "3 April 2017", 
            "review_text": "Good product but at this price Samsung shouldhave provided finger print scanner and screen mirroring feature.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "1 April 2017", 
            "review_text": "Good device", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Dev Nandy", 
            "review_header": "Superb phone under 15k", 
            "review_posted_date": "29 March 2017", 
            "review_text": "I bought 2 samsung on8 because under 15K this is feature rich phone .J5 prime is also there but it has Samoled display which is great.Display is a crucial thing in a phone because when you look at your phone and starts useing it it really display  that matters most.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "utkarsh awasthi", 
            "review_header": "set is fine..", 
            "review_posted_date": "10 March 2017", 
            "review_text": "Overall...set is fine...i got it for 13900...working fine..no problem...delivery was little disrurbing...so change còurier like ecom or sumthing...But now as samsung j 7 prime is accesible for 14500...so go for that...with finger touch...", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Salman K.", 
            "review_header": "Why You Should Buy This product", 
            "review_posted_date": "5 April 2017", 
            "review_text": "I Bought This Phone 2 Days ago====================I have gone through all the reviews and I have picked out the cons of the phone which other users have been stating and would like to confirm if it's true or not.=========================Camera: Users are saying that there is no front led flash and you would get better specs in those China phones for a cheaper price. This is true but it has a selfie flash (the phone screen shines light on your face before clicking the photo) and I have tried phones with both flash and I realized that selfie flash is better. It is used on the iPhone 6 as well... when you use a led flash on some phones, The brightness is too much and it causes the picture to look unrealistic and extra bright. But the light on the selfie flash is convenient and moderate and it brings out crisp and clear photos that look realistic.In Low light the pictures are quite impressive.Battery: Users are saying the phone has poor battery life. This is also untrue, before the first use you have to switch the phone off and charge the phone till it reaches 100% before using it (It is even written in the user manual to charge it before first use) otherwise if you boot the phone directly for the first time after buying it and start using it right away.. the battery performance will be reduced.Battery life: when phone is fully charged, On minimal usage (only 4g browsing and calls) my battery lasts for at least 36 hours and with heavy usage it lasts for minimum 12 hours+Screenshot: I read a review saying it doesn't take screenshots! Oh my goodness such ignorance!! Hold the power button and home button for 3 seconds to take a screenshot. Simple as ABCNo Super Amoled: This is true which makes it difficult to use the screen outdoors under the sun however the display is still very good and clear. (Samsung always has good display) The phone has an outdoor mode which brightens the screen and you can use the phone perfectly.And one last thing, some of these people giving negative reviews may not even have the phone. They might just be writing based on what they've heard from others. Some know nothing about phones and are just writing crap.The phone is excellent. Branded phone is called branded phone for a reason. You buy them and use them for such a long time... just buy it and enjoy the satisfaction of owning a branded phone.Samsung has really done well by giving reasonable features at this price.Some of those China phones don't last long and have lots of problems later in the long run.Besides Samsung gives one year warranty with this phone.So I would advise you to go for this phone if you have 14k to spare.Otherwise if you your expectations are high but your budget is less then go for a China phone.Please indicate if you found this review useful or not. Thanks...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Vishal", 
            "review_header": "Lacks multitasking", 
            "review_posted_date": "1 April 2017", 
            "review_text": "Phone is Good no heating issue no hang camera quality both front and back is very good .but phone lacks big feature multitasking if on one s card data is enabled and call comes on other data stop's that is very disappointing", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "4 March 2017", 
            "review_text": "Wonderful product from a trustworthy brand", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Sandeep Sharma", 
            "review_header": "Now this Experience much better then last", 
            "review_posted_date": "2 April 2017", 
            "review_text": "Now this Experience much better then last, deliver got before committed datephone is awesome, but little bit Network Issue,catch Jio's Signal poor", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Baharul", 
            "review_header": "Very good product", 
            "review_posted_date": "5 March 2017", 
            "review_text": "It is the best mobile under 16k I have used...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Superb facilities of samsung on8", 
            "review_posted_date": "31 March 2017", 
            "review_text": "I lov this model", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Jyoti P.", 
            "review_header": "No comments...", 
            "review_posted_date": "2 March 2017", 
            "review_text": "I'm not getting this one..", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "31 March 2017", 
            "review_text": "Very good product at this price", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Superbbbb", 
            "review_posted_date": "31 March 2017", 
            "review_text": "Awsome", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "One Star", 
            "review_posted_date": "3 April 2017", 
            "review_text": "Pickup location does not exist", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "3 April 2017", 
            "review_text": "Refund date", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Mohit", 
            "review_header": "Read this carefully before going through the negative reviews", 
            "review_posted_date": "14 March 2017", 
            "review_text": "I Bought This Phone 2 Weeks ago====================I have gone through all the reviews and I have picked out the cons of the phone which other users have been stating and would like to confirm if it's true or not.=========================Camera: Users are saying that there is no front led flash and you would get better specs in those China phones for a cheaper price. This is true but it has a selfie flash (the phone screen shines light on your face before clicking the photo) and I have tried phones with both flash and I realized that selfie flash is better. It is used on the iPhone 6 as well... when you use a led flash on some phones, The brightness is too much and it causes the picture to look unrealistic and extra bright. But the light on the selfie flash is convenient and moderate and it brings out crisp and clear photos that look realistic.In Low light the pictures are quite impressive.Battery: Users are saying the phone has poor battery life. This is also untrue, before the first use you have to switch the phone off and charge the phone till it reaches 100% before using it (It is even written in the user manual to charge it before first use) otherwise if you boot the phone directly for the first time after buying it and start using it right away.. the battery performance will be reduced.Battery life: when phone is fully charged, On minimal usage (only 4g browsing and calls) my battery lasts for at least 36 hours and with heavy usage it lasts for minimum 12 hours+Screenshot: I read a review saying it doesn't take screenshots! Oh my goodness such ignorance!! Hold the power button and home button for 3 seconds to take a screenshot. Simple as ABCNo Super Amoled: This is true which makes it difficult to use the screen outdoors under the sun however the display is still very good and clear. (Samsung always has good display) The phone has an outdoor mode which brightens the screen and you can use the phone perfectly.And one last thing, some of these people giving negative reviews may not even have the phone. They might just be writing based on what they've heard from others. Some know nothing about phones and are just writing crap.The phone is excellent. Branded phone is called branded phone for a reason. You buy them and use them for such a long time... just buy it and enjoy the satisfaction of owning a branded phone.Samsung has really done well by giving reasonable features at this price.Some of those China phones don't last long and have lots of problems later in the long run.Besides Samsung gives one year warranty with this phone.So I would advise you to go for this phone if you have 14k to spare.Otherwise if you your expectations are high but your budget is less then go for a China phone.Please indicate if you found this review useful or not. Thanks...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "ajit upadhyay", 
            "review_header": "pretty good mobile samsung on8", 
            "review_posted_date": "24 February 2017", 
            "review_text": "Delayed in item delivery... pretty  good mobile samsung on8.. but heating issue when you use youtube or watching  videos...", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Phone quality ok for price.", 
            "review_posted_date": "9 March 2017", 
            "review_text": "Overall good perfomance speed wise. Camera quality is not very good and sound quality pn phone is not appreciable.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Sathish", 
            "review_header": "However 100% fine with rest of the features", 
            "review_posted_date": "7 March 2017", 
            "review_text": "The Internal memory is 16GB, whereas 7 GB occupied for inbuilt apps. However 100% fine with rest of the features.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Parmar ranjitsinh bhikhabhai", 
            "review_header": "Five Stars", 
            "review_posted_date": "26 February 2017", 
            "review_text": "Superb phoneGood looking", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Decent no nonsense phone where pros outweigh the cons", 
            "review_posted_date": "31 March 2017", 
            "review_text": "Bought it from FlipkartFor all those who are cribbing about lack of features can you get FHD 5.5 amoled display at this price point .Even mi can't beat thisPros display ... The best there is periodDecent back cameraDecent performance for everyday usageSamsung service backupSamsung phones are generally no nonsense honest phones . At least the features they give you work!Os ...They best apart from stock android and cynogenBoth SIM and memory card workNo heating issuesConsYes speaker volume is disappointingly lowFront camera is rubbish ... Only good for fair and lovely commercialsNot for heavy gamesNow decide for yourself... Not for teenagers but for busy folks don't think too much buy it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Which is good. 3", 
            "review_posted_date": "25 February 2017", 
            "review_text": "In this range, Smoled, front flash, 4g, 13mp\\5mp camera (main features) are given. Which is good. 3.5/5", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Tauseef Ahmad", 
            "review_header": "Very Good & decent product by Samsung at this price range (See Detailed Review)", 
            "review_posted_date": "18 March 2017", 
            "review_text": "Guys, I have got hands on experience with the phone and used it for a week's time.So, lets directly come to the review,--------------------------------------------------------------- Inside the Box :--> Samsung Galaxy On8 smartphone in Golden color> 2-pin charger (5V-1.55A)> Micro USB cable> Earphones with microphone> 3300mAh battery> User manual and warranty informationDisplay :--Rectifying its past mistake, Samsung has finally offered a Full HD Super AMOLED display for Galaxy On8 with 5.5-inch.Compared to its predecessor On7 with TFT display, the Galaxy On8 jumps comfortably to the next level with pretty impressive screen contributing a good color reproduction, sharpness, viewing angles and an above average sunlight readability. Being equipped with Super AMOLED display, the power consumption will be quite efficient.The display does attract fingerprints leaving smudges on screen sometimes, even though it shouldn’t be a big issue.Moreover, you can choose any one among the four screen modes — Adaptive display, AMOLED cinema, AMOLED photo, and Basic. To give a heads-up, the ‘Adaptive display’ optimizes the color range, saturation, and sharpness automatically according to your environment.Design :--While Samsung aces in design language on higher end smartphones, the mid-ranger rarely proves to be good. Talking about the form factor, the device measures 76×151.7×7.8mm thick and weigh around 169 grams, which is again a slight difference from its predecessor.Moving on to the design, the Galaxy On8 is a doppelganger of Galaxy J7 with very few changes. This 5.5-inch smartphone fits perfectly in hand and isn’t slippery either, offering a nice grip when holding. Moreover, the company has replaced the leather back cover with a polycarbonate material with a smooth matte finish which looks and feels good.The sides of Galaxy On8 has a shiny chrome rim running around with round corners seen in Galaxy J7 previously. On the front top, there is a 5MP front camera with a f/1.9 aperture along with LED flash for low-light selfies. It also has a proximity sensor, ambient sensor next to ear piece. Besides, it’s disappointing that the smartphone lacks notification light, which is present in almost all mid-range smartphones nowadays.On the whole, the build quality and design language is definitely an improvement over its predecessor. The Samsung Galaxy On8 comes Black, Gold and White colors.Apps and Storage :--Speaking of bloatware, the Samsung Galaxy On8 comes with pre-installed with Google, Microsoft office apps, and other native utility apps as well. Moreover, it doesn’t have any game and a dedicated music player as well. In this case, we opted Google Play for listening to music.All things considered, the audio output on speaker turns out to be poor, yet the sound through headphones are decent. Even there are chances of missing out call in a very noisy environment unless if you choose vibration. This device does come with FM radio with a very simple interface.On the ROM, out of 16GB, the user will get around 13.1GB storage. If you need more storage, you can also add microSD card up to 128GBConnectivity and Dual SIM :--The Samsung Galaxy On8 supports connectivity options including 4G LTE, Wi-Fi 802.11n, Bluetooth 4.1, GPS and NFC. Nowadays, dual SIM slots are mandatory in the mid-ranger and Galaxy On8 neatly ticks the box here. It also has VoLTE (voice-over-LTE) support for Reliance Jio.Both the SIM slots support 4G LTE and dual standby mode, which in turn allows us to take calls from second SIM even if you are on a call from first SIM. It also has USB on-the-go (OTG) support so that you can connect OTG drives easily. In addition, we also tested the call reception and was pretty satisfied with the experience we got.Performance and storage :--The Octa-Core Exynos 7580 processor clocked at 1.6GHz combined with 3GB RAM provides a butter smooth performance without any noticeable lag or hang. The Samsung Galaxy On8 is definitely fast enough for daily usage and multitasking applications. At this price range, the phone has enough power to offer sufficient performance in the everyday task.Battery :--The Samsung Galaxy On8 is powered by a 3300mAh battery without any quick charging technology. With average usage including calls, browsing Wi-Fi, video calls the smartphone is good for one full day.It also comes with Ultra power saver mode, which saves juices by applying a greyscale theme to your home screen and limiting the number of usable apps. Also, you can replace the battery very easily as it comes with the removable battery options.In our battery test the Galaxy On8 achieved a One Charge Rating of 13 hours and 44 minutes, better than the Galaxy On7 that scored a One Charge Rating of 12 hours and 42 minutes.Camera :--The Samsung Galaxy On8 comes with 13MP rear camera with f/1.9 aperture, and 5MP front camera with single LED flash on both sides.The user interface of the camera is the app is simple without any complications and similar to other Samsung smartphones.It comes with varieties of options including — mode (Auto, Pro, Panorama, Continuous shot HDR (Rich tone), Night, Beauty face, sports and sound shots), effects negative, sepia, grayscale), timer, picture size, and settings.This smartphone lets you launch the camera app by just pressing the home button twice and use the volume rockers as a camera shutter. To our surprise, the day light shots and macro shots are impressive with fine amount of details and sharpness. The 5MP front camera also proves to be good under perfect day light conditions.But when it comes to low light, the noises are almost present in all areas with loss of details. When turned on the flash under low light, the detailing of subject is decent without light over powering itConclusion :--On the whole, the Samsung Galaxy On8 is definitely an improvement over it predecessor On7 with few refinements that doesn’t go above and beyond. Even though it doesn’t have creative ingredients, it does fares in most of the part when it comes to the mid-range segment.The Galaxy On8 definitely benefits from the design, display, and front facing LED flash which is the most noticeable feature here. Lack of fingerprint sensor, notification LED, and other such options make us turn our head away from Galaxy On8. To sum it up, the Samsung Galaxy On8 is a pretty neat package at Rs. 15,990, until you take a look at other alternatives/rivals.Lets see its Pros & Cons,Pros :--> Good display> Front selfie flash> Dual SIM slots with 4G LTE support> Decent Battery backupCons :--> Lacks fingerprint sensor> Low loudspeaker output> No fast charging support========================================================You can buy this phone at discount from here :-- http://amzn.to/2nP1ltF========================================================Hope this review is helpful for you all,Please appreciate my review by hitting \"Helpful Vote\" button.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Ureka", 
            "review_header": "You must read this before you buy", 
            "review_posted_date": "23 February 2017", 
            "review_text": "I have got hands on experience with the phone and used it for a week's time.I am not at all going to bore you guys by writing paragraphs--------------------------------------------------------------------------------------------------------------------------------------------------------------------Pros:Good camera.3 Gb of ram (its not in pros but Samsung's 3gb ram phones are rarely found)Very nice display.Faster processing.Separate sim and SD card port.Supports Jio(I know this is very important point)Great looks.Good battery life-------------------------------------------------------------------------------------------------------------------------------------------------Cons:1.5Gb always runs on ram, god knows what forLow internal space on a long run(External SD card is must(necessity))Misses fingerprint sensor.No fast charger.---------------------------------------------------------------------------------------------------------------------------------------------------If we need a budget branded phone with almost semi-flagship phone this is the right choice. You can squeeze at least 2 years of itPlease hit like if you appreciate my quick review", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Ganesh G.", 
            "review_header": "Five Stars", 
            "review_posted_date": "15 March 2017", 
            "review_text": "beautiful phone", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "22 March 2017", 
            "review_text": "good", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "surumahe", 
            "review_header": "Return policy is pathetic", 
            "review_posted_date": "28 March 2017", 
            "review_text": "Pathetic performance. Needs a reset having bought 10 days back", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "ASHISH GAUTAM", 
            "review_header": "Best Phone under 15k", 
            "review_posted_date": "8 March 2017", 
            "review_text": "Best Phone under 15k. It covers all points which anyone wants from a budget + branded phone:1. Awesome back camera ( performs quite good even in low light ). I have A9 pro as well i can say that it almost compares with it neck on neck, except A9pro is bit more wide angled. On8's shutter speed is faster that A9 pro.2. Nice front camera with adequate flash ( good for low light selfies )3. 3 GB RAM + descent processor; Best RAM management . most of the times 1.5 GB is free even after opening most of the regular apps.4. Bright AMOLED screen ( easy readable under sunlight )5. Very fast GPS navigation6. Nice good looking phone7. Battery backup: last for more than a day with moderate usage8. Low speaker volume but ok for video calls9. No hybrid slot, a proper dual sim phone with dedicated memory card slot", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Samsung Galaxy on 8.Not good not bad.", 
            "review_posted_date": "1 April 2017", 
            "review_text": "This mobile camera quality is very bad &also one slim slot is 4G and another one is 2G only(Main drawback).In this mobile price other brand like Moto,lenovo camera quality & other options is good.Don't buy this mobile.", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "ASWIN M", 
            "review_header": "SAMSUNG GALAXY on8 VS LENOVO VIBE K5 NOTE  ... THINK BEFORE YOU BUY ......", 
            "review_posted_date": "6 March 2017", 
            "review_text": "3. The RAM is of 3 GB which is more than enough for multitasking without any lags.4. Previous Samsung camera has never been disappointing and so as this one as well. For the primary it has a 13 megapixel sensor which takes very good quality images. It comes with an array of features like animated photo, anti-fog, continuous shot, HDR (high dynamic range), auto beauty face, panorama, sports and pro.5. Apart from the primary one the secondary camera is also very very good in low light conditions because of the larger f/1.9 focal aperture. It also has a LED flash on the front panel which can capture selfies even in absolute darkness.6. It comes with a dedicated memory card slot which can expand its memory up to 128 GB with a microSD card.7. The operating system is the latest version of Android Marshmallow and on top of that it comes with a smooth Samsung TouchWiz user interface.8. The body material is made out of metal which is very premium and also the overall thickness is of only 7.8 mm. So from the design standpoint its without a compromise.9. The 3300 mAh battery is large enough to last throughout the day even for an avid user. However gamers might need to recharge more than once during a day.10. Yes, it also supports USB OTG cable for connecting flash drives (pen drives).11. Does it supports Reliance Jio 4G? Yup, it works with Reliance Jio internet. Also it has VoLTE (voice over LTE networks).12. And the last pros is the dedicate navigational touch buttons which are placed below the screen.Reasons Not to Buy Samsung Galaxy On8 (Cons, Demerits or Negatives):1. The internal memory is of only 16 GB which is too less for a 16k priced smartphone. Moreover in actual only 10 GB out of the 16 GB is left for the user.2. Next Galaxy On8 cons or demerits is that there is no NFC (near field communication).3. Also the Gyroscope sensor is missing which is very important for playing AR (augmented reality) games like Pokemon Go and others.4. For a smartphone this expensive it should have come with a fingerprint sensor.5. There is no LED notification light as well which is a cons.6. It does not have a USB Type-C reversible connector.7. Next Samsung Galaxy On8 cons is that infrared sensor for IR blaster is also absent.8. There is no fast charging technology for the 3300 mAh battery.9. And the last Galaxy On8 cons is the absence of a display protection like Corning Gorilla Glass 3 or Asahi Dragontrail glass.My Verdict:  If you can compromise the cons then its still a great phone. But in case if you cannot compromise then go for better alternatives like Lenovo Vibe K5 Note", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Tapas", 
            "review_header": "You cannot cancel order after doing online payment.", 
            "review_posted_date": "30 March 2017", 
            "review_text": "Once you order something with pre payment, you cannot cancel it online(Obviously because you have done payment already). I guess same thing doesn't apply with COD. Next time thinking to do only COD.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "27 March 2017", 
            "review_text": "Good", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Shreyoshi Ghosh", 
            "review_header": "Not Value for Money & Oversized Inbuilt Features by Samsung", 
            "review_posted_date": "20 March 2017", 
            "review_text": "The phone's inbuilt system takes away more than 2GB RAM. Will get about 900MB free RAM.Despite being Octa core phone is not much fast.Samsung App sizes are huge.Rose Gold colour is actually a faded bronze colour. Looks bad unlike Apple Rose Gold.Speaker is at the back hence Audio is poor.", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "One Star", 
            "review_posted_date": "1 April 2017", 
            "review_text": "I HATE", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Do not buy this phone it keeps on hanging and ...", 
            "review_posted_date": "27 March 2017", 
            "review_text": "Do not buy this phone it keeps on hanging and is very slow..and when contacted amazon for returning it back there is no proper response.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Negative", 
            "review_posted_date": "21 March 2017", 
            "review_text": "working not good", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Suprateek Sarkar", 
            "review_header": "Old wine in a new bottle..On8 = J7-2016 plus 1gb ram", 
            "review_posted_date": "5 March 2017", 
            "review_text": "This phone is exactly the same J7-2016 with a small RAM upgrade. It seems Samsung couldn't sell all J7-2016, so they came up with this device. Its just few days I bought the phone so lets hope this works well without any glitches.For the amazon delivery, it was amazingly slow. Took more than a week to deliver this one and on top of that showing duplicate tracking updates just to show some activity in the back-end which seemed fake!So the initial experience is not so good!", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Akhilesh kumar", 
            "review_header": "poor packing and tempring with screen", 
            "review_posted_date": "26 February 2017", 
            "review_text": "Phone is OK but phone ki screen per ki protective screen nikli thi,when I have open Mobil box,and mobile packing is very poor", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "phone is awesome but I don't get invoice copy plz help", 
            "review_posted_date": "29 March 2017", 
            "review_text": "phone is awesome  but I don't get invoice  copy plz help me", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "DD", 
            "review_header": "Very first day not working., Now Working well", 
            "review_posted_date": "1 March 2017", 
            "review_text": "Not working ,going auto off,. Software problem,shown authorised service centre in Nasik. They are returned, asked to return & replace with Amazon. I want replace or repair.Purchsed on 25th February 2017. And iogiven to service centre on 27.within two days.What can I do.......Replaced by Amazon, working nice. Thanks of Amazon giving quick response to my problem.Very nice mobile", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Camera setting..", 
            "review_posted_date": "8 March 2017", 
            "review_text": "I am not found camera setting when I'm open camera to take a pics both site back and front...why???And app can't delete when I'm press app and drag...cant work..", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Just yesterday I had received samsung on 8 mobile some ...", 
            "review_posted_date": "24 February 2017", 
            "review_text": "Just yesterday  I had received samsung on 8 mobile  some problem in speaker in coming call voice is not clear .I had given complain to Amazon waiting for response from Amazon  Will share Amazon respose.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Praveen", 
            "review_header": "Volume is low. Display is not as impressive as ...", 
            "review_posted_date": "26 March 2017", 
            "review_text": "Volume is low. Display is not as impressive as S4 mini (my previous phone) - Touch screen is also not that responsive...", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Rohit", 
            "review_header": "Not original samsung phone. Do not Buy", 
            "review_posted_date": "14 March 2017", 
            "review_text": "This is not an original Samsung phone. Pelase do not buy this. I dont see any option for return on this item as well.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Ranjith", 
            "review_header": "Five Stars", 
            "review_posted_date": "21 February 2017", 
            "review_text": "I need to Know the capacity internal memory", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "abhishek", 
            "review_header": "Heating issue with samsung galaxy on8", 
            "review_posted_date": "23 March 2017", 
            "review_text": "It looks good and screen is very nice but heating problm is big issue with this phone.", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "LoverboySkay", 
            "review_header": "The first noticeable is the display which is a full HD Super AMOLED screen for the 5", 
            "review_posted_date": "23 February 2017", 
            "review_text": "Reasons to Buy Samsung Galaxy On8 (Pros, Merit or Positives):1. The first noticeable is the display which is a full HD Super AMOLED screen for the 5.5 inches. Comparatively the Super AMOLED is far better than an IPS LCD with better viewing angles and lower power consumption.2. Next pros is the processor which is a 1.6 GHz Octa-core Exynos 7580 chipset. In fact this is the cheapest Samsung devices to come with an Octa-core CPU and its real fast. Compared to Snapdragon Exynos have less heating issues.3. The RAM is of 3 GB which is more than enough for multitasking without any lags.4. Previous Samsung camera has never been disappointing and so as this one as well. For the primary it has a 13 megapixel sensor which takes very good quality images. It comes with an array of features like animated photo, anti-fog, continuous shot, HDR (high dynamic range), auto beauty face, panorama, sports and pro.5. Apart from the primary one the secondary camera is also very very good in low light conditions because of the larger f/1.9 focal aperture. It also has a LED flash on the front panel which can capture selfies even in absolute darkness.6. It comes with a dedicated memory card slot which can expand its memory up to 128 GB with a microSD card.7. The operating system is the latest version of Android Marshmallow and on top of that it comes with a smooth Samsung TouchWiz user interface.8. The body material is made out of metal which is very premium and also the overall thickness is of only 7.8 mm. So from the design standpoint its without a compromise.9. The 3300 mAh battery is large enough to last throughout the day even for an avid user. However gamers might need to recharge more than once during a day.10. Yes, it also supports USB OTG cable for connecting flash drives (pen drives).11. Does it supports Reliance Jio 4G? Yup, it works with Reliance Jio internet. Also it has VoLTE (voice over LTE networks).12. And the last pros is the dedicate navigational touch buttons which are placed below the screen.Reasons Not to Buy Samsung Galaxy On8 (Cons, Demerits or Negatives):1. The internal memory is of only 16 GB which is too less for a 16k priced smartphone. Moreover in actual only 10 GB out of the 16 GB is left for the user.2. Next Galaxy On8 cons or demerits is that there is no NFC (near field communication).3. Also the Gyroscope sensor is missing which is very important for playing AR (augmented reality) games like Pokemon Go and others.4. For a smartphone this expensive it should have come with a fingerprint sensor.5. There is no LED notification light as well which is a cons.6. It does not have a USB Type-C reversible connector.7. Next Samsung Galaxy On8 cons is that infrared sensor for IR blaster is also absent.8. There is no fast charging technology for the 3300 mAh battery.9. And the last Galaxy On8 cons is the absence of a display protection like Corning Gorilla Glass 3 or Asahi Dragontrail glass.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Shailesh B.", 
            "review_header": "Five Stars", 
            "review_posted_date": "2 March 2017", 
            "review_text": "Jordar mobile", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "harpreet kaur", 
            "review_header": "Good", 
            "review_posted_date": "21 February 2017", 
            "review_text": "Using it frm past 4 months........no complaints....nice handset....worth money", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "One Star", 
            "review_posted_date": "26 March 2017", 
            "review_text": "Ghatia side", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Ghanshyam Jhanwar", 
            "review_header": "Must Read Before You Buy !!", 
            "review_posted_date": "25 February 2017", 
            "review_text": "I used the phone for around 3 months ! Now you would be thinking how 3 months ? So let me tell you that the phone was earlier launched on flipkart and i bought it from there. So lets start !!--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------WHAT ARE THE SPECIFIACTIONS ?Processor - Exynos 7580 octa core processorRam - 3GB RAMCamera - 13MP primary camera and 5MP front facing cameraDisplay - 5.5 Inch 1080p DisplayBattery - 3300mAHInternal Storage - 16GB--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------WHAT ARE THE PROS AND CONS ?PROS -Good camera.3 GB ram (its not in pros but Samsung's 3GB ram phones are rarely found)Nice Display.Faster Processing.Separate sim and SD card ports.CONS -1.5 GB ram usable only.Could be j7 because shows the device name j7 at some places.Low internal space.No fingerprint sensor---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------OVERALL EXPERIENCE -I personally liked the phone because samsung usually dont provide such good specs and quality at such a price .You should go for this device if your budget is around 15000 rs !", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "For this price Don go for On8", 
            "review_posted_date": "23 March 2017", 
            "review_text": "Speaker is  placed at the back near camera. Calls and alarms cannot be heard at all unless u see the phone. I just installed one game and the performance seems to be in slow motion. Delivery from Amazon took almost more than a week. No fingerprint scanner.", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Same mobile is available on flipkart but there is only ...", 
            "review_posted_date": "22 February 2017", 
            "review_text": "Same mobile is available on flipkart but there is only difference of \"item model number\". I don't understand what is the matter?", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Great phone now on Amazon", 
            "review_posted_date": "21 February 2017", 
            "review_text": "Good specs from Samsung", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "23 February 2017", 
            "review_text": "Very nice phone...awesome quality processing speed is fast ...and camera quality is ultimate...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "sourabh shinge", 
            "review_header": "Good Phone You need to read This ?????", 
            "review_posted_date": "21 February 2017", 
            "review_text": "After using it for 4 months I am writing this  review. This phone can be good for you as it has pros it has cons also I think that this will help you a lot.So let's start,Inside the boxHandsetChargerHeadphonesWarranty cardNow take lookabout  pro & Cons~ Good  Camera it has 13 MP rear and 5 MP front camera which is capable of taking nice photos which autofocus and stabilizer Camera is awesome it can take nice photos in low light also.~ It has 3 GB of RAM , this ram is OK but you can get 4 GB of RAM in this same price like InFocus epic 1you can get  around 2.2 GB free of 3 GB for use.Memory management is good so no any lag. I have tried several games but still it is no lag or no any issue.~ It has internal memory of 16 GB which is not good as we  save lot oh photo ,video hence memory required generally in this price you can get 32 & 64 GB memory. In Nubia n1 you can get 64 GB .~ It has  3300 mAh battery which good I is one of feature of this phone.~It has Android 6.0  marshmallow which is good when will get update of Nougat is not known but it is OK.~ It has Full HD 5.5 inch screen which is good  you can watch high quality of videos on this phone Of full quality.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "27 March 2017", 
            "review_text": "Good", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Akhilesh kumar", 
            "review_header": "poor packing and tempring with screen", 
            "review_posted_date": "26 February 2017", 
            "review_text": "Phone is OK but phone ki screen per ki protective screen nikli thi,when I have open Mobil box,and mobile packing is very poor", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "sk a.", 
            "review_header": "it costs less in flipkart", 
            "review_posted_date": "23 March 2017", 
            "review_text": "It too much cost.... It less in flipkart then amazon....", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Tapas", 
            "review_header": "You cannot cancel order after doing online payment.", 
            "review_posted_date": "30 March 2017", 
            "review_text": "Once you order something with pre payment, you cannot cancel it online(Obviously because you have done payment already). I guess same thing doesn't apply with COD. Next time thinking to do only COD.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Three Stars", 
            "review_posted_date": "31 March 2017", 
            "review_text": "Which phone is better on8  or on7pro", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "vinod", 
            "review_header": "Three Stars", 
            "review_posted_date": "29 March 2017", 
            "review_text": "Please tell anybody is there front flash?", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Rakesh.co", 
            "review_header": "3gb ram and 3gb rom how its manange the storage like a old kitkat phone", 
            "review_posted_date": "21 February 2017", 
            "review_text": "i see this product discription in amazon.com and i found that this products ram and rom is same what a rubish ? 3gb ram and 3gb rom  how its manange the storage like a old kitkat phone,", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Camera setting..", 
            "review_posted_date": "8 March 2017", 
            "review_text": "I am not found camera setting when I'm open camera to take a pics both site back and front...why???And app can't delete when I'm press app and drag...cant work..", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Cheapest Ever", 
            "review_posted_date": "3 March 2017", 
            "review_text": "1.camera is very very poor blur pics capture2.NO 4 g sim slot in second sim3.NO LED indicater4.NO finger print5.NO plug n play sim slot6.NO gorrila glass7.Lower valume8.Camera dont have 13 and 5 its just said by the company....samsung stop fooling to customer.....", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Praveen", 
            "review_header": "Volume is low. Display is not as impressive as ...", 
            "review_posted_date": "26 March 2017", 
            "review_text": "Volume is low. Display is not as impressive as S4 mini (my previous phone) - Touch screen is also not that responsive...", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Three Stars", 
            "review_posted_date": "31 March 2017", 
            "review_text": "Which phone is better on8  or on7pro", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "sk a.", 
            "review_header": "it costs less in flipkart", 
            "review_posted_date": "23 March 2017", 
            "review_text": "It too much cost.... It less in flipkart then amazon....", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "vinod", 
            "review_header": "Three Stars", 
            "review_posted_date": "29 March 2017", 
            "review_text": "Please tell anybody is there front flash?", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Rakesh.co", 
            "review_header": "3gb ram and 3gb rom how its manange the storage like a old kitkat phone", 
            "review_posted_date": "21 February 2017", 
            "review_text": "i see this product discription in amazon.com and i found that this products ram and rom is same what a rubish ? 3gb ram and 3gb rom  how its manange the storage like a old kitkat phone,", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Cheapest Ever", 
            "review_posted_date": "3 March 2017", 
            "review_text": "1.camera is very very poor blur pics capture2.NO 4 g sim slot in second sim3.NO LED indicater4.NO finger print5.NO plug n play sim slot6.NO gorrila glass7.Lower valume8.Camera dont have 13 and 5 its just said by the company....samsung stop fooling to customer.....", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "is redmi 2 prime phone", 
            "review_header": "I want to know the speaker volume", 
            "review_posted_date": "22 February 2017", 
            "review_text": "Dear I want to purchase a new phone....I heared from flipcart review that on8 mobile's had low volume. So we do not hear that in market area....is it right or wrong...?Please provide true information about it....", 
            "review_rating": "1.0 "
        }
    ], 
    "name": "Samsung Galaxy On8 (Gold)"
}