{
    "total_ratings": "1,290", 
    "ratings": {
        "2 star": "53", 
        "1 star": "196", 
        "4 star": "302", 
        "3 star": "112", 
        "5 star": "627"
    }, 
    "price": "₹ 10990.00", 
    "reviews": [
        {
            "review_author": "Diya", 
            "review_header": "j7", 
            "review_posted_date": "26 December 2015", 
            "review_text": "Excellent mobile", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "ishan", 
            "review_header": "Five Stars", 
            "review_posted_date": "24 March 2017", 
            "review_text": "Brilliant for the price, just perfect", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Good", 
            "review_posted_date": "23 March 2017", 
            "review_text": "Nice product", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Two Stars", 
            "review_posted_date": "8 March 2017", 
            "review_text": "Good phone", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Stephen D'souza", 
            "review_header": "Five Stars", 
            "review_posted_date": "15 March 2017", 
            "review_text": "Good Product, slim and sleek design, best mobile for average users.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Faulty mobile", 
            "review_posted_date": "2 April 2017", 
            "review_text": "It was a faulty mobile which i got. Touch buttons like back buttons and recent window buttons were not functioning at all.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "One Star", 
            "review_posted_date": "30 March 2017", 
            "review_text": "Poor", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Nice phone", 
            "review_posted_date": "4 April 2017", 
            "review_text": "Though i am not a fan of Galaxy phones i got to admit that this one is pretty good..Decent display and Camera qualityQuite a good battery life..Light weight but well built", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Two Stars", 
            "review_posted_date": "2 March 2017", 
            "review_text": "The product is not good... even it's not touching the expected line it's front camera is pathetic", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Karthick", 
            "review_header": "Best", 
            "review_posted_date": "10 March 2017", 
            "review_text": "It's Really Good", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Very sad experience. Can't expect from amazon and blue dart", 
            "review_posted_date": "7 October 2016", 
            "review_text": "Very sad experience. Can't expect from amazon and blue dart. Product was given to the watchman by blue dart person where as me was there at home and spoke with that person one minute before. Product is good but after little use become very hot.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "ANKIT KUMAR", 
            "review_header": "excellent display", 
            "review_posted_date": "28 November 2016", 
            "review_text": "The phone has an excellent display with very good touch response.the rear 13 mp serves well in well lit conditions also the front flash provides an extra edge.apps and games run very smoothly on snapdragon 430.the build quality is not upto to the mark.though a good phone to buy.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Identity", 
            "review_header": "Review-read it carefully", 
            "review_posted_date": "26 October 2015", 
            "review_text": "I did not expect this phone from samsung with such a wornderful price tag and features.. I was able to get it for 12600 INR. The only drawback i found is its low speaker volume,, but that did not bother me because there is a workaround to increase its volume.. Samsung really working hard to make its touchwiz snappier and this time,, they managed it to be more snappier than pure android. Gaming performance is awesome.. Display is awesome.. I did not liked the earphones.. So i ordered another earphone to use with this.. RAM is less but performance is far better than higher RAM models.. I compared it with moto x play and overall j7 is clear winner.Android 5.1 out of the box. Battery life is awesome compared to rebranded phones in market and no heating issues which is the most common problem in xiomi, yureka, lenovo.. Belive me guys i bought this phone after a lot of reasearch and i bought this phone to give me peace of mind.. I did not wanted my phone to get heat up  everytime i use it for 5 minutes. .Thank you samsung for this great phone and amazon for great offer.Pardon typos...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "KUNJAR  MURLIDHAR BHATT", 
            "review_header": "It is marvellous", 
            "review_posted_date": "12 March 2016", 
            "review_text": "This much I can say, considering all parameters it is really an user friendly mobile. It is very good among 4G compatible mobiles.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Arun", 
            "review_header": "very good with this price", 
            "review_posted_date": "9 May 2016", 
            "review_text": "very good with this price.. camera quality is unbelievable.. phone is soo fast nd the new feature theme will make ur ph look good.. i m posting one of the pic taken from my j7", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "manju dazGrt", 
            "review_header": "very good product, I love my phone very much", 
            "review_posted_date": "25 March 2017", 
            "review_text": "very good product,I love my phone very much.amazon is only my favorite on online shopping.guarantee customer service. I bought many products.samsung galaxy J7 .  money worth.features are good.picture clarity and 4G more advanced in cheap rate.I bought 14999/-.but now I think 10000/-.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Mahendran", 
            "review_header": "AMAZING Phone..BEST phone....LOVED it", 
            "review_posted_date": "22 February 2016", 
            "review_text": "I bought this phone yesterday.....AMAZING and WONDERFUL experience with this phone...1) Display Clarity super2)Long Lasting Battery Charge3)Camera Very NICE4)Attractive Look5)Internet SPEED amazing6)Best touch experience with AMOLED screen7)Wonderful phone for GAME......I  played Asphault 8 airborne ...It never hangs...I really wondered with this phoneI am sure .....u will not be disappointed with this phone..Overall this phone is VERY BEST phone to buy this range.........don't see some idiots bad review....I have used Micromax, lenovo,htc,moto.......But J7 only ROCKZZZZZZZ......Just go for it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Worst product", 
            "review_posted_date": "19 September 2016", 
            "review_text": "worst product i received.Phone is getting heated while charging. phone battery is draining without using it.  i applied for return on 12th September but still i didn't get any call from them. do my phone get replaced ???. amazon guys. please contact me", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Nihal Sheikh", 
            "review_header": "Wowww!!", 
            "review_posted_date": "24 August 2016", 
            "review_text": "This is an Ammazing phone..at this price range", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "N Paulpandian", 
            "review_header": "Review of items recently purchased from amazon", 
            "review_posted_date": "27 June 2016", 
            "review_text": "All the above items were received good condition and meet my expectations and purpose.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "shravan", 
            "review_header": "Kuch din huye maine samsung j7 kharida. mein to ...", 
            "review_posted_date": "26 January 2016", 
            "review_text": "Kuch din huye maine samsung j7 kharida .mein to bahut khush hu...battery bkup accha hai .no hagging problem ...camera accha he dono...kahe to vesha vasul hai...so tnxxx samsung", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "gautam", 
            "review_header": "Speaker volume is pathetic.", 
            "review_posted_date": "13 September 2016", 
            "review_text": "Phone is OK. Speaker volume is pathetic.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Krati", 
            "review_header": "Had a really very bad experience with this cell phone", 
            "review_posted_date": "14 March 2017", 
            "review_text": "Had a really very bad experience with this cell phone.. If you wanna buy, will request rather not to go for this cell.. Within the very first month of warranty period, the display was broken, and it took 6500 to get it repaired, which worked for approx one year, and now again same problem.. so a total of 21k is been already spent...Better go for other Brand..This is not good. #FeelingAnnoyedThanks.", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Atul Upadhyay", 
            "review_header": "Best smartphone......!!!!", 
            "review_posted_date": "15 April 2016", 
            "review_text": "Awesome cell... Don't think to much .. Just go for it... I choosed one day delivery n got next day early morning. Working smoothlyyyyyy...fastt n furious... Internet speed is too fasttttt if u compare wid other frnd's cellphone at the same time connected in same network.. Camera front and back both are OK n good. 1.5gb ram ...less but Seems like it has above 2gb ram. Happy aftr purchasing this product.. !!!!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Karan Singha", 
            "review_header": "Should I buy it???", 
            "review_posted_date": "3 April 2017", 
            "review_text": "HELLO GUYS WELCOME. IN THIS REVIEW I AM GOING TO TELL YOU WHETHER WE SHOULD BUY THIS PHONE OR NOT. SO LETS START.  THIS REVIEW INCLUDES ABOUT THE SPECS, PROS AND CONS AND OF COURSE MY PERSONAL OPINIONS.SPECIFICATIONS AND PROS OF THE PHONE-CAMERA-  13 MP primary camera with auto focus, LED flash, geotagging, touch focusface detection, panorama AND 5 MP front facing camera. Camera is very good.DISPLAY- 5.5-inch (13.97 centimeters) Super AMOLED capacitive touchscreen720 x 1280 pixels resolution, 267 ppi pixel density16M color supportOPERATING SYSTEM-Android v5.1 Lollipop operating system1.5GHz octa core processorMali T720MP2 GPURAM- 1.5GB RAM, 16GB internalmemory expandable up to 128GB and dual micro SIM (GSM+GSM)BATTERY-3000mAH lithium-ion batteryWARRANTY-1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase  ##############################CONS################################1) BATTERY COULD BE BETTER.2)ONLY Accelerometer, Proximity sensor are present and you may not be able to experience Virtual Reality.3) Processor could be better. You may experience lags and jams while gaming. AlSO RAM IS VERY LESS.  IN THIS PRICE RANGE YOU MAY BUY REDMI NOTE 4 (2GB RAM VARIANT RS. 9999) WHICH IS MUCH BETTER.YOU CAN SPEND SOME MORE AND BUY PHONES LIKE REDMI NOTE 4(3GB RAM OR 4GB RAM).LENEVO VIBE K5 ETC.ACCORDING TO ME PLEASE DONT WASTE YOUR VALUABLE MONEY FOR SUCH PHONE.  Friends if this review was useful then please vote for me . THANK YOU AND HAVE A NICE AND SAFE DAY.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Ravi", 
            "review_header": "SAMSUNG J7 IS trusted device of2015", 
            "review_posted_date": "1 March 2016", 
            "review_text": "Samsung j7Display clarity bestCamera always ahead SamsungFront flash good when traveling at night time16gb good for install applicationsHardware is best octa core no heating issueSoftware decent compared to Samsung old device no hanging issue", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Everything in this product is just amazing..", 
            "review_posted_date": "12 April 2016", 
            "review_text": "Everything in this product is just amazing...picture clarity, sound, etc...but the colour is slightly like affecting ur eyes if u watch for more than 1/2 an hour...else the product is very useful...u must buy it", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Superb phone  galaxy j700", 
            "review_posted_date": "23 October 2015", 
            "review_text": "I'm the j7 user for the past 4 months. .  I find very useful ..display clarity is awesome .  . Good battery backup. . Camera with dual flash.  I give 5 ⭐ its supports  otg .", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Amazing Phone! Amazing camera and photo quality", 
            "review_posted_date": "20 November 2015", 
            "review_text": "Amazing Phone! Amazing camera and photo quality. Sound is lower compared. It gives good with a headset. The back cover is too thin and delicate, thin plastic. The battery backup is quite good. The display is amazing. Sleek and slim. Gold gives an elite and classy feel. Doesnot hang too much. Features like ultra internet saver and ultra battery saver are very good. Overall, its more than worth for the cost!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "equbaljawaid", 
            "review_header": "Good", 
            "review_posted_date": "19 October 2016", 
            "review_text": "Good looking mobile", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "27 March 2017", 
            "review_text": "Best...... I am full happyTq amazon", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "V nice", 
            "review_posted_date": "2 March 2017", 
            "review_text": "Nice pis but rate is high", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "superb", 
            "review_posted_date": "27 January 2017", 
            "review_text": "Nice !", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Apoorv Vibhandya", 
            "review_header": "Its Not That Great But Okay For Light Users", 
            "review_posted_date": "27 March 2017", 
            "review_text": "Hello Apoorv Here From Tech News By Apoorv And Here Is My Review For This DeviceGreat Viewing Experience with Capacitive Touch screenThe 5.5-inch Super AMOLED HD touchscreen of Samsung Galaxy J7 SM-J700F provides you with the best display. The screen comes with a resolution of 720 x 1280 pixels, 267 ppi pixels of density and colour support of 16M for further enhancement of picture quality. The touchscreen is super responsive to the tap of your fingers so that you can smoothly glide through the pages and widgets of the phone.Snaps and Selfies ZoneIf you prefer a smartphone that features a great camera, the Samsung Galaxy J7 could just be your device. The two hi-tech cameras offered by this Smartphone allow you to capture beautiful and charming shots and selfies. The 13 megapixel main camera is equipped with features like LED flash, Auto Focus, Panorama, Beauty Face, Sound & Shot, Continuous Shot and HDR (High Dynamic Range) to provide you with crystal clear images. Also, there is front 5 megapixel camera to capture ideal and cool selfies. Forget blurred and vague images and cherish beautifully captured memories with Galaxy J7 by Samsung.Sturdy and Durable BatteryThis Smartphone provides you with a solid 3000mAh battery of lithium-ion make which is not only long-lasting but also high on strength. You can now watch more videos, movies and play games for extended hours with Samsung Galaxy J7.High on PerformanceThere is 1.5GHz Octa Core Processor and 1.5GB RAM to ensure that you can seamlessly multitask on your Galaxy J7 at a fast pace. The Android 5.1.1 Lollipop Operating System provides a perfect platform to this Smartphone for smooth working of all the applications.Added FeaturesThere is internal memory space of 16GB in the Galaxy J7 by Samsung, which can further be expanded to 128GB with the help of an external SD card. So, now there is more room for storing all your important data and other multimedia files. This Smartphone works on dual SIM.Buying Link- Samsung Galaxy J7 (Gold)", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Manjeet", 
            "review_header": "Screen is brittle and could damaged", 
            "review_posted_date": "30 January 2017", 
            "review_text": "Screen blanked out on its own. Samsung says that the screen is damaged from inside due to misuse. The phone has not had a single fall, there is no visible sign of damage on the outside but the screen seems to have got damaged. It could have been damaged at the factory stage, however, there is nothing to do but pay for the screen. What is perturbing is that there re other customers who have had such a situation with Samsung J7 phones.Strangely in my office there are people who are careless and many a times have dropped their phones but none of their screens ever get damaged.The phone works good otherwise but the screen is an issue.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "SK", 
            "review_header": "Great phone with superb battery backup", 
            "review_posted_date": "25 March 2017", 
            "review_text": "Amazon Prime delivery within 18 hours to my doorstep , Really commendable .Great phone with superb battery backup , bright super Amoled display , only drawback I could find was the speaker volume - which is very less which I didn't expect from a brand like Samsung ,. Otherwise the phone is very good .", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "N Paulpandian", 
            "review_header": "Review of items recently purchased from amazon", 
            "review_posted_date": "27 June 2016", 
            "review_text": "All the above items were received good condition and meet my expectations and purpose.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Not happy", 
            "review_posted_date": "27 February 2017", 
            "review_text": "Decent phone but display and touchscreen is highly prone to damage. Exactly six months after I bought this device, it fell from a height of 3-4 in a softslip and the display went blank. Despite the screen guard in place and no apparent scrack on the screen, this device is now virtually useless. Samsung authorised service centre says it costs 5k and takes 15 days min. to get this working. Obviously they give no warranties calling this a physical damage.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "NOT RECEIVE 15% CASH BACK ON THIS PRODUCT.", 
            "review_posted_date": "18 March 2017", 
            "review_text": "AT THE TIME OF BOOKING YOU OFFER ME THAT IF YOU PAY BY HDFC CREDIT CARD, YOU GOT EXTRA 15% CASHBACK ON BOOKING, BUT TILL TODAY I AM NOT RECEIVE ANY TYPE OF CASH BACK FROM HDFC OR AMAZON, SO PLEASE DO NECCESARY TO RESOLVE MY PROBLEM", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Worst product", 
            "review_posted_date": "19 September 2016", 
            "review_text": "worst product i received.Phone is getting heated while charging. phone battery is draining without using it.  i applied for return on 12th September but still i didn't get any call from them. do my phone get replaced ???. amazon guys. please contact me", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Faulty phone. No after sales service", 
            "review_posted_date": "9 October 2016", 
            "review_text": "Pathetic after sales service. Phone display stopped working in 5 months. Customer service center refused to repair for free even though product under warranty. Took 2 hours of wait at customer service center and then rude behaviour by Samsung staff. Then he demands 6100 for display for a 11 k phone. Never buying a Samsung phone again ever. Pathetic company!!", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Very good product.", 
            "review_posted_date": "25 August 2016", 
            "review_text": "Very good product, the battery backup is also superb. The only disadvantage with this is camera it's not clear while using camera to check the photos it takes some time and till photo comes it's in blurr mode", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Mehak", 
            "review_header": "Budget smartphone!", 
            "review_posted_date": "25 August 2016", 
            "review_text": "Pros :Overall Performance actually very well you can use this phone without lagIncredible Standby battery lifeGood Camera QualityOTG supportGaming Performance is very goodGood Cellular Call QualityCons :Not Comfortable in Hand and Little bit wideSamsung Gives only basic sensors that means no gyroscope and compass sensorsNo light Sensor1.5 GB of RAM little bit disappointmentSpeaker Output Little bit lowWhile using camera with auto-mode it does over exposurePlease hit the helpful button if you found the review to be helpful!", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Buy it from a Samsung Store rather than Amazon", 
            "review_posted_date": "3 July 2016", 
            "review_text": "Samsung J 7 is a very good  budget smart phone with decent camera and good battry life. I have been using it from last one month, no problem no complain.Buy it from a good samsung store rather than buying it from Amazon.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "4 April 2016", 
            "review_text": "Amazing phone at the price point. The display is wonderful and the camera quality is simply fantastic. Well done.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Android king = Samsung", 
            "review_posted_date": "15 January 2017", 
            "review_text": "Awesome phone in awesome price.. the sunning 5.5 inch amoled display of this phone is shattered proof(So, gorilla glass is provided or not. It doesn't matter), vibrant and gives awesome feel to every picture and video.. Samsung ui is awesome and far better than mi and asus ui.. mi ui is also good but asus ui sucks.. In android devices Samsung is the best premium brand as far I know.. even LG didn't gave me that level best which Samsung did.. Apple is no doubt will remain best for me and I'm apple user since iPhone 4 was launch.. But in android Samsung is the best.. and I'm happy using both of this brands.. The only thing I will request to Samsung is please work on your camera to provide that level picture which apple gives otherwise everything is perfect in you and I believe it will go far better.. My bro is using two of your device edge 6 and note 4.. all of your product is awesome..", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Superb smartphone I've ever had. ...........", 
            "review_posted_date": "11 November 2015", 
            "review_text": "Perfect partner for me. Having a gold coloured variant brought apremium feel to me. I have been using this galaxy j7 since two weeks along moto g3 and moto x play. Even the moto x play did not perform as good as Galaxy j7, Guys please don't go for a moto g3 or moto x play,because being a real life experienced person with the all three mobiles I advice you go for galaxy j7.  Don't see the specs, just use this handset and you'll notice the real experience of a smartphone.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "I liked the phone very much", 
            "review_posted_date": "5 April 2016", 
            "review_text": "I brought J7 from Samsung Vendor Offline. I liked the phone very much. I did a lot of survey regarding smart phones, but at such a price its a very good buy.  The speed is good, no heating issues , fine speaker sound,games are also well playing, camera is also good,,,selfies are coming nice.While buying it i came across the fact this phone has a serious problems of display damage, so i got it insured for 2 years just for 1000k , now i am not worried about any damage.Rest everything is good , you can go for it.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Ajay", 
            "review_header": "Great at price", 
            "review_posted_date": "3 January 2016", 
            "review_text": "Great at price ..wish ram will be 2 gb..for better performanceExcellent battery life..design and model is reach to carry..Budgeted phone..with power packed features except RAM..charger is too small..delicate to carry..5.5 inch..makes it uncomfortable...but sleak body add support in it", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "this is best smart phone for me", 
            "review_posted_date": "19 March 2016", 
            "review_text": "this is best smart phone for me .best camera pictures.best speed .otg cable also supported .", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Screen started flickering after charging and replacement was not possible ...", 
            "review_posted_date": "19 August 2016", 
            "review_text": "Screen started flickering after charging and replacement was not possible after 10 days. It took time to understand the new system so online shopping does not work for me at all. Truely dissatisfied with my online shopping experience. Maybe it's a minute problem even that could not be solved cause the product was purchased online. No support what so ever.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amruta V. Choudhary", 
            "review_header": "not good", 
            "review_posted_date": "21 February 2017", 
            "review_text": "This mobile is not working properly.We dont want this peace kindly replace .We dont have that much time to go galary and collect the repoŕtKindly take the matter seriously and replace the same model at the earliest", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "20 March 2017", 
            "review_text": "Ok", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Worst product sell by amazon.", 
            "review_posted_date": "4 July 2016", 
            "review_text": "Amazon sell very worst product i was buy a phone samsung j7 within 3 month my display has blinking..not working..seller name my dukaan.when I was buy this phn no laminate in display..care set he is dummy set..he ignore for repair the phone..", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Hari", 
            "review_header": "worst from AMAZON", 
            "review_posted_date": "27 July 2016", 
            "review_text": "got a dummy mobile .....worst from AMAZON", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Clarence masih dilawar", 
            "review_header": "One Star", 
            "review_posted_date": "17 March 2017", 
            "review_text": "Very bad phone never buy it. Camera quality is also not good.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "23 March 2017", 
            "review_text": "Ya this is nice phone and picture quility is very best .", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Ashish", 
            "review_header": "Awesome Amoled screen is better than all other competitor High ...", 
            "review_posted_date": "4 March 2017", 
            "review_text": "Just...AwesomeAmoled screen is better than all other competitorHigh end Gaming is awesom", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "manjunath", 
            "review_header": "Three Stars", 
            "review_posted_date": "26 March 2017", 
            "review_text": "Thank you", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Shreyas", 
            "review_header": "Highly recommended phone", 
            "review_posted_date": "26 January 2017", 
            "review_text": "Excellent phone...I have been using this phone for more than a year and I can assure you that you will not regret buying this one. I bought mine from Samsung retail store so I cannot talk about amazon service for this product.The only problem with J7 is that it does not feature Corning Gorilla glass. But if you get a tampered glass, the phone's screen will be protected from dust and scratches. If you need gorilla glass protection, you might want to buy J7 prime. It has all the features of J7 2015 model except AMOLED display which I think is far better than IPS display in terms of color depth and brightness of the screen.When it comes to gaming performance, this phone is the beast. You can play almost all games on the play store without any lag whatsoever. I have tested following games on my phone with maximum possible graphics settings- NOVA 3, GTA San Andreas, Gangster Vegas, Modern Combat 5.Battery backup on this phone is also very impressive. Once fully charged, you can use it for almost two days with normal use (wifi turned on, phone calls (~2 hours a day), music (~1 hour a day).If you are looking for a budget phone with all the essential features, Galaxy J7 is the right phone for you.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "I had purchase samsung galaxy j7 mobile in going offer ...", 
            "review_posted_date": "30 November 2015", 
            "review_text": "I had purchase samsung galaxy j7 mobile in going offer 15% on app 10% on citi bank card but no discount made by you. Please do the needful at your end as soon as possible.thankspraveen kumar9555945927", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Everything in this product is just amazing..", 
            "review_posted_date": "12 April 2016", 
            "review_text": "Everything in this product is just amazing...picture clarity, sound, etc...but the colour is slightly like affecting ur eyes if u watch for more than 1/2 an hour...else the product is very useful...u must buy it", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Fastest prime", 
            "review_posted_date": "25 March 2017", 
            "review_text": "Thank you Amazon for fast delivery of my mobile...And nice handset looking cool in white colour...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Non reliable low quality phone having problems with display and they will never cover it under warranty.", 
            "review_posted_date": "11 October 2016", 
            "review_text": "I have purchased j7 through amazon on 30th october.a few days back a white line appeared on my display and I approached service centre and they are claiming that display went off due to internal damage caused by excessive pressure applied while using the phone and cant be covered under warranty!!!!.my phone looks brand new.they are asking for 6500 rs for screen.i called samsung customer care and they are putting forward absurd reasons:“*putting in jeans pocket*putting in bag etc can cause the display to get damaged and hence not covered under warranty!!!I am going to fight against samsung legally.Also please dont buy j7.j7 is very low quality phone that lacks reliability and hence they are promoting it through online market places like amazon and flipkart.you can get better mobiles from lg motorola etc.u can google reviews about j7 and see the complaints.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "J7", 
            "review_posted_date": "10 January 2016", 
            "review_text": "Got this phone on Jan-07-2016 after many Android  search , comparisons  I selected  this phone simply awesome  nd best in class .Camera  both front and back was best in class as touch factor  good 1 overall  good phone  for midrange  phone buyers.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "3 March 2017", 
            "review_text": "Gr8 phone", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "i am loving it batter than Oppo,Vivo mobiles below 18k", 
            "review_posted_date": "14 March 2017", 
            "review_text": "I bought 10 days ago its simply awesome front camera is superb with flash it works fantastic. i loved it...... i bought it for selfies only and works well. i have installed two games of 2GB each and no hanging issue works pretty good in case of gaming no heating at all 1.5 GB RAM enough.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "First the display is big and awesome, the touch is even better than other samsung ...", 
            "review_posted_date": "30 January 2016", 
            "review_text": "I will write this review step by step. First the display is big and awesome, the touch is even better than other samsung phones and can be comparable to samsung s6 and far better than micromax and etc. I bought the phone 2 months ago and it got fell down 3 times since then but it is working as good as new. The 3000mah battery is really awesome no heating issue at all, playing asphalt 8 for 2 hrs and it gives me 24 hr full backup on single charge, yes i used it for 24 hrs(Day+ Night)  on single charge while on a vacation. Dont worry about the 1.5 gb ram trust me it works better than micromax phone having 2 gb ram. My phone never hang at all although i'm a heavy gamer playing asphalt8 all day. And the camera is just awesome both the front and rear. I'm uploading a photo i have clicked on my phone camera.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Atul Upadhyay", 
            "review_header": "Best smartphone......!!!!", 
            "review_posted_date": "15 April 2016", 
            "review_text": "Awesome cell... Don't think to much .. Just go for it... I choosed one day delivery n got next day early morning. Working smoothlyyyyyy...fastt n furious... Internet speed is too fasttttt if u compare wid other frnd's cellphone at the same time connected in same network.. Camera front and back both are OK n good. 1.5gb ram ...less but Seems like it has above 2gb ram. Happy aftr purchasing this product.. !!!!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Karan Singha", 
            "review_header": "Should I buy it???", 
            "review_posted_date": "3 April 2017", 
            "review_text": "HELLO GUYS WELCOME. IN THIS REVIEW I AM GOING TO TELL YOU WHETHER WE SHOULD BUY THIS PHONE OR NOT. SO LETS START.  THIS REVIEW INCLUDES ABOUT THE SPECS, PROS AND CONS AND OF COURSE MY PERSONAL OPINIONS.SPECIFICATIONS AND PROS OF THE PHONE-CAMERA-  13 MP primary camera with auto focus, LED flash, geotagging, touch focusface detection, panorama AND 5 MP front facing camera. Camera is very good.DISPLAY- 5.5-inch (13.97 centimeters) Super AMOLED capacitive touchscreen720 x 1280 pixels resolution, 267 ppi pixel density16M color supportOPERATING SYSTEM-Android v5.1 Lollipop operating system1.5GHz octa core processorMali T720MP2 GPURAM- 1.5GB RAM, 16GB internalmemory expandable up to 128GB and dual micro SIM (GSM+GSM)BATTERY-3000mAH lithium-ion batteryWARRANTY-1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase  ##############################CONS################################1) BATTERY COULD BE BETTER.2)ONLY Accelerometer, Proximity sensor are present and you may not be able to experience Virtual Reality.3) Processor could be better. You may experience lags and jams while gaming. AlSO RAM IS VERY LESS.  IN THIS PRICE RANGE YOU MAY BUY REDMI NOTE 4 (2GB RAM VARIANT RS. 9999) WHICH IS MUCH BETTER.YOU CAN SPEND SOME MORE AND BUY PHONES LIKE REDMI NOTE 4(3GB RAM OR 4GB RAM).LENEVO VIBE K5 ETC.ACCORDING TO ME PLEASE DONT WASTE YOUR VALUABLE MONEY FOR SUCH PHONE.  Friends if this review was useful then please vote for me . THANK YOU AND HAVE A NICE AND SAFE DAY.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "James", 
            "review_header": "Excellent phone.", 
            "review_posted_date": "24 November 2015", 
            "review_text": "Amazing cell phone for the price, I still have to use it completed but gold color is really nice in phone, it not really a gold but a off gold.Front camera has a flash which is perfect for selfie.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Thnx to samsunh", 
            "review_posted_date": "29 August 2016", 
            "review_text": "Nice product as much more than expected", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Anjali Moze", 
            "review_header": "Five Stars", 
            "review_posted_date": "24 June 2016", 
            "review_text": "Loved it!!!Delivery was punctual.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Saba Ahmed", 
            "review_header": "Five Stars", 
            "review_posted_date": "18 August 2016", 
            "review_text": "I had purchased this item on emi for 12 months giving my hdfc cc but i didn't get any message from my bank regarding emi. Please sort out this matter. Thanks", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "And believe me this phone is as good as s6", 
            "review_posted_date": "12 January 2017", 
            "review_text": "I have using galaxy series from galaxy 1 to galaxy s6 and I just bought j7 . And believe me this phone is as good as s6 .It's just awesome.  Go get it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "ishan", 
            "review_header": "Five Stars", 
            "review_posted_date": "24 March 2017", 
            "review_text": "Brilliant for the price, just perfect", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "10 December 2015", 
            "review_text": "good product. Seller shipped nicely.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "24 May 2016", 
            "review_text": "Great phone in this price range....", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Roli", 
            "review_header": "Very happy with performance", 
            "review_posted_date": "23 September 2016", 
            "review_text": "I have been using this mobile for over a month now. Very happy with performance.The handset came with Android latest marshmallow. Internal Memory 16gb is very important to have essential apps working well. I added 64 gb sd card. Sim slot 1 allows LTE/3G/2G connections. Sim2 only allows 2g.Battery life is good. It's better than iphones in my view as i was a die hard fan of iphones for last 3 years but my view changed within a month of using this handset.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Fara", 
            "review_header": "Best phone", 
            "review_posted_date": "19 December 2015", 
            "review_text": "Awesome fantastic phone ...worth the price.. bought kn amazon ..battery good.. stereo good... memory good.... canera descent.... screen to body ratio amazing ...best buy", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Moni", 
            "review_header": "Five Stars", 
            "review_posted_date": "28 January 2016", 
            "review_text": "I presented to mom n she likes it.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "saif azeez", 
            "review_header": "Five Stars", 
            "review_posted_date": "30 December 2015", 
            "review_text": "Best mobile in this price....nice camera both front and rear....got it in local store for 14900rs with offers selfie stick, screen guard, back cover & casserol..", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "poor speaker volume", 
            "review_posted_date": "16 June 2016", 
            "review_text": "no body informed in any review that speaker volume is low in j7", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Cant hear phone ring and speakers are very low", 
            "review_posted_date": "10 October 2016", 
            "review_text": "The speakers did not work.  Returned the phone.  Had issues with the return and had to call Amazon quite a few times to be successful.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Rockstar", 
            "review_header": "this is really a nice buy, Display is crisp", 
            "review_posted_date": "22 January 2016", 
            "review_text": "I bought it from another website 5 months back, this is really a nice buy, Display is crisp, no lags so far while multitasking. Photos are with lively colors.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Worst experience", 
            "review_posted_date": "24 November 2016", 
            "review_text": "Box not sealed, product is used", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Purushotham", 
            "review_header": "Please do not buy this mobile. 4G will not ...", 
            "review_posted_date": "22 February 2016", 
            "review_text": "Please do not buy this mobile. 4G will not work properly and this is the feedback given by Samsung Service center and and Samsung doenst have any solution for this as of now. Ring tone volume is very less I am suffering because of Samsung", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Swapan K. Mukhopadhyay", 
            "review_header": "Five Stars", 
            "review_posted_date": "7 July 2016", 
            "review_text": "Its a good, but price is high.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Ashish Raj", 
            "review_header": "Very good Phone", 
            "review_posted_date": "5 December 2015", 
            "review_text": "bar guy's This is ashish and today i give a review of galaxy j7I used this phone for 7 days Its A 4G phone so its very fast i used 4G in this phone of airtel and its work quite well in Karnataka.Display ••••••Its super amoled display so its looking very crisp .Very clearSound°°°°°°Very clear sound and its vey loud but not louder than moto x playCamera°°°°°°°13 mp back 5 mp Front with led flashlight very clear both camera and focus very nice.......Processor•••••••Octa core cpu media tek chip setSo all game work quite niceBut one problem its has a 1.5gb ram but i not too bad so over all this phone is very nice🌟🌟🌟🌟🌟", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "28 March 2016", 
            "review_text": "best Samsung mobile for all of us.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Faulty mobile", 
            "review_posted_date": "2 April 2017", 
            "review_text": "It was a faulty mobile which i got. Touch buttons like back buttons and recent window buttons were not functioning at all.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "lavanya k.", 
            "review_header": "A must buy...", 
            "review_posted_date": "30 December 2016", 
            "review_text": "This is the best phone. Best for selfies too...Display is big. U can change the font. But the problem is that there are 5 games in the internal storage which I cannot uninstall and I  don't want those game... otherwise this phone is absolutely great. Memory is expandable till 128 gb. Micro SIM is used.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "31 May 2016", 
            "review_text": "Very handy and proud feeling", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "anand narsude", 
            "review_header": "Asli 4G", 
            "review_posted_date": "31 March 2016", 
            "review_text": "Great picture quality and long battery backup", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "J7", 
            "review_posted_date": "10 January 2016", 
            "review_text": "Got this phone on Jan-07-2016 after many Android  search , comparisons  I selected  this phone simply awesome  nd best in class .Camera  both front and back was best in class as touch factor  good 1 overall  good phone  for midrange  phone buyers.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Good", 
            "review_posted_date": "25 July 2016", 
            "review_text": "Havent buyed it from Amazon but would like to tell that this phone is amazing.. brought it in local store in my city", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Manish B.", 
            "review_header": "Great Phone from the leader", 
            "review_posted_date": "3 November 2015", 
            "review_text": "I purchased it from flipkart 3 months back. The major highlight of this phone is it's battery and display. I am a hard user of mobile with whole day WiFi use and 20-25 calls. Charging full in morning leaves me with around 45% battery at 10.00 p.m.The display is crisp and bright. Camera is not excellent but very good. Features like smart manager and otg support makes it a good deal. Coupled with extended storage, dual sim, 4g LTE,  it is a steal at this price. Though the Ram is only 1.5 gb still I have never seen this phone lagging. Finally the after sale customer service is very good courtesy to large offline dealership of Samsung. I highly recommend this phone.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "me so happy with amazon", 
            "review_posted_date": "28 August 2016", 
            "review_text": "awsm phone  and awsm amazon", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Using from last 6 months Nice mobile Good battery backup Good camera Nice screen touch ...", 
            "review_posted_date": "30 August 2016", 
            "review_text": "Using from last 6 daysNice mobileGood battery backupGood cameraNice screen touch feelnot a bad deal in 13490rs", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Nice buy for 15k", 
            "review_posted_date": "10 May 2016", 
            "review_text": "The device is the best in segment and  was delivered  promptly.  The overall  packing and delivery  methods  were good.Pros.  Good display,  good camera quality among 15k segment,  performance  and speed ok for 15k segment. No heating issue.Cons.  Battery life not so great for heavy users but any ways irrelevant  since the invention  of power banks.  Need aetter quality  headphones.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "22 February 2017", 
            "review_text": "so goog", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Display is damaged within 5 months", 
            "review_posted_date": "28 September 2016", 
            "review_text": "I purchased Samsung J7 on 15/12/15. But within a very short time of 5 months it's display shows some problems. It completly gets blurred when brightness reduced and nothing is visible then. As it was in warranty period so I sent it to service centre. They told me to get its feedback after one week. When I asked for it after one week they told me that they could not rectify it as already such type of problems is already pending in their service centre for a long time. They told me to wait again for 15- 20 days. This is complete negligence of customer canplaints and harrasement to customer. Very very disappointed with Samsung service. Will NEVER BUY a SAMSUNG phone.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "16 March 2016", 
            "review_text": "Good phone amazing camera quality", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Chintan Pathak", 
            "review_header": "Best smartphone ever with awesome camera battery life", 
            "review_posted_date": "27 October 2015", 
            "review_text": "Its a best smartphone in yhis price.I am using this, evrythings r gud but i found only 1 drawback : earphone quality is not good.Any 1 can buy this phone.its really awesome.Best things r camera.battrry & user friendly", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Thnx to samsunh", 
            "review_posted_date": "29 August 2016", 
            "review_text": "Nice product as much more than expected", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Anjali Moze", 
            "review_header": "Five Stars", 
            "review_posted_date": "24 June 2016", 
            "review_text": "Loved it!!!Delivery was punctual.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "this is best smart phone for me", 
            "review_posted_date": "19 March 2016", 
            "review_text": "this is best smart phone for me .best camera pictures.best speed .otg cable also supported .", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "KNVSSARMA", 
            "review_header": "Five Stars", 
            "review_posted_date": "1 September 2016", 
            "review_text": "Nice Mobile", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Pratik Naik", 
            "review_header": "Four Stars", 
            "review_posted_date": "8 January 2016", 
            "review_text": "Great phone", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "10 December 2015", 
            "review_text": "good product. Seller shipped nicely.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Deepak Verma", 
            "review_header": "mast", 
            "review_posted_date": "12 March 2016", 
            "review_text": "Samsung is known for its quality and durability... But this phone is not for gamers.... Although sweet phone.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "SAM", 
            "review_header": "Amazing Smartphone under Budget!!!", 
            "review_posted_date": "13 September 2016", 
            "review_text": "Excellent budget Smartphone from Samsung!!! The features that Samsung Installed in this device are amazing because Earlier Samsung devices with excellent features and specification were little expensive now after Launch of Samsung Galaxy J7,the wait for perfect budget phone is over!! My friend use this device and i also like this phone!!! So my review goes this way!!Pros :**Excellent display Quality (5,5 Inch)**Battery backup brilliant(3000mAH).**Camera very good (Primary 13MP And Front 5Mp)**Good after sales services**No lag no heating problems.**Can play high graphics games.**1.5 GB Ram and good processor.**16 GB internal storage and can be expanded upto 128 GB.**The phone charges fast.**.Latest Android version(v6.0 Marshmallow).Cons:-**The Speaker are at the backside.**Speaker volume is little bit low.**It would be perfect phone if there was 2 GB ram.So here is my honest review about this phone as i used this phone for 2-3 days!!!! Recommended for all those who are looking for a branded Budget smartphone!!!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Two Stars", 
            "review_posted_date": "2 March 2017", 
            "review_text": "The product is not good... even it's not touching the expected line it's front camera is pathetic", 
            "review_rating": "2.0 "
        }, 
        {
            "review_author": "Kamal Singh Rawat", 
            "review_header": "It's excellent and has a great display", 
            "review_posted_date": "10 August 2016", 
            "review_text": "i purchased this phone for it's s-bike feature. It's excellent and has a great display. loving it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "about Samsung galaxy j 7 model", 
            "review_posted_date": "29 August 2016", 
            "review_text": "Still its better I am satisfied with this product Samsung galaxy j7 however bettery back up is good ...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Very good and soft and net is very fast by k.dolai", 
            "review_posted_date": "26 August 2016", 
            "review_text": "Nice very good quality", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "its awesome phone, gud battery backup", 
            "review_posted_date": "22 June 2016", 
            "review_text": "its awesome  phone, gud battery backup, camera quality good, Voice quality and price also gud", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "subramanian", 
            "review_header": "good one", 
            "review_posted_date": "21 August 2016", 
            "review_text": "product workz awesome", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "palash dubey", 
            "review_header": "best midrange killer !!!", 
            "review_posted_date": "19 October 2015", 
            "review_text": "Blindly go for it. Best phone in midrange comparing to xiaomi 4, 4i, moto g3, even moto X This phone is the best phone with amazing superamoled display, Camera, Speed.... everything is perfect in this phone. Dont compare it from ram size because it has octacore processor which is faster as compare to other mid range phones. Speaker volume is less as its not a big issue for me but internal sound is just awesome with headphones(a jays one, recommended) Go for golden colour. It looks awesome.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Manabyoti", 
            "review_header": "Very happy!", 
            "review_posted_date": "29 October 2015", 
            "review_text": "Purchased from retail shop and the phone is just awesome from each & every angle. Some people are saying it has low volume, it may have slight low volume but I must say it has a quality sound and this is what exactly I want and for me volume is sufficient.Most important: Maximum Samsung smartphones lags too much but this is a unique Samsung product where I can't find any sign of lagging. Fully satisfied with J7. Thanks Samsung for making such phone under 14k.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Rahul Narayanan", 
            "review_header": "and upload some great photos taken by", 
            "review_posted_date": "16 July 2016", 
            "review_text": "Still Learning Features,Feedback more once all features tested,and upload some great photos taken by J7", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Fara", 
            "review_header": "Best phone", 
            "review_posted_date": "19 December 2015", 
            "review_text": "Awesome fantastic phone ...worth the price.. bought kn amazon ..battery good.. stereo good... memory good.... canera descent.... screen to body ratio amazing ...best buy", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Worst experience", 
            "review_posted_date": "24 November 2016", 
            "review_text": "Box not sealed, product is used", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "saif azeez", 
            "review_header": "Five Stars", 
            "review_posted_date": "30 December 2015", 
            "review_text": "Best mobile in this price....nice camera both front and rear....got it in local store for 14900rs with offers selfie stick, screen guard, back cover & casserol..", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Phone is Awesome", 
            "review_posted_date": "29 June 2016", 
            "review_text": "I got in delivery time. Handset is in good condition and camera clearity is good. Touch quality is good", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Rockstar", 
            "review_header": "this is really a nice buy, Display is crisp", 
            "review_posted_date": "22 January 2016", 
            "review_text": "I bought it from another website 5 months back, this is really a nice buy, Display is crisp, no lags so far while multitasking. Photos are with lively colors.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Swapan K. Mukhopadhyay", 
            "review_header": "Five Stars", 
            "review_posted_date": "7 July 2016", 
            "review_text": "Its a good, but price is high.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "saimahesh", 
            "review_header": "I am a iphone6 user. then i bought this ...", 
            "review_posted_date": "19 December 2015", 
            "review_text": "I am a iphone6 user .then i bought this phone .but not in amazon.this phone rocks in one word.It is a tough compitator for high budget mobiles.Gaming-5/5Graphics-4.5/5Camera quality-4.5/5Battery-5/5 (lasts gor one day even in rough use)This is a highly recommened product by me in mid range phones .", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Kamal Singh Rawat", 
            "review_header": "It's excellent and has a great display", 
            "review_posted_date": "10 August 2016", 
            "review_text": "i purchased this phone for it's s-bike feature. It's excellent and has a great display. loving it", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "31 May 2016", 
            "review_text": "Very handy and proud feeling", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "23 March 2017", 
            "review_text": "i lick it but i dosent know thai its 4 lte or not", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "its awesome phone, gud battery backup", 
            "review_posted_date": "22 June 2016", 
            "review_text": "its awesome  phone, gud battery backup, camera quality good, Voice quality and price also gud", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "me so happy with amazon", 
            "review_posted_date": "28 August 2016", 
            "review_text": "awsm phone  and awsm amazon", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "1 June 2016", 
            "review_text": "Should provide free cover.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "28 March 2016", 
            "review_text": "best Samsung mobile for all of us.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Samsung is known for its display quality and camera.", 
            "review_posted_date": "22 August 2016", 
            "review_text": "Good brand and nice mobile with good features but the sound frequency is too low . :-(", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "manohar singh", 
            "review_header": "Bad packing quality samsung j7 very nice", 
            "review_posted_date": "30 June 2016", 
            "review_text": "Packing depart  qualityvery  low.. Bad packing qualitysamsung j7 very nice", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "J7 best phone", 
            "review_posted_date": "3 August 2016", 
            "review_text": "Good phone..Has great featuresBattery power is greatDoesn't heat up", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "21 August 2016", 
            "review_text": "Awsm phone with awsme features.only ludicrous thing is 1.5 gb ram.wndrful camra both", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Using from last 6 months Nice mobile Good battery backup Good camera Nice screen touch ...", 
            "review_posted_date": "30 August 2016", 
            "review_text": "Using from last 6 daysNice mobileGood battery backupGood cameraNice screen touch feelnot a bad deal in 13490rs", 
            "review_rating": "4.0 "
        }
    ], 
    "name": "Samsung Galaxy J7 SM-J700F (Black, 16GB)"
}