{
    "total_ratings": "866", 
    "ratings": {
        "2 star": "10", 
        "1 star": "43", 
        "4 star": "153", 
        "3 star": "37", 
        "5 star": "623"
    }, 
    "price": "₹ 24999.00", 
    "reviews": [
        {
            "review_author": "Gourav", 
            "review_header": "Fantastic Camera with sheer performance!!!", 
            "review_posted_date": "9 December 2015", 
            "review_text": "First of all good service from Amazon.in, timely delivery before the expected date. Coming to the product, this is my first DSLR and I have researched online for at least 3 months before getting into a conclusion. It is by far the best among the beginners level DSLR in the 25-45k range. Got confused whether to buy Nikon D3300 or Nikon D5200 but chose this one due to better ISO and faster processor and newer version. I am using this camera since almost 2 months now and after using this I am shocked how can a beginners DSLR give performance like this.Before heading into the review, I would like to mention the contents of the box.⦿⦿⦿⦿⦿⦿⦿IN THE BOX:⦿⦿⦿⦿⦿⦿⦿⦿ Nikon D3300 Body, with body cap.⦿ Nikkor AF-S 18-55 mm f/3.5-5.6 VR II Kit Lens.⦿ EN-EL14a Li-ion Battery, with a terminal cover.⦿ MH-24 Battery Charger.⦿ UC-E17 Data Transfer USB Cable.⦿ EG-CP14 AV cable.⦿ Nikon Strap.⦿ View NX2 CD-ROM.⦿ User Manual.⦿ Warranty Card x 2  1. Two years Warranty Card with the serial Number of the Camera  2. One year International Warranty Card with the serial number of the lens  [Note: Though the two warranty cards comes with either one of the serial numbers, that does not mean it is only applicable to the lens or  camera only, both the warranty cards are applicable to both camera body and lens. Another thing the other accessories are not covered  under any warranty]⦿ 8 GB SD Card (Taped outside the box)⦿ Nikon DSLR Camera Bag⦿ Two Nikon School CDs and one invitation. (Received it as a offer, may not be applicable in your case)[Note the camera does not come with an Accessory Hot-Shoe Cover, unlike other models, so you have to buy it separately, if you need to protect your hot-shoe, it costs around 35 INR in normal camera shop.]✔✔✔✔✔PROS:✔✔✔✔✔✔ The Sensor: Well o well, the 24 MP sensor that you get in this camera is the same one as that of the Nikon D7100 and Nikon D5300 which speaks much of the picture quality you are going to get with this camera. The sensor has a total pixel density of 24.78 pixels, which result in images having much details, while sacrificing the low light performance a bit.✔ The camera comes with a faster and more improved processor, the Expeed 4 Processing Engine which lets the camera to process images and especially videos faster than the older models. This is the main reason why the camera's got faster frame rates than the predecessors.✔ The camera does not come with OLPF(Optical Low Pass Filter) which results in significantly sharper images. Nikon is doing a new upgrade in their cameras nowadays i.e, they are removing the Low Pass Filter, so as a result, the camera can now capture both types of light i.e, with shorter wavelength and longer wavelength which ultimately makes the images much more sharper.✔ The camera has a 11 point focus system, which is awesome for a camera at this price tag. You get a single cross type focus point in the middle and other 10 normal focus points surrounding the frame. This 11 focus points can do a fast auto focus while paired up with a good lens and it also has 3D tracking functionality. This 11 points are also very helpful and fast responsive during manual focusing.✔ The ISO performance is very good for a beginner's DSLR at 12800 and a boost ISO of 25600. More importantly this camera has low noise at 1385 ISO which is awesome. But try to avoid ISO more than 3200 until it is a pitch black scene, because that would produce much noise in the images.✔ The battery backup is also great, 700 shots is very much unexpected from a camera of this configuration but Nikon seems to have got it right. The EN-EL14a battery is an upgraded version of the EN-EL14 battery which used to come with the Nikon D3200 and it has increased mAh and efficient power handling.✔ The kit lens is very good and it has a much faster auto-focus than the predecessor and is also much compact and lighter. Most importantly the lens comes with VR II motor, which is very useful for a beginner having problems to hold the camera still at earlier stages of photography. It keeps that 52 mm filter thread so no worries for ones who have 52 mm filter from your old lenses, you can use them on this.✔ 1080p 60fps, now this is a big deal, even some of the advanced DSLRs can't go that far but this does. Very helpful if you need to shoot action. I have been shooting fast action videos with lag free performance at 1080p 60 fps, thanks to the faster new Expeed 4 processor, which has a super fast processing speed.✔ You get 5fps 24.0MP RAW files which is awesome but you need a good and faster card for that the offered card can't keep up with that speed. Well a good recommendation and in fact the best card will be SanDisk Extreme Pro, it offers fantastic write speed of 72.8mbps for this camera and the buffer never clicks in if you shoot at burst mode using this card, just you have to keep in mind that the shutter needs to be pressed after every 100 shots to continue burst shooting.✔ The camera has a good colour depth of 24.3 bits which produces vivid colours on the images and you can see the effect of those 24.3 bits during post processing.✔ The camera comes with a 3 inch 921k dots LCD display, which may not be the best monitor in the world, but certainly it is bright enough and produces vivid colours close to real world view.✔ Easy Panaroma mode -  Now it is like a bonus though you hardly need it, but handy at times. Remember you are capturing a panaroma from a DSLR so the picture would be much much better than what you may take with phones.✔ Very compact camera. It does not seem like a DSLR if you hold it in your palm, it is so compact and light. The camera only weighs about 450 g (without the battery), which is super light when you are talking about a DSLR of this performance.✘✘✘✘✘CONS:✘✘✘✘✘✘ The ISO can be used at one full stop, so you can't get the 1/3rd or 1/2nd stop ISO at manual mode, but you get that in auto mode, that is may be something Nikon has not made due to simplicity for beginners, but that is not so great a deal due to good ISO performance of this camera.✘ The camera can shoot only 12 bit RAW files, unlike 14 bits in the Nikon D5xxx series, which although produces great image quality, but that extra elegance goes somewhere missing. Though you can hardly notice that until you shoot it at 14 bits RAW and compare the two.✘ No articulating screen, this is something that would have been better to have for shooting at tricky situations, but that also would have raised the price. But personally I did not give that much priority. Also in professional DSLRs you hardly get that articulating screen.That said the cons are not that big deal considering the price of this camera and that it is build focusing mostly for the beginners.◘◘◘◘◘◘◘◘VERDICT:◘◘◘◘◘◘◘◘Overall a wonderful camera to be owned. The camera bag offered is also fair enough. Many of us think that camera does the job, if we have good camera we can get good images but that is not the thing, a photographer makes the photograph unique not the camera. Yes, there are some limitations but still that is not that important for good shots. This camera just has more features compared to counterparts from Canon or Sony, or any other company at the same price point but that is not a great deal for photography, this is just a bit advanced. Well I have attached some shots taken with the camera and the camera itself. Thank you for reading this much. I will update the review after more usage in depth. Please hit Yes if you found my review helpful, if not then you can comment on the review with your issue and I will definitely help you. Happy Shopping!!!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Jaseel JP", 
            "review_header": "Watch the Kit Lens Version", 
            "review_posted_date": "19 September 2016", 
            "review_text": "Nikon has released a new kit lens in 2016 that is compatible with D3300. There are various kit lenses before it. This is what you need to understand :AF- S 18-55mm VR - oldestAF- S 18-55mm VR II - oldAF- P 18-55mm VR- latestThe \"P\" stands for a stepping motor, a newer technology which makes the lens significantly quieter (almost silent) and slightly faster. The new lens has also slightly better performance at wide open settings. And it has VR- Vibration Reduction for image stabilization. You can read the Ken Rockwell review of this lens.I've seen many people being angry at the seller for sending them the AF-P VR lens which is the latest, complaining that they did not get the VR II lens. You should be actually thanking them for sending you the latest lens and not the old one.The new Kit lens requires a firmware update for Nikon D3300( V1.01). But the orders placed now and afterwards will receive cameras with the latest firmware inbuilt.About the camera, you know its the best. Splendid image quality equivalent to higher end Nikon DX cameras. So even if you buy the D7200, there wouldn't be a big difference in image quality. The controls n features change.Reasons why you might want to consider Canon 1200D(1300D has no worthy improvement) :1) You want DSLR quality photos. Nikon just does it better. But Canon's still a DSLR with a big sensor. Great photos there too.2) If you don't shoot RAW or if you don't post process your photos, get the Canon. (This is where Nikon's sensor really shines, at getting the fine details back)3) You will get the 2 lens option with Canon under 23K (on good seasons) and that second lens is a  55-250mm IS II. A very good telephoto lens. So if you're not going to buy another lens at all, Canon has a better deal.4) Canon lenses are usually cheaper. Like the 50mm f1.8 portrait lens. Nikon cost 10,000 INR while Canon's variant is around or below 8000 INR.5)Canon has a very cheap wide lens, the 10-18mm. Nikon doesn't !Canon Cons :1) No amazing sensor. Canon's sensor is smaller in size too. Hence less efficient. But still capable of DSLR quality images. Nikon takes better shots under low light.2) Not for video lovers. No mic jack on Canon. Does not do 60fps which is required for slow mo. Nikon has a mic jack for clear external audio and it does 60fps too.3) Nikon is smaller and lighter.4) Battery. Nikon has double the battery capability compared to Canon.Both have no touch screen nor a screen that tilts. The Kit lens that comes with Nikon is significantly better than Canon's. So it takes great pictures. Sample shots can be seen at Pixelpeeper or Flickr.And yes, the kits lens can blur the background at 55mm f5.6.Lenses to buy afterwards, if you're serious about photography :1) Nikon AF P 70-300 VR. Stabilized lens for 14-15k is a great deal. Autofocus is really fast but the aperture at 300mm is 6.3. So it would struggle a bit under low light situations. A major wildlife photographer needs something like the Tamron 150-600mm lens.2) Nikon 35mm f1.8G. An all around amazing lens. This lens makes you a better photographer. Fixed prime, meaning no zoom. But unmatched image quality at this price. Great for indoor shots too.3) A wide angle lens. Expensive Tokina 11-16mm.4) If portraits are a big deal to you, only then go for the 50mm f1.8 G.Overall an amazing camera. You cannot go wrong with this one. Just make sure you really need a DSLR and its features. If you're someone who needs better images than smartphones with a good flash, better portability and going to shoot in Auto Mode anyway, you're looking for a point and shoot camera and the new ones takes great pictures under good light.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon buyer from gurgaon", 
            "review_header": "Worth every penny to preserve your memories in a Digital format.", 
            "review_posted_date": "1 January 2015", 
            "review_text": "I always had questions in my mind why i need a DSLR? i already have phone and a high megapixel digital camera.But the deal amazon was providing for this product was great, so i did some research and decided to buy this product.To begin with delivery package was very good it had everything to protect my device during logistics.Everything was as described in description of this product.When i initially held the device in my hand i was overwhelmed by number of buttons, for initial few hours i was using auto mode and results were not upto the expectations. but when i view the Tutorial session(of 80 mins) which was provided with package, it was only then i was able to understand the feature of each button and technicality of product. overall it is very easy to learn about utilizing the DSLR to its full capacity.So if you have hands on experience with DSLR then you will love this (at this price), if you are a newbie even then you will love this (although it has 90 mins of learning curve).Deducting 1 start as it did not have a HDR feature inbuilt, as it is manufactured in 2014 so it was expected out of it. apart from that it has everything to offer what you expect from a DSLR.It is worth every penny you invested to keep your memories alive forever. :)", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "ritesh", 
            "review_header": "Best entry level DSLR in the 30K range....", 
            "review_posted_date": "7 November 2014", 
            "review_text": "General Observations about Amazon, packaging & warrantyProduct ordered on 15th Oct --- Delivered on 29th Oct....!!!Packaging was very good.No dealer stamp on warranty and Bill doesnt contain product number which may be a problem for warranty, have to clarify with amazon regarding this, Before purchase i asked them about warranty and they have assured if u buy from Amazon fulfilled supplier amazon will give warranty even if nikon does not gives thats when i decided to buy online since it was 6k cheaper than authorized dealers which will save u money to buy an extra lens!!!Now about the Nikon masterpiece D3300Before buying any expensive product online it is mandatory for us all to do a research about the competetion and available products within our budget. Please compare the available products in ur price range only like u can not compare D3300 with a DSLR costing 55K...It will come down to Canon 1200D with zoom lens kit, D3200, D5200 and Canon 600D.All between 26-32k range. Nikon D3100 & Canon 1100D etc are old models and are still cheaper so i didnt considered them.Being a first DSLR hands down almost 99% of google recommemds D3300. I went to Nikon and Canon dealers and checked all models in this budget. heres why i went for D3300 & the after experience :1) It offers u latest processor and sensor with VR-II kit lens.2) The Battery Life is Best in its class with remarkable nos ahead from the competetion and i felt the same after using it.3) Its really very handy and small compared to D5200, only thing 5200 has a tilt screen but i felt it will not make that much difference, for fitting a tilt screen the size of the camera becomes large. I read a lot since my final two models were 5200 and 3300 and felt that the latest processor and better battery life and a diff of 6k for D3300 will be good for my requirements. Since nowhere u can find exceptional difference between image quality of the two cameras. HDR u will hardly require and tilt screen for me was not a priority.4) The image quality is superb. it has a child mode which is very useful when u dont have time for manual settings. Auto mode produces fine images when u dont have time for settings.5) Comes with 8GB card which will be sufficient for few months till u conquer all skills of photography.6) Bag is ok but not very stylish. Can accomodate an extra lens easily.7) Camera is very very fast, first time users will fall in love with the speed of the camera absolutely no lags anywhere.8) Photograps in low light and indoor pics at evening or night time are also very impressive. Flash does an excellent job.9) Colour reproduction is superb, if u click vegetables and look on HDTV they look way better than they look in real life :)...10) I was not used to click pics through view finder so i thought live view is a very useful feature for a DSLR but in real life u will  hardly use live view once u get ur hands on unless a position where u cant put ur head below the cam, even with specks it is  very easy to shoot using view finder .11) LCD screen is very good. With high resolution screen u can judge the quality of image immediatly after clicking which is difficult if  the LCD resolution is low.12) Nikon website is very informative and helps a lot u can register for nikon school and refer tutorials.13) Canon 1200D with Kit lens & zoom lens is a very tough competetion since Nikon D3300 with similar zoom lens is 10K more but  after a lot of reading from websites and reviews u will find that for image quality nikon is a clear winner at entry level DSLR by a  far margin. Kit lens will fulfil most of ur photography requirements initially, wait till u discover urself what lens u really require  before going on to purchase the combo pack with zoom lens.  Hence i decided to buy D3300 and leave the zoom lens in to be bought further category.14) It takes a little time for autofocus at night in very low light but it is ok otherwise autofocus in all other conditions is excellent.  captures fast moving objects in the frame perfectly.15) Manual supplied in the box is useful, and should be read first if u r using a DSLR for the first time.16) It has a wifi feature which may b useful for clicking pics using ur smart phone but requires u to purchase a dongle.It feels excellent to click from this cam because of its fine ergonomics, small size and light weight. its a worth investment. Its a long road in learning and mastering the techniques in photography, with nikon u will enjoy learing it coz when u do it right it delivers excellent results.... just remember a quote which i like very much :\"\"\" Buying a Nikon doesnt makes u a photographer... it only makes u the owner of the Nikon Camera...\"\"\"So keep learning....", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Mayank Meshram", 
            "review_header": "... and finally proud to say that this is the best.. Its a great camera indeed and best ...", 
            "review_posted_date": "1 May 2015", 
            "review_text": "Bought this after months of researches and finally proud to say that this is the best..Its a great camera indeed and best among others even better in comparison with some upper class in range.Although there is huge comparisons between these two giants canon and nikon, both are equally good.its totally your choice.Nikon d3300 seems good to me and I'm great with this.Also its not the gear only but also the photographer who takes the shot,so Believe in yourself...Image quality is great..built quality is great, feels compact in hand, smaller and compact as compare to others in range..600d seems bulky in hand..kit lens is indeed good and can serve nearly all purposes and its the best if you're just starting with photography, although for best quality, opt for dedicated lenses.like prime for portraits, telephoto for wildlife etc..lacks OLPS-Optical Low Pass Filter, which I thought as a disadvantage but it turns out as an advantage as it improves image quality, sharpness.professional level dslr have this feature..battery life is near 700 shots per charge with normal shooting..ISO is pretty high, better low light image quality..speed, performance, features are good..in camera editing and raw processor is great, easy to use functions..modes are good and there is guide mode for super easy shooting, but manual mode is the key to outstanding shots, if mastered..lacks articulating screen and WIFI and stereo sound recording for better sound quality..although best entry level dslr..A must buyand for best quality shoot in RAW..", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Manu Sharma", 
            "review_header": "Excellent choice for DSLR.. Great deal", 
            "review_posted_date": "19 October 2015", 
            "review_text": "First time in DSLR photography and a hobby that I wish to develop. Had a choice with canon, went with Nikon and no regrets. Amazing camera, got 2 lenses 18-55 and 55-200. Great shots and easy to handle. I am running it in manual mode and loving every moment of it .ontime delivery and great package", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Dheeraj", 
            "review_header": "This camera is amazing.", 
            "review_posted_date": "1 December 2014", 
            "review_text": "D3300 takes beautiful images. I just can't seem to take my hands off it. Now it might be because its pretty new to me, but the images it takes are really beautiful. I would suggest for the person who's buying it, that the kit lens is really good. You would definitely want to buy a 35mm f/1.8 lens(Since its a DX camera its better to go for 35 instead of 50mm) for the Bokeh effect to take great images of objects up close or portraits because the kit lens is not really great at producing bokeh because of the aperture limitations. Bokeh is the effect which makes the background appear blurred out. As an Indian, and if you're someone who's bought an entry level DSLR like this one, definitely go for the other lens for the portraits it will make a huge difference in the photographs you'll take.What the kit lens will do for you, however, is take great images. Honestly 18-55 is rock solid stuff. This lens is really really good and its a steal if you go for the kit lens+body.The video quality is through the roof. For the price I've paid I'm really really satisfied with my camera.Good luck shooting!PS: I'm tagging some photos that I personally took in the last 2 days after I received this camera. These are all in JPEG format.This is the absolute best camera in this price range. Don't think twice about this, just go for it. :)", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "siddhartha", 
            "review_header": "... got my camera today and packing and all were great. I would have rated it a 5 on ...", 
            "review_posted_date": "22 January 2015", 
            "review_text": "for the bundle 3/5got my camera today and packing and all were great. I would have rated it a 5 on 5 except for some issues-1) when i had ordered the camera it was listed at 28400 or thereabouts. I got the product for 28990. since I have been waiting quite sometime, and the price currently is this, i had no choice but to buy.This means the price you see on ordering may not remain the same as the price you get in delivery which is rather strange.2) the kit clearly says 8 gb card included. the box and all were completely sealed ( i checked them myself) but the memory card is just not there.any help will be sincerely appreciated.for the camera 5/5 (i could give a 6/5 :P)the best camera you could buy for the money. definitely better than the d5200. apart from the extra 1 point dynamic range, it is the same thing as far as sensor and all go. plus you get all the advanced features of the d5200 the most time saving one being the automatic distortion control. just download the latest firmware and it will take in any lens you could possibly put on it.advise is add a uvc filter and invest in a lens hood.the automatic hdr on 5200 is crap. if you really are into HDR photography you will have to take multiple shots and merge them on your computer to get proper effects.same goes for landscape (which the d3300 has and d5200 does not).plus the 3300 takes 700 plus hots compared to the 5200 which takes 500 odd shots (and yes i have used both).if you cant afford a leica, or if you are cagey about buying the fuji x, this is the smallest, lightest camera with no oplf filter (sharper images) that you can buy India for under 30000 for street photography. Pair it up with a 35mm 1.8 nikon for more light control. 5fps shooting is more than enough unless you are doing very serious sports photography.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Vinayak S.", 
            "review_header": "Lightening Deal, Awesome Deal !!!", 
            "review_posted_date": "16 October 2015", 
            "review_text": "Received 100% genuine product and on time delivery. I got this deal at very affordable price, which saved my lot of money. Thanks to amazon.I would recommend this Nikon D3300 to beginners and Photography lovers. Ultimate product from NIKON. It gives almost all features that of D5300 (Except the inbuilt WiFi and Vari-Angle Monitor). The all new EXPEED 4 processor is awesome to capture and process the image of 6000x4000 resolution and a video of 1920x1080 @60p. Don't think much, Go ahead and get a Nikon D3300. I bet, you will enjoy photography on D3300!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Anirudh Singh", 
            "review_header": "Nikon D3300-Impressive Budget DSLR", 
            "review_posted_date": "21 February 2017", 
            "review_text": "It’s odd to think how quickly camera technology can pass from the realm of the pro to the amateur, from cutting-edge to passé. Once upon a time we were all astounded by the 24.5MP resolution of the Nikon D3X, a camera designed for professional photographers who were willing to spend £4200 on their gear. Four years later and some people might reasonably be disappointed that the entry-level £500 Nikon D3300 'only' carries the same 24.2MP resolution as its direct predecessor the D3200. How things change.Despite the identical resolutions of the Nikon D3300 and D3200, there is one very important difference that impacts image quality. For the D3300, Nikon has removed the optical anti-aliasing filter. This is a filter installed in digital cameras to reduce occurrences of optical aberrations such as moiré patterning – unwanted artifacts appearing on images that feature repetitive detail patterns. While anti-aliasing filters reduce this effect, the cost is a loss in sharpness. Recently it has become a trendy move for camera manufacturers to remove the filters entirely in favour of optimal sharpness, relying on big megapixel counts to cope with any moiré-causing patterns.The effect for a camera like the D3300 is that its high-resolution sensor is now able to capture every possible detail, putting it in the same league with more advanced (and more expensive) cameras. And with that, things get more interesting.NIKON D3300 VS D3200: WHAT'S THE DIFFERENCE?The resolution may be the same as the D3200, but the D3300 has plenty of other improvements under the bonnet. Chief among these is the new Expeed 4 image-processing engine. Nikon’s fastest processor yet, it improves the D3300’s ISO sensitivity to an impressive maximum of 25,600 and its shooting rate to 5fps – not top of the league but very impressive for an entry-level camera. There are also a few new automatic flash modes, including an option for fill flash.It’s worth noting that there is plenty that remains the same from the previous model in the series. You’ve got an 11-point AF system, a 3-inch 921k-dot rear screen and a 420 pixel RGB sensor metering system, all things that D3200 users will find thoroughly familiar. The D3300 shoots images in JPEG and 12-bit Raw formats, and is capable of saving them to SD, SDHC or SDXC memory cards.The D3300 also carries one big absence over from its predecessor: built-in Wi-Fi. While Nikon (finally) introduced built-in wi-fi with the D5300, the technology did not carry over to the D3300, which still relies on the separately available WU-1a adapter. It’s not a huge annoyance, just be aware that you’ll have to shell out an extra £40 or so if you want to use Wi-Fi on your D3300.Elsewhere there are a number of other optional extras on the D3300. You can attach the Nikon GP-1 module to a socket on the side of the camera in order to geotag images. There are also a number of additional shooting modes: a Rangefinder Mode (finding which requires a little digging into the menus); Mirror Lock-Up, though only for sensor cleaning, not for shooting; Easy Panorama, which automatically stitches several images together; and Effects Mode, with visual filters such as high-key and Selective Colour.To pair with the D3300, Nikon unveiled a new retractable kit lens, the F-S DX NIKKOR 18-55mm f/3.5-5.6G VR II lens, an impressively sharp number with a minimum focus distance of 25cm (when manually focusing; 28cm with AF). As the camera lacks a built-in AF motor it requires AF-S lenses in order to be able to autofocus.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "chaitanyasagar.d", 
            "review_header": "Five Stars", 
            "review_posted_date": "11 February 2015", 
            "review_text": "GOOD", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Gourav", 
            "review_header": "Fantastic Camera with sheer performance!!!", 
            "review_posted_date": "9 December 2015", 
            "review_text": "First of all good service from Amazon.in, timely delivery before the expected date. Coming to the product, this is my first DSLR and I have researched online for at least 3 months before getting into a conclusion. It is by far the best among the beginners level DSLR in the 25-45k range. Got confused whether to buy Nikon D3300 or Nikon D5200 but chose this one due to better ISO and faster processor and newer version. I am using this camera since almost 2 months now and after using this I am shocked how can a beginners DSLR give performance like this.Before heading into the review, I would like to mention the contents of the box.⦿⦿⦿⦿⦿⦿⦿IN THE BOX:⦿⦿⦿⦿⦿⦿⦿⦿ Nikon D3300 Body, with body cap.⦿ Nikkor AF-S 18-55 mm f/3.5-5.6 VR II Kit Lens.⦿ EN-EL14a Li-ion Battery, with a terminal cover.⦿ MH-24 Battery Charger.⦿ UC-E17 Data Transfer USB Cable.⦿ EG-CP14 AV cable.⦿ Nikon Strap.⦿ View NX2 CD-ROM.⦿ User Manual.⦿ Warranty Card x 2  1. Two years Warranty Card with the serial Number of the Camera  2. One year International Warranty Card with the serial number of the lens  [Note: Though the two warranty cards comes with either one of the serial numbers, that does not mean it is only applicable to the lens or  camera only, both the warranty cards are applicable to both camera body and lens. Another thing the other accessories are not covered  under any warranty]⦿ 8 GB SD Card (Taped outside the box)⦿ Nikon DSLR Camera Bag⦿ Two Nikon School CDs and one invitation. (Received it as a offer, may not be applicable in your case)[Note the camera does not come with an Accessory Hot-Shoe Cover, unlike other models, so you have to buy it separately, if you need to protect your hot-shoe, it costs around 35 INR in normal camera shop.]✔✔✔✔✔PROS:✔✔✔✔✔✔ The Sensor: Well o well, the 24 MP sensor that you get in this camera is the same one as that of the Nikon D7100 and Nikon D5300 which speaks much of the picture quality you are going to get with this camera. The sensor has a total pixel density of 24.78 pixels, which result in images having much details, while sacrificing the low light performance a bit.✔ The camera comes with a faster and more improved processor, the Expeed 4 Processing Engine which lets the camera to process images and especially videos faster than the older models. This is the main reason why the camera's got faster frame rates than the predecessors.✔ The camera does not come with OLPF(Optical Low Pass Filter) which results in significantly sharper images. Nikon is doing a new upgrade in their cameras nowadays i.e, they are removing the Low Pass Filter, so as a result, the camera can now capture both types of light i.e, with shorter wavelength and longer wavelength which ultimately makes the images much more sharper.✔ The camera has a 11 point focus system, which is awesome for a camera at this price tag. You get a single cross type focus point in the middle and other 10 normal focus points surrounding the frame. This 11 focus points can do a fast auto focus while paired up with a good lens and it also has 3D tracking functionality. This 11 points are also very helpful and fast responsive during manual focusing.✔ The ISO performance is very good for a beginner's DSLR at 12800 and a boost ISO of 25600. More importantly this camera has low noise at 1385 ISO which is awesome. But try to avoid ISO more than 3200 until it is a pitch black scene, because that would produce much noise in the images.✔ The battery backup is also great, 700 shots is very much unexpected from a camera of this configuration but Nikon seems to have got it right. The EN-EL14a battery is an upgraded version of the EN-EL14 battery which used to come with the Nikon D3200 and it has increased mAh and efficient power handling.✔ The kit lens is very good and it has a much faster auto-focus than the predecessor and is also much compact and lighter. Most importantly the lens comes with VR II motor, which is very useful for a beginner having problems to hold the camera still at earlier stages of photography. It keeps that 52 mm filter thread so no worries for ones who have 52 mm filter from your old lenses, you can use them on this.✔ 1080p 60fps, now this is a big deal, even some of the advanced DSLRs can't go that far but this does. Very helpful if you need to shoot action. I have been shooting fast action videos with lag free performance at 1080p 60 fps, thanks to the faster new Expeed 4 processor, which has a super fast processing speed.✔ You get 5fps 24.0MP RAW files which is awesome but you need a good and faster card for that the offered card can't keep up with that speed. Well a good recommendation and in fact the best card will be SanDisk Extreme Pro, it offers fantastic write speed of 72.8mbps for this camera and the buffer never clicks in if you shoot at burst mode using this card, just you have to keep in mind that the shutter needs to be pressed after every 100 shots to continue burst shooting.✔ The camera has a good colour depth of 24.3 bits which produces vivid colours on the images and you can see the effect of those 24.3 bits during post processing.✔ The camera comes with a 3 inch 921k dots LCD display, which may not be the best monitor in the world, but certainly it is bright enough and produces vivid colours close to real world view.✔ Easy Panaroma mode -  Now it is like a bonus though you hardly need it, but handy at times. Remember you are capturing a panaroma from a DSLR so the picture would be much much better than what you may take with phones.✔ Very compact camera. It does not seem like a DSLR if you hold it in your palm, it is so compact and light. The camera only weighs about 450 g (without the battery), which is super light when you are talking about a DSLR of this performance.✘✘✘✘✘CONS:✘✘✘✘✘✘ The ISO can be used at one full stop, so you can't get the 1/3rd or 1/2nd stop ISO at manual mode, but you get that in auto mode, that is may be something Nikon has not made due to simplicity for beginners, but that is not so great a deal due to good ISO performance of this camera.✘ The camera can shoot only 12 bit RAW files, unlike 14 bits in the Nikon D5xxx series, which although produces great image quality, but that extra elegance goes somewhere missing. Though you can hardly notice that until you shoot it at 14 bits RAW and compare the two.✘ No articulating screen, this is something that would have been better to have for shooting at tricky situations, but that also would have raised the price. But personally I did not give that much priority. Also in professional DSLRs you hardly get that articulating screen.That said the cons are not that big deal considering the price of this camera and that it is build focusing mostly for the beginners.◘◘◘◘◘◘◘◘VERDICT:◘◘◘◘◘◘◘◘Overall a wonderful camera to be owned. The camera bag offered is also fair enough. Many of us think that camera does the job, if we have good camera we can get good images but that is not the thing, a photographer makes the photograph unique not the camera. Yes, there are some limitations but still that is not that important for good shots. This camera just has more features compared to counterparts from Canon or Sony, or any other company at the same price point but that is not a great deal for photography, this is just a bit advanced. Well I have attached some shots taken with the camera and the camera itself. Thank you for reading this much. I will update the review after more usage in depth. Please hit Yes if you found my review helpful, if not then you can comment on the review with your issue and I will definitely help you. Happy Shopping!!!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Jaseel JP", 
            "review_header": "Watch the Kit Lens Version", 
            "review_posted_date": "19 September 2016", 
            "review_text": "Nikon has released a new kit lens in 2016 that is compatible with D3300. There are various kit lenses before it. This is what you need to understand :AF- S 18-55mm VR - oldestAF- S 18-55mm VR II - oldAF- P 18-55mm VR- latestThe \"P\" stands for a stepping motor, a newer technology which makes the lens significantly quieter (almost silent) and slightly faster. The new lens has also slightly better performance at wide open settings. And it has VR- Vibration Reduction for image stabilization. You can read the Ken Rockwell review of this lens.I've seen many people being angry at the seller for sending them the AF-P VR lens which is the latest, complaining that they did not get the VR II lens. You should be actually thanking them for sending you the latest lens and not the old one.The new Kit lens requires a firmware update for Nikon D3300( V1.01). But the orders placed now and afterwards will receive cameras with the latest firmware inbuilt.About the camera, you know its the best. Splendid image quality equivalent to higher end Nikon DX cameras. So even if you buy the D7200, there wouldn't be a big difference in image quality. The controls n features change.Reasons why you might want to consider Canon 1200D(1300D has no worthy improvement) :1) You want DSLR quality photos. Nikon just does it better. But Canon's still a DSLR with a big sensor. Great photos there too.2) If you don't shoot RAW or if you don't post process your photos, get the Canon. (This is where Nikon's sensor really shines, at getting the fine details back)3) You will get the 2 lens option with Canon under 23K (on good seasons) and that second lens is a  55-250mm IS II. A very good telephoto lens. So if you're not going to buy another lens at all, Canon has a better deal.4) Canon lenses are usually cheaper. Like the 50mm f1.8 portrait lens. Nikon cost 10,000 INR while Canon's variant is around or below 8000 INR.5)Canon has a very cheap wide lens, the 10-18mm. Nikon doesn't !Canon Cons :1) No amazing sensor. Canon's sensor is smaller in size too. Hence less efficient. But still capable of DSLR quality images. Nikon takes better shots under low light.2) Not for video lovers. No mic jack on Canon. Does not do 60fps which is required for slow mo. Nikon has a mic jack for clear external audio and it does 60fps too.3) Nikon is smaller and lighter.4) Battery. Nikon has double the battery capability compared to Canon.Both have no touch screen nor a screen that tilts. The Kit lens that comes with Nikon is significantly better than Canon's. So it takes great pictures. Sample shots can be seen at Pixelpeeper or Flickr.And yes, the kits lens can blur the background at 55mm f5.6.Lenses to buy afterwards, if you're serious about photography :1) Nikon AF P 70-300 VR. Stabilized lens for 14-15k is a great deal. Autofocus is really fast but the aperture at 300mm is 6.3. So it would struggle a bit under low light situations. A major wildlife photographer needs something like the Tamron 150-600mm lens.2) Nikon 35mm f1.8G. An all around amazing lens. This lens makes you a better photographer. Fixed prime, meaning no zoom. But unmatched image quality at this price. Great for indoor shots too.3) A wide angle lens. Expensive Tokina 11-16mm.4) If portraits are a big deal to you, only then go for the 50mm f1.8 G.Overall an amazing camera. You cannot go wrong with this one. Just make sure you really need a DSLR and its features. If you're someone who needs better images than smartphones with a good flash, better portability and going to shoot in Auto Mode anyway, you're looking for a point and shoot camera and the new ones takes great pictures under good light.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Alice in Worcestershire", 
            "review_header": "Great purchase.", 
            "review_posted_date": "23 November 2015", 
            "review_text": "So far - So good.  Everything that was listed was in the box, and the camera bag is better than I expected... no need to buy another one.Nice light-weight camera with all the modern bells and whistles. On-screen manual is a big plus, and DVD's with instruction videos are great. Good purchase.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon buyer from gurgaon", 
            "review_header": "Worth every penny to preserve your memories in a Digital format.", 
            "review_posted_date": "1 January 2015", 
            "review_text": "I always had questions in my mind why i need a DSLR? i already have phone and a high megapixel digital camera.But the deal amazon was providing for this product was great, so i did some research and decided to buy this product.To begin with delivery package was very good it had everything to protect my device during logistics.Everything was as described in description of this product.When i initially held the device in my hand i was overwhelmed by number of buttons, for initial few hours i was using auto mode and results were not upto the expectations. but when i view the Tutorial session(of 80 mins) which was provided with package, it was only then i was able to understand the feature of each button and technicality of product. overall it is very easy to learn about utilizing the DSLR to its full capacity.So if you have hands on experience with DSLR then you will love this (at this price), if you are a newbie even then you will love this (although it has 90 mins of learning curve).Deducting 1 start as it did not have a HDR feature inbuilt, as it is manufactured in 2014 so it was expected out of it. apart from that it has everything to offer what you expect from a DSLR.It is worth every penny you invested to keep your memories alive forever. :)", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Vinay", 
            "review_header": "Best DSLR for Beginner's", 
            "review_posted_date": "15 November 2016", 
            "review_text": "Really awesome and budget DSLR for beginner's. Missing the wifi feature to transfer shots but can use a OTG adapter to compensate for that.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Subhransu", 
            "review_header": "Great product @ such a good price( I bought it ...", 
            "review_posted_date": "31 October 2016", 
            "review_text": "Great product @ such a good price( I bought it Rs 23200).Though this is my 1st DSLR, I m very excited to use this product.. I was confused to go for which model.But after reading so many reviews decided to go for D3300.Very good camera for new users of DSLR.If u r thinking to buy or nt to buy it I suggest to go for it.Good professional camera @good price,clearly outweighs other options.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "ren odyuo", 
            "review_header": "Wow", 
            "review_posted_date": "25 December 2015", 
            "review_text": "A very versatile DSLR from Nikon. Great picture quality with an awesome design.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Manoj", 
            "review_header": "Old lens provided with no switch option of A/M and VR", 
            "review_posted_date": "13 October 2016", 
            "review_text": "The lens provided with camera are not same as shown and delivered by other seller with d3300. Lens not adequate and unexpected quality delivered.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "SJ Chakraborty", 
            "review_header": "Very disappointed to write", 
            "review_posted_date": "1 August 2016", 
            "review_text": "Very disappointed to write, when I started registering my product on the Nikon website I was dumb stuck finding that the Lens is a VR lens and not VR 2. Cam was good and original. Can the other people who purchased the same product check if you have received a VR leans or a VR 2 lens with this pack. Amazon is initiating a return stating its fault but whose fault they are not sure till now.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Rajanikanta Tripathy", 
            "review_header": "Must have a camera like this !! Check these photos", 
            "review_posted_date": "12 September 2016", 
            "review_text": "Hi, guysThis is a awesome camerA. I started as a beginner with this camera and now after 2 years my images are in the stock photography sites like dreams time,sutterstock..So without saying anything I just share some of my photos.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Gaurav", 
            "review_header": "Awesome picture quality", 
            "review_posted_date": "10 September 2015", 
            "review_text": "Awesome picture quality. My decision for purchasing this camera is correct after I received this and taken few shots. Another thought was to purchase D5300 but it is not worth spending 10000 more bucks for wifi and 39 focus point system. Both camera has same picture quality if taken correctly..VR2 Lens for 55-200 and 18-55 both are producing crisp clear images. I have attached few of the pics I taken.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Ajay M", 
            "review_header": "Charger Stopped working after 2 months. It is not covered under warranty and Amazon is not able to help.", 
            "review_posted_date": "29 September 2014", 
            "review_text": "Delivery was prompt and product is also awesome. But after 2 months the charger stopped working and when I contacted Nikon India support they said charger is not covered under warranty for online purchases. So I contacted Amazon and they asked me to order a new one from amazon, for which the amount will be refunded, if the order is amazon fulfilled. But I couldn't find any seller for the charger which is amazon fulfilled. So I contacted Amazon again and they said they can give 2000 rupees refund, but that will break my EMI. Also the product was costing around 2800 rupees and in that case I will have to shell out 800 rupees from my pocket. So the last option was to return the entire product, but I was not interested in that option as I was travelling the very next day and wanted to use the Camera. Finally Amazon said they are helpless and can't do anything in this case. I am feeling very bad about my purchase from Amazon now.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "himanshu", 
            "review_header": "Close eyes and go for it", 
            "review_posted_date": "22 October 2015", 
            "review_text": "The seller is reliable and comes with the amazon protection. Its an Indian product with the Indian warranty card. The packaging is good and I rate them the best.I am a beginner for DSLR but I must admit the quality is awesome and you will love using this camera", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Aswin", 
            "review_header": "Nikon d3300 - a happy customer", 
            "review_posted_date": "1 January 2015", 
            "review_text": "Product reached as promised in well packed condition. I am new to dslr camera's but the nikon is light, compact and gives very happy picture quality for a casual photographer like me. The user interface is a bit of a let down when it comes to simplicity and ease of use vut you will get used to it and hence not a big issue.Overall very happy with the product and thr service offered by the seller and amazon.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Pranav Kanabar", 
            "review_header": "Absolutely the best mid level (not entry level) camera!", 
            "review_posted_date": "16 October 2014", 
            "review_text": "After a lot of research as usual, decided that Nikon India is sheepishly hiding a clearly better product by advertising D5300 and not even mentioning pretty efficiently speced and a bargainishly priced D3300 in their paper advertisements.Except a detachable LCD, wifi and a few more points in Auto focus,I couldn't find any table tilting difference between D3300 and D5300. The sensor is the same, the mega pixel count is the same. Heck D3300 doesn't even have a light filter making each pixel square accept more light. This is advanced DSLR category!I got it at a fantastic price on Amazon. Opted for next day delivery. No probs at all.Went to a 40 day trip to Canada, captured more than 7000 pictures. The images are crisp, color tones perfect, out of the box 'Auto Mode' captures pretty decent (at times even better than manual!) images. Low light performance is also acceptable. Though one needs a bit more practice at low shttee speeds and without a tripod. If you plan to explore night life with this serious camera, you'd definately need a tripod. Otherwise no complains at all. Already feel like I have got my investment's return!I also captured tons of Full HD videos. God the only thing I missed is the image stabilization coz on a 42\" 3D tv the lack of motion soothing is heavily missed. Yet when you know what you're doing, D3300 takes mind boggling videos!The lens along with the kit is the ED VR 18-55 mm Nikkor lens. It does the job perfectly for your day to day photography. But I am just so sure looking at the specs that the D3300 has tons more to offer so planing to by a Prime lens and also a zoom/macro lens in the near future.The party has only just started!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Jasmin Dedania", 
            "review_header": "Exiting Camera With Exiting Offer....ThankYou Amazon ..!!", 
            "review_posted_date": "29 September 2014", 
            "review_text": "One of the best Camera.... Best entry level DSLR i used it for around a week and clicked some 100+ photos in all modes an was way better than Canon 1200D resolution is at its peak. Battery is awesome can click up to 650+ photos. The best thing of this offer is it gives combo lense, I particularly love to use 55-200 mm lense. it comes with shoulder strap and also an (made in Gujarat) Leather carry bag which can carry both lenses.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "umesh", 
            "review_header": "amazing camera at amazing price", 
            "review_posted_date": "18 February 2015", 
            "review_text": "this is my first dslr camera..was confused between nikon d3300 nd 5200 as d price difference was nt much (arnd 4k) between d two..but amazon cleared all my doubts by reducing d price of d3300..i purchased d device at amazing price of 24k..the performance of d camera is excellent..nt used much but i m loving it..:)", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "ayush garg", 
            "review_header": "Excellent camera", 
            "review_posted_date": "28 December 2016", 
            "review_text": "After reading a lot of reviews and lot of research about this nikon camera. I decided to buy this and now after taking some shots with this camera i am completely impressed by its quality.I've chosen 1 day delivery with amazon prime and it was superb.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Sergio", 
            "review_header": "An Awesome Buy..... Small Light and Simple", 
            "review_posted_date": "23 October 2015", 
            "review_text": "I am new to the complex world of photography but the D3300 is a great product and value for money with what it delivers. The manual mode can be stressful at first but once you understand how each aspect affects a picture in the environment it is in fact a pleasure to play with and get that perfect image.The controls are easy to use and a little practice will help you get the hang of it since its not overly complicated.overall its a small and neat camera that fits snugly in your hands, and a great camera waiting to see what you can make of all it has to offer.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Three Stars", 
            "review_posted_date": "12 March 2017", 
            "review_text": "OK", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Debashis Mukherjee", 
            "review_header": "Nikon D3300 received with Invoice containing wrong serial number", 
            "review_posted_date": "1 August 2015", 
            "review_text": "There is no doubt that D3300 is a good entry level DSLR as of now. I chose it after extensive homework on the internet as well as physically checking out several alternatives in camera stores. For less than the price I paid for the Nikon D3300 with 18-55 lens, I could have got a Canon 1200D with 18-55 + 55-200 lens. But I still chose the costlier Nikon because : (a) better reviews, (b) more compact with retractable kit lens, (c) more megapixels, (d) better low-light performance (higher ISO), (e) more battery life, and (f) better video mode.The camera I bought from Amazon.in was supplied by M/s DN Digitals, Pune. I received the item promptly as promised. But I found a mistake in the Invoice received along with the item -- the \"Serial No.\" mentioned in the Invoice neither matched the sl. no. of the camera body nor that of the kit lens. I immediately took up the matter with Amazon and they promised to send me a corrected Invoice which they haven't done so far.I have already sent two reminders to Amazon during the last 5 weeks. Every time they promptly reply saying they are sending the corrected Invoice but nothing happens thereafter.Those who travel abroad know that when one returns to India, Customs people often check the items one is carrying. If I'm carrying an item I took with me from India, I should be able to prove that I bought it in India and not abroad. For this purpose, I always carry the Invoice. But if the serial no. of the item in the Invoice is not matching the actual sl. no., Customs people may not accept that the item was bought in India. I have been repeatedly explaining this problem to Amazon.in but so far they have done nothing.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Ninad Meher", 
            "review_header": "Awesome product DONT EVEN THINK JUST BUY!!!", 
            "review_posted_date": "22 February 2017", 
            "review_text": "Of your trying to enter into photography its a very good option for entry level dslrPicture quality and durability is awesomeNot even face an single.issue while usingWorthy productPROS: F- mount which is very common for nikon dslrs you will easily borrow lenses from your friends and colleges uses nikon dslrAfter purchasing prime lenses you can click awesome potraitsEasy to handle came with awesome tutorials which explains every featuresWith wireless adapter it can be handled from any android devices so you will get an articulated screen and remoteAccessories are easily found on online as well as offlineGreate way to capture awesome picturesI am not even close to beginner for photography but still ankle to click some awesome picturesYou can check my instagram profile #ninadmxCONS:No time lapseNo hdr(still you can capture pictures and merge to get hdr pictures)AWESOME PRODUCTWORTHY PRODCUTBEST AMONGS ENTRY LEVEL DSLRS", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "ritesh", 
            "review_header": "Best entry level DSLR in the 30K range....", 
            "review_posted_date": "7 November 2014", 
            "review_text": "General Observations about Amazon, packaging & warrantyProduct ordered on 15th Oct --- Delivered on 29th Oct....!!!Packaging was very good.No dealer stamp on warranty and Bill doesnt contain product number which may be a problem for warranty, have to clarify with amazon regarding this, Before purchase i asked them about warranty and they have assured if u buy from Amazon fulfilled supplier amazon will give warranty even if nikon does not gives thats when i decided to buy online since it was 6k cheaper than authorized dealers which will save u money to buy an extra lens!!!Now about the Nikon masterpiece D3300Before buying any expensive product online it is mandatory for us all to do a research about the competetion and available products within our budget. Please compare the available products in ur price range only like u can not compare D3300 with a DSLR costing 55K...It will come down to Canon 1200D with zoom lens kit, D3200, D5200 and Canon 600D.All between 26-32k range. Nikon D3100 & Canon 1100D etc are old models and are still cheaper so i didnt considered them.Being a first DSLR hands down almost 99% of google recommemds D3300. I went to Nikon and Canon dealers and checked all models in this budget. heres why i went for D3300 & the after experience :1) It offers u latest processor and sensor with VR-II kit lens.2) The Battery Life is Best in its class with remarkable nos ahead from the competetion and i felt the same after using it.3) Its really very handy and small compared to D5200, only thing 5200 has a tilt screen but i felt it will not make that much difference, for fitting a tilt screen the size of the camera becomes large. I read a lot since my final two models were 5200 and 3300 and felt that the latest processor and better battery life and a diff of 6k for D3300 will be good for my requirements. Since nowhere u can find exceptional difference between image quality of the two cameras. HDR u will hardly require and tilt screen for me was not a priority.4) The image quality is superb. it has a child mode which is very useful when u dont have time for manual settings. Auto mode produces fine images when u dont have time for settings.5) Comes with 8GB card which will be sufficient for few months till u conquer all skills of photography.6) Bag is ok but not very stylish. Can accomodate an extra lens easily.7) Camera is very very fast, first time users will fall in love with the speed of the camera absolutely no lags anywhere.8) Photograps in low light and indoor pics at evening or night time are also very impressive. Flash does an excellent job.9) Colour reproduction is superb, if u click vegetables and look on HDTV they look way better than they look in real life :)...10) I was not used to click pics through view finder so i thought live view is a very useful feature for a DSLR but in real life u will  hardly use live view once u get ur hands on unless a position where u cant put ur head below the cam, even with specks it is  very easy to shoot using view finder .11) LCD screen is very good. With high resolution screen u can judge the quality of image immediatly after clicking which is difficult if  the LCD resolution is low.12) Nikon website is very informative and helps a lot u can register for nikon school and refer tutorials.13) Canon 1200D with Kit lens & zoom lens is a very tough competetion since Nikon D3300 with similar zoom lens is 10K more but  after a lot of reading from websites and reviews u will find that for image quality nikon is a clear winner at entry level DSLR by a  far margin. Kit lens will fulfil most of ur photography requirements initially, wait till u discover urself what lens u really require  before going on to purchase the combo pack with zoom lens.  Hence i decided to buy D3300 and leave the zoom lens in to be bought further category.14) It takes a little time for autofocus at night in very low light but it is ok otherwise autofocus in all other conditions is excellent.  captures fast moving objects in the frame perfectly.15) Manual supplied in the box is useful, and should be read first if u r using a DSLR for the first time.16) It has a wifi feature which may b useful for clicking pics using ur smart phone but requires u to purchase a dongle.It feels excellent to click from this cam because of its fine ergonomics, small size and light weight. its a worth investment. Its a long road in learning and mastering the techniques in photography, with nikon u will enjoy learing it coz when u do it right it delivers excellent results.... just remember a quote which i like very much :\"\"\" Buying a Nikon doesnt makes u a photographer... it only makes u the owner of the Nikon Camera...\"\"\"So keep learning....", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Puneet Pareek", 
            "review_header": "Value for money camera", 
            "review_posted_date": "11 July 2014", 
            "review_text": "After research of options from Canon and Nikon I decided on this SLR as a real value for money. Found the cheapest deal for this camera on the Amazon. Other options considered were Canon EOS 1200 and Nikon D 5200.It has all the features you would need, 16 focal points are enough, don't need too many, LCD does not tilt but I am fine with that, how much do you need it? It has no wifi or GPS but no big deal again. It has lots of functions and gives you a versatile SLR for a reasonable price. The basic kit lens came at a bargain price. You can add a lens or two as you start using the camera. I added 1.8 mm nikon prime lens to begin with for low light performance. If you want a lens for wildlife with a great zoom then 60-300 mm VR lens from nikon is great though slightly expensive at about 26000/- .  Finally, it's the person behind the camera who makes the difference and this camera will not be wanting in features and options to achieve great shots.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Abhishek Maitra", 
            "review_header": "The Best one !", 
            "review_posted_date": "30 March 2017", 
            "review_text": "The best camera. This is the only camera which have the ability to capture Pro Photography in this price range. Large APSC sensor is very important to get less noisy images. awesome ISO capability , shutter speed is enough. And the video is also clear in resolution and its FPS which is 60! It is the most popular and useful DSLR .", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon shopper", 
            "review_header": "Five Stars", 
            "review_posted_date": "24 September 2016", 
            "review_text": "Till now satisfied.Good packaging and service.Camera and lens works fine.No warranty issues. It is purely genuine, i went to Nikon service Center and checked it's authenticity.Go for it 😉", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Sayan Das", 
            "review_header": "Didnt get the free FlashAir as mentioned on the box :(", 
            "review_posted_date": "26 March 2017", 
            "review_text": "Very nice camera. However I have given it  it 3 starts because Package said I am getting a Toshina Flash Air. Inside the package it was missing, but the pamphlet is still there. I have received a normal 16GB toshiba card what was stuck to the outside of the box.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "DANISH JUNAIDI", 
            "review_header": "Hats off to the Amazon Team", 
            "review_posted_date": "7 April 2016", 
            "review_text": "Bought Nikon DSLR 3300  after making adequate comparative analysis and this camera came  up to my expectations. Amazon offered  the most competitive price.Placed an order for the same. Received the consignment within a week. I will be failing in my duty if I forget  to mention about the exemplary service by Amazon. Hats off to the Amazon team.  Had been to the state of Kerala (Wayanad) _KURUVA ISLAND and BANASURA DAM to test the clarity, precision,sharpness, contrast etc of my Nikon camera, captured a few scenic spots of  Gods Own Country i.e., Kerala. The photos are quite lively. I am not a professional photographer, still I have tried to have some marvellous snaps. I  am uploading a few photographs for the benefit of potential buyers of the camera", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Camera is very good. Packing was also fine", 
            "review_posted_date": "23 March 2017", 
            "review_text": "Camera is very good.Packing was also fine.My order was delivered on time.Just one thing i want to say that on the box of camera it's written that a tutorial cd is also given. I found a cd but it was not tutorial. Just a software to support thr transfer of photos from cam to pc.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "dynium", 
            "review_header": "Four Stars", 
            "review_posted_date": "10 March 2016", 
            "review_text": "Excellent product. Delivery spot on. Goods received in proper condition.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Kalyana Chakravarthy", 
            "review_header": "Good Camera. Awsome service by Amazon.", 
            "review_posted_date": "9 May 2016", 
            "review_text": "Camera is very good will have to use it to the potential of a DSLR and see what I can discover. Definitely need to buy more lenses.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Bubul Kumar Baske", 
            "review_header": "Five Stars", 
            "review_posted_date": "8 February 2017", 
            "review_text": "Very very very Good Product. use it blindly.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Ampili", 
            "review_header": "Five Stars", 
            "review_posted_date": "13 February 2017", 
            "review_text": "Good one.. Delivered well ahead of expected date...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Conrad lobo", 
            "review_header": "Amazing", 
            "review_posted_date": "16 February 2017", 
            "review_text": "Camera is awesome but did nit get the Toshiba wifi card instead a normal card. Rest amazing camera enjoying it a lot.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Anuj Tripathi", 
            "review_header": "Your first DSLR experience", 
            "review_posted_date": "20 February 2017", 
            "review_text": "I can't ask for more. Perfect DSLR for beginners. Amazon had done timely delivery. Perfect 5 stars from me.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Mayank Meshram", 
            "review_header": "... and finally proud to say that this is the best.. Its a great camera indeed and best ...", 
            "review_posted_date": "1 May 2015", 
            "review_text": "Bought this after months of researches and finally proud to say that this is the best..Its a great camera indeed and best among others even better in comparison with some upper class in range.Although there is huge comparisons between these two giants canon and nikon, both are equally good.its totally your choice.Nikon d3300 seems good to me and I'm great with this.Also its not the gear only but also the photographer who takes the shot,so Believe in yourself...Image quality is great..built quality is great, feels compact in hand, smaller and compact as compare to others in range..600d seems bulky in hand..kit lens is indeed good and can serve nearly all purposes and its the best if you're just starting with photography, although for best quality, opt for dedicated lenses.like prime for portraits, telephoto for wildlife etc..lacks OLPS-Optical Low Pass Filter, which I thought as a disadvantage but it turns out as an advantage as it improves image quality, sharpness.professional level dslr have this feature..battery life is near 700 shots per charge with normal shooting..ISO is pretty high, better low light image quality..speed, performance, features are good..in camera editing and raw processor is great, easy to use functions..modes are good and there is guide mode for super easy shooting, but manual mode is the key to outstanding shots, if mastered..lacks articulating screen and WIFI and stereo sound recording for better sound quality..although best entry level dslr..A must buyand for best quality shoot in RAW..", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Happy about the product", 
            "review_posted_date": "7 March 2017", 
            "review_text": "Delivered within the specified time limit..  Happy about the product..", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "chetan jadhav", 
            "review_header": "One Star", 
            "review_posted_date": "14 August 2016", 
            "review_text": "Delivery was prompt on the same day butReceived a different lens then mentioned", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Duplicate charger", 
            "review_posted_date": "3 January 2017", 
            "review_text": "Battery charged only once dont buy online", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Dheeraj", 
            "review_header": "This camera is amazing.", 
            "review_posted_date": "1 December 2014", 
            "review_text": "D3300 takes beautiful images. I just can't seem to take my hands off it. Now it might be because its pretty new to me, but the images it takes are really beautiful. I would suggest for the person who's buying it, that the kit lens is really good. You would definitely want to buy a 35mm f/1.8 lens(Since its a DX camera its better to go for 35 instead of 50mm) for the Bokeh effect to take great images of objects up close or portraits because the kit lens is not really great at producing bokeh because of the aperture limitations. Bokeh is the effect which makes the background appear blurred out. As an Indian, and if you're someone who's bought an entry level DSLR like this one, definitely go for the other lens for the portraits it will make a huge difference in the photographs you'll take.What the kit lens will do for you, however, is take great images. Honestly 18-55 is rock solid stuff. This lens is really really good and its a steal if you go for the kit lens+body.The video quality is through the roof. For the price I've paid I'm really really satisfied with my camera.Good luck shooting!PS: I'm tagging some photos that I personally took in the last 2 days after I received this camera. These are all in JPEG format.This is the absolute best camera in this price range. Don't think twice about this, just go for it. :)", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Saunak", 
            "review_header": "bought from store at kolkata at 23500 with bag neck ...", 
            "review_posted_date": "9 March 2017", 
            "review_text": "bought from store at kolkata at 23500 with bag neck strap battery charger wifi 16gb card. just awsme camera", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "milin", 
            "review_header": "I received the order but as I can see in ...", 
            "review_posted_date": "18 November 2015", 
            "review_text": "I received the order but as I can see in image it showing tripod free with this product but I didn't get it.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Five Stars", 
            "review_posted_date": "28 March 2017", 
            "review_text": "nice camera one of the great creation for nikon", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Manu Sharma", 
            "review_header": "Excellent choice for DSLR.. Great deal", 
            "review_posted_date": "19 October 2015", 
            "review_text": "First time in DSLR photography and a hobby that I wish to develop. Had a choice with canon, went with Nikon and no regrets. Amazing camera, got 2 lenses 18-55 and 55-200. Great shots and easy to handle. I am running it in manual mode and loving every moment of it .ontime delivery and great package", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "siddhartha", 
            "review_header": "... got my camera today and packing and all were great. I would have rated it a 5 on ...", 
            "review_posted_date": "22 January 2015", 
            "review_text": "for the bundle 3/5got my camera today and packing and all were great. I would have rated it a 5 on 5 except for some issues-1) when i had ordered the camera it was listed at 28400 or thereabouts. I got the product for 28990. since I have been waiting quite sometime, and the price currently is this, i had no choice but to buy.This means the price you see on ordering may not remain the same as the price you get in delivery which is rather strange.2) the kit clearly says 8 gb card included. the box and all were completely sealed ( i checked them myself) but the memory card is just not there.any help will be sincerely appreciated.for the camera 5/5 (i could give a 6/5 :P)the best camera you could buy for the money. definitely better than the d5200. apart from the extra 1 point dynamic range, it is the same thing as far as sensor and all go. plus you get all the advanced features of the d5200 the most time saving one being the automatic distortion control. just download the latest firmware and it will take in any lens you could possibly put on it.advise is add a uvc filter and invest in a lens hood.the automatic hdr on 5200 is crap. if you really are into HDR photography you will have to take multiple shots and merge them on your computer to get proper effects.same goes for landscape (which the d3300 has and d5200 does not).plus the 3300 takes 700 plus hots compared to the 5200 which takes 500 odd shots (and yes i have used both).if you cant afford a leica, or if you are cagey about buying the fuji x, this is the smallest, lightest camera with no oplf filter (sharper images) that you can buy India for under 30000 for street photography. Pair it up with a 35mm 1.8 nikon for more light control. 5fps shooting is more than enough unless you are doing very serious sports photography.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "ABDUL RAHEEM MELETHIL", 
            "review_header": "Would like to sell", 
            "review_posted_date": "14 February 2017", 
            "review_text": "i would like to sell mine..who needs?", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "SUMIT BISWAS", 
            "review_header": "No built-in AF motor so can't auto-focus with non AF-S lenses", 
            "review_posted_date": "6 December 2016", 
            "review_text": "The D3200's most exciting new feature is clearly the new 24-megapixel image sensor, which is partly responsible for the camera's strong improvement in sharpness over the D3100. Sadly, when it comes to image quality, the excitement ends there.pros :CompactGood quality at high ISOsGuide Mode for beginnersContinuous video autofocusMic inputEasy to usePerforms well and delivers great imagescons :Small pentamirror viewfinderFixed LCDKit lens could be betterPerhaps 24 megapixels might be overkill for entry-level usersNo auto exposure bracketing or optical depth-of-field previewComplicated menu systemUnderused command dialNo built-in AF motor so can't auto-focus with non AF-S lensesNo live histogramSlight blue cast on LCD display in some lighting conditionsRelatively high price", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Ajay M", 
            "review_header": "Charger Stopped working after 2 months. It is not covered under warranty and Amazon is not able to help.", 
            "review_posted_date": "29 September 2014", 
            "review_text": "Delivery was prompt and product is also awesome. But after 2 months the charger stopped working and when I contacted Nikon India support they said charger is not covered under warranty for online purchases. So I contacted Amazon and they asked me to order a new one from amazon, for which the amount will be refunded, if the order is amazon fulfilled. But I couldn't find any seller for the charger which is amazon fulfilled. So I contacted Amazon again and they said they can give 2000 rupees refund, but that will break my EMI. Also the product was costing around 2800 rupees and in that case I will have to shell out 800 rupees from my pocket. So the last option was to return the entire product, but I was not interested in that option as I was travelling the very next day and wanted to use the Camera. Finally Amazon said they are helpless and can't do anything in this case. I am feeling very bad about my purchase from Amazon now.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "We received  stone in place of camara. Big fraud", 
            "review_posted_date": "1 May 2016", 
            "review_text": "We received  stone in place of camara. Big fraud", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Pramma", 
            "review_header": "Nice cam delivered properly. Thanks Nikon&Amazon", 
            "review_posted_date": "19 September 2015", 
            "review_text": "First about amazon experience,Got my 1st DSLR delivered in 4 days after ordering on 8th Aug. Packing was good. And the product was fresh and neat. All the items listed were inside the box. I ordered it from Cloudtail. I was able to register camera and the lens in Nikon website. Warranty card was available in the box without seller stamp. I did not verify from Nikon Service center though reg warranty.About the cam,This is my first DSLR, and i think i did the right thing choosing this 3300.Latest model, good mega pixel (24mp), Good low light performance (less noise), high dynamic range (darker and brighter in same image), great video quality, decent battery. Simply no regrets. I referred many youtube training videos and pdf about photography. I really could not stop using the cam almost every second day just to try out every technique out there, and its really fun throughout. D3300 simply shines in every department.I too checked and very confused between Canon and Nikon.I referred snapsort.com to compare and choose D3300 over 1200D, 600D, 700D. Nothing seems to come in the way of D3300 other than D5200.Between Canon and Nikon, clear difference is builtin auto focus motor in canon which makes lens price cheaper compare to 3300.If one asks me, i would say choose the brand which you would want to permanently get associated to. Cause neither way you are going to miss anything. Generally when upgrading one would stick to same brand. Nikon has everything Canon has with respect to family of lenses/cameras and vice versa. If your 1st DSLR may not be your last go for wither canon or nikon. If it is ur last, then close your eyes and go for D3300.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Santosh Panda", 
            "review_header": "Worth your bucks! Best in the business...", 
            "review_posted_date": "31 August 2016", 
            "review_text": "Before noting down my review let me tell you one thing, My review on this Product is written considering the fact that I had a budget of Rs.30,000 for buying a DSLR.I always had a passion for photography. I like to click pictures, be it of Birds or Peoples. So finally when I put some of my month savings to buy a DSLR, I searched various online sites reading the reviews of several DSLR. And finally I decided to buy the NIKON D3300. And trust me, right now, after using the camera for around 4 months, I proudly announce that I'm happy with my decision. There are other company's camera available in the market but within a range of 30000 you can't get a better camera than NIKON D3300.With excellent features, this camera is worth your buck. I'm using a 18-55mm lens (bought with the camera) and the pictures I click are awesome. I entered the world of Digital Images with the help of this Camera. Meanwhile my passion turned into professionalism and nowadays I click pictures at various wedding events. That makes me earn some money too. Now it's time to buy an upgraded lens. So I'm ending my review here and going to check the Amazon site for lenses.P.S. I'm sharing some of my clicks so that you can know the quality of the camera.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Rohan", 
            "review_header": "Amazing product, worth every penny.", 
            "review_posted_date": "16 March 2017", 
            "review_text": "Amazing Digital SLR Camera at affordable price.Worth every penny.Did little bit research and finally end up buying nikon D3300.Using this camera for more than 4 months with amazing outcome. Do one thing after buying this product purchase prime lense (If you re into photography) as kit lense is amazing but not good in low light photography and not sharp enough. Best luck...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Niyazahamad", 
            "review_header": "Very good camera", 
            "review_posted_date": "5 August 2016", 
            "review_text": "Good camera problem is lens 18~55mm....dealer r supplying VR LENS .....SO I REPLACED ONE .....IT COME WITH NEW LENS OF VR II 18~55 THIS LENS IS VERY GOOD COMPACT ....", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Krishnan", 
            "review_header": "NIKON KING OF DSLR", 
            "review_posted_date": "22 October 2015", 
            "review_text": "It does cover nikon 2 yr warranty, confirmed with Nikon support team.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Jasmin Dedania", 
            "review_header": "Exiting Camera With Exiting Offer....ThankYou Amazon ..!!", 
            "review_posted_date": "29 September 2014", 
            "review_text": "One of the best Camera.... Best entry level DSLR i used it for around a week and clicked some 100+ photos in all modes an was way better than Canon 1200D resolution is at its peak. Battery is awesome can click up to 650+ photos. The best thing of this offer is it gives combo lense, I particularly love to use 55-200 mm lense. it comes with shoulder strap and also an (made in Gujarat) Leather carry bag which can carry both lenses.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "chinmay", 
            "review_header": "Go For Nikon D5300 body only over D3300.", 
            "review_posted_date": "27 February 2015", 
            "review_text": "This item is very well packed by amazon shipping. overall item appears new and in sealed pack. But after checking in detail I found some grease /oil/ dust on Lens mirror, that also appears on viewfinder. As a newbie i didn't take any risk to clean it by myself. And this also something I was not expecting from a NEW Camera. So 4/5 star.Took some test images and videos, which came out good. After playing with for a week, here are the things would like to recommend to new buyers to considerRecommendation :18-55mm lens kit is something you need to upgrade instantly (you will notice its limitation just in a week after taking some shots). Must have 50mm prime lens and 18-104mm lens (under 20K budget).Also upgrade to 32GB Class10 SD card. For any HD /RAW files 8GB is very limited. For 8GB you can take max 260 RAW only Images or 30-40 min Video @ 1080 60FPS.Also have Nikon Remote Shutter , which you can get under 200 bucks. Not necessary to go for Branded one.Go for D5300 over D3300 Why?I found that D5300 support HDR and Timer (Time-laps settings) and it has 39 focus pt. All these 3 features really matters to explore some more creativity. Also Fold-able LCD does helps at many case, mostly When you are Recording Videos.Adobe Lightroom 5 supports Nikon DSLR tethering only upto D5XXX series. It doesn't support for D3XXX series. Which is important, because I am more into Product Photography. So Live view helps a lot to get better images, also save time for post processing work.Wifi n GPS does sounds good, but remember theses two are also power hungry. But it also give you some additional feature to control with your Smartphone. If you are a traveler-blogger, Wifi-GPS can give you good experience.So spending on a D5300 body only with 15000 bucks can give you more reliable DSLR camera, that you can use for 2-3 years. I am going to upgrade to D5300 or D5500 in next 2-3 months, So I could have easily save 30 grand , if some mention theses things earlier.-Chinmay", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Aswin", 
            "review_header": "Nikon d3300 - a happy customer", 
            "review_posted_date": "1 January 2015", 
            "review_text": "Product reached as promised in well packed condition. I am new to dslr camera's but the nikon is light, compact and gives very happy picture quality for a casual photographer like me. The user interface is a bit of a let down when it comes to simplicity and ease of use vut you will get used to it and hence not a big issue.Overall very happy with the product and thr service offered by the seller and amazon.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "rahul", 
            "review_header": "Best entry level dslr", 
            "review_posted_date": "2 October 2016", 
            "review_text": "Very good dslr.. now it's come with advanced Af p lens instead of Af s lens which was bulky. So don get confused when u get the camera it's not packaging fault it's just a new lens. Nothing to review much, go to YouTube and learn the tricksPeople who r in to dslr for first time like me remember the problem behind a bad pic while u start using the cam is not lens or dslr , it's you :)", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Kuldip gond", 
            "review_header": "amazing", 
            "review_posted_date": "2 April 2015", 
            "review_text": "Amazing feature. User friendly to beginnerAs well picture quality is very good with 18-55 lens. But not satisfied with battery backup.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Denny", 
            "review_header": "however I am satisfied with the delivery", 
            "review_posted_date": "2 November 2014", 
            "review_text": "I am kind of new to DSLR so too early to comment, however I am satisfied with the delivery. The package arrives on time and without issues with all accessories intact.One particular thing I noted with flash is the photos appear dark even with flash in a low light environment. My mobile camera flash seems  much better. However I believe there could be some settings to pump up the camera flash light.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Aikam", 
            "review_header": "Newbie's Delight", 
            "review_posted_date": "11 August 2015", 
            "review_text": "Great Camera with Amazing Features. Pictures are crisp and focus is amazingly quick. New users would have a great time using this DSLR, but users who into precision and perfection should look for D5300 as this one only has single cross point focus.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "SWAPNIL BORAH", 
            "review_header": "Best entry level DSLR", 
            "review_posted_date": "9 January 2015", 
            "review_text": "After comparing many DSLRs of canon and nikon I bought this. I was trying to buy nikon D5200 but when I came know about this I have selected it and happy with my decision. This is one of the best entry level DSLR at present as many reviewer says. Compact and light and bundled kit lens has VR2 and no low pass filter which results good sharp images.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Crazy fellow", 
            "review_header": "It's a best buy in this range", 
            "review_posted_date": "29 August 2015", 
            "review_text": "It's a best buy in this range. image quality, battery back-up, easy to handle. 18-55mm lens works fine if you are just a normal user. I would say go for this even if this is your first DSLR. It's a best one and you can learn more.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Shashank Bhute", 
            "review_header": "Camera is too good and simple to use as of now", 
            "review_posted_date": "6 August 2015", 
            "review_text": "Superb delivery from Amazon.in on time.Camera is too good and simple to use as of now. I'm learning it currently and will update about it more soon.But surely a must go for one's who wanna own DSLR at this range.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "SrikanthP", 
            "review_header": "Good Camera but its a culture shock for someone migrating from point and shoot camera :-)", 
            "review_posted_date": "9 October 2015", 
            "review_text": "I just upgraded myself to DSLR category and still trying to figure out the Camera. I was using a point and shoot Camera ( Canon PowerShot SX20 IS) for few years and mostly using the Auto and pre-built shooting modes and never tried manual mode/settings. I felt the my old camera is not great when it comes to low-light photography and was looking to upgrade my photography skills along with a decent entry level DSLR Camera. My first impression on Nikon D3300 ( again I am not a professional), it has lot of manual keys/buttons, settings which are mostly mechanical. especially the multi-selector wheel is so manual. definitely there is a lot of room of automation. Otherwise, this Camera looks like power packed and has many functions and shootings modes. I was hesitant to but D5200 but definitely the flip-out screen is great feature. eg. when taking pictures on D3300, my nose keep touching the LiveView screen leaving lot of smudges. With flip-out screen it would be very easy......Anyways, I am yet to explore this camera fully and hopefully my next experience is going to be a lot better.", 
            "review_rating": "3.0 "
        }, 
        {
            "review_author": "Krishnan", 
            "review_header": "NIKON KING OF DSLR", 
            "review_posted_date": "22 October 2015", 
            "review_text": "It does cover nikon 2 yr warranty, confirmed with Nikon support team.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "abhinandan sankolli", 
            "review_header": "Pleasently Surprised", 
            "review_posted_date": "8 April 2015", 
            "review_text": "Delivered the items before time. All the items were packed very professionally ensuring no damage to the products. Currently exploring the Camera and its accessories. So far happy with the camera. Will post a detailed review after couple of weeks of trying it out", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "siddhartha", 
            "review_header": "Best for this price range. But poor colour reproduction", 
            "review_posted_date": "9 August 2015", 
            "review_text": "Its a very good camera for this price range.But the colour reproduction is poor which i am managing with editing.If money is a constraint just go for it.  Or else i would suggest high end cameras.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "ADDAL K", 
            "review_header": "Very good camera for 33000", 
            "review_posted_date": "21 November 2014", 
            "review_text": "Very good camera for 33000. Nikon must add Image stabilization, HDR and High speed video. Now a days all the compacts are having these facilities.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "himanshu", 
            "review_header": "Close eyes and go for it", 
            "review_posted_date": "22 October 2015", 
            "review_text": "The seller is reliable and comes with the amazon protection. Its an Indian product with the Indian warranty card. The packaging is good and I rate them the best.I am a beginner for DSLR but I must admit the quality is awesome and you will love using this camera", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Utkarsh Gautam", 
            "review_header": "Total Satisfaction", 
            "review_posted_date": "11 August 2015", 
            "review_text": "Undoubtedly this is the best camera in Entry-Level DSLRs. First of all thanks to NIKON for providing excellent image quality and noise reduction, one can obtain absolutely noise free images even at 1600 ISO (1385 being the exact value). Its light weight and small body makes it easy to carry on longer trips and the Battery life of 700 shots serves as an extra perk.Secondly Thanks to AMAZON for providing this camera at an amazing price of 26,400 and Super fast 1 Day delivery. The product was properly packed and also consisted of a good quality DSLR bag and a 8GB card along with the camera package.5stars to the combo.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Pushkar Bharadwaj", 
            "review_header": "Fastest Delivery, Reliable Site, Best Rate", 
            "review_posted_date": "30 December 2014", 
            "review_text": "Camera is superb it meet my expectation, superb quality, and fastest delivery from Amazon.Product was well packed, everything was properjust wanted to know where I have to stamp gaurantee card and register my product.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "vysakh aerpalathinkal subramanyan", 
            "review_header": "Four Stars", 
            "review_posted_date": "16 December 2015", 
            "review_text": "One of my best purchase ..", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Prashant Lokhande", 
            "review_header": "Just go for it :) You wont regret!", 
            "review_posted_date": "10 December 2014", 
            "review_text": "I got this one during Diwali Sale for 26.5K Rs, it was a steal deal :)Though I have just started learning photography and handling DSLR, this camera is fantastic. Anyone looking for D5300 but having tight budget can definitely go for this!Got Camera, kit lense18-55mm, battery charger, 8GB san disk card, Nikon camera bag along with warranty cards.Registered the Camera and lens for warranty on NIKON India site.Adding some snaps taken with this Camera :)Happy Clicking!", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "One Star", 
            "review_posted_date": "26 November 2016", 
            "review_text": "Received AF-S lens instead of AF-P and 8 gb sd card instead of 16gb.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Nitin", 
            "review_header": "All Research and confusions end here !! Safe and Authentic buying experience from Amazon|| Love It || Detailed Review after Use.", 
            "review_posted_date": "18 May 2015", 
            "review_text": "All my first dslr research ends here.Guys before buying this cam ,I searched a lot so this review can save a lot of your time and confusions.First thing,for all those who are scared of buying slr online: Yes,your fear is right but not with trusted sellers on Amazon.Nikon clearly says they will not cover warranty for products sold online from some E-commerce sites ,even i got scared but I did complete research on this.I got this camera from a seller CloudTail . Guys if you google you will find he is the biggest seller on Amazon India or you can say amazon India mostly belongs to him.2.Then i carefully checked amazon policies regarding returns.They even pay the money back in case of faulty products where orders are Amazon fulfilled so toattly relax there.3.I checked this cam from Nikon office in Gurgaon.They confirmed he is their authorized seller and the product is totally genuine and also I was able to register it on Nikon.Guys please beware that registration does not mean covered in warranty.Please keep the warranty cards and bill with you to seek warranty if required.Now yes review of the camera: Those who are confused between NikonD3200 or Nikon D5100.Just dont go for D5100 now.Its an oldie now (older processor,slow speed) ,if you say tilt screen,I must say if you think this an advantage ,please dont buy an slr go for point and shoot.If you really like to do photography ,tilt screen is no use at all.You may go for Nikon D3200 is you have a price constraint as most of the features are similar.I have used bot and also talked to nikon expert he simply asked me to go for Nikon D3300 because its the latest one ,has a new processor ,has better image quality.and trust me guys its true.This cam feels a mid level slr.is fast ,superb image quality,Kit lens is good but I would recommed a 35mm prime coz its awsm.I wish you best of luck and happy Buying from Amazon.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Navaneethakumar s", 
            "review_header": "Go for it", 
            "review_posted_date": "2 December 2015", 
            "review_text": "Good basic DSLR , you can able to shoot stunning pictures also.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Sergio", 
            "review_header": "An Awesome Buy..... Small Light and Simple", 
            "review_posted_date": "23 October 2015", 
            "review_text": "I am new to the complex world of photography but the D3300 is a great product and value for money with what it delivers. The manual mode can be stressful at first but once you understand how each aspect affects a picture in the environment it is in fact a pleasure to play with and get that perfect image.The controls are easy to use and a little practice will help you get the hang of it since its not overly complicated.overall its a small and neat camera that fits snugly in your hands, and a great camera waiting to see what you can make of all it has to offer.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Anudeep", 
            "review_header": "Five Stars", 
            "review_posted_date": "17 March 2015", 
            "review_text": "Definetly worth the money. Compared with Sony and Canon, Nikon is awesome. I have never been in photography. But I managed to take some beautiful pics with this camera.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Bhanu Prasad", 
            "review_header": "Great Product at descent Price to purchase from Amazon.", 
            "review_posted_date": "9 November 2014", 
            "review_text": "Good Product and definitely it is a great purchase with a good deal from amazon.Product arrived on specified day with all its contents neatly packed.I am able to click great photos.As an entry level DSLR most valuable purchase,", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Kuldip gond", 
            "review_header": "amazing", 
            "review_posted_date": "2 April 2015", 
            "review_text": "Amazing feature. User friendly to beginnerAs well picture quality is very good with 18-55 lens. But not satisfied with battery backup.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "sandyzze", 
            "review_header": "Awesome Camera, Confirmed the warranty from Nikon India too..", 
            "review_posted_date": "30 November 2014", 
            "review_text": "I just LOVE the camera. Waited for a long time to get myself a DSLR. Totally worth it!!I got a great deal with this camera and got it delivered in a day and no stopping the photography ever since..", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Chirag Rabhadiya", 
            "review_header": "Good Deal.", 
            "review_posted_date": "22 May 2015", 
            "review_text": "First Part :  Package and deliver,I trust and buy only from Amazon & Flipkart, and for this purchase amazon has lived upto the expectation just like my previous purchases,The packing is just superb, and delivery is on time (or before time, as they keep some buffer time for you to be surprised or feel happy that it deliver earlier then told, but i like it anyway)Price & Discounts :The Price that amazon has offered (even without discount) is just amazing, before buying i tried some local shops here and they were no way close to amazon price, so it was very firm that i am again going to buy from amazon. Just wait for their sale and discount days and surely you will get best deal (i got mine)Product :I did lot of research before buying my first DSLR, even as a beginner in photography i thought bit about future and was concerned that after couple of years (after my skills are improved) i should not feel that my gear has limitations and feel to buy another DSLR, seriously i can't afford that. so i wanted to buy just one camera that works for longer time for me. initially i thought to go for Nikon D7000 as it was semi-pro and expect to work for longer time but after talking to few friends and reading lot many articles on internet i decided to go for this one, the reason is simple, invest more in lens then body, because at the end its lens that makes much of difference then body. all beginner and semi pro DSLRs has cropped sensor, so no matter which one you buy its anyway going to be cropped one.Usage :I used it for couple of weeks now and pictures are satisfactory (at-least for kit lens) i am still to buy new lenses and hope to improve in results, but my quest for getting best shots are not limited by kit lens, its good lens and i am happy with it. the camera is good, low in weight good to handle the functions are just rightly placed (read the user's manual first) so it makes it a perfect camera for shooting,Cons : before purchase i forgot to check that this camera does not have inbuilt Auto Focus motor,the advantage of having auto focus motor is that you can buy lens that does not have auto focus (lens with autofocus starts with AF-S) the lens without auto focus motor are cheaper then with auto focus, so i was bit disappointed but i think when you are buying budget gadgets you need to understand & live with its limitations.overall its good (till date). let's see what happens in future...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "this would be a great camera to learn", 
            "review_posted_date": "1 August 2016", 
            "review_text": "For a beginner , this would be a great camera to learn. It provides you all that you need to learn photography. I quite liked it.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Puneet Pareek", 
            "review_header": "Value for money camera", 
            "review_posted_date": "11 July 2014", 
            "review_text": "After research of options from Canon and Nikon I decided on this SLR as a real value for money. Found the cheapest deal for this camera on the Amazon. Other options considered were Canon EOS 1200 and Nikon D 5200.It has all the features you would need, 16 focal points are enough, don't need too many, LCD does not tilt but I am fine with that, how much do you need it? It has no wifi or GPS but no big deal again. It has lots of functions and gives you a versatile SLR for a reasonable price. The basic kit lens came at a bargain price. You can add a lens or two as you start using the camera. I added 1.8 mm nikon prime lens to begin with for low light performance. If you want a lens for wildlife with a great zoom then 60-300 mm VR lens from nikon is great though slightly expensive at about 26000/- .  Finally, it's the person behind the camera who makes the difference and this camera will not be wanting in features and options to achieve great shots.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "kushagra", 
            "review_header": "NIKON D3300 DSLR - Good price On time Delivery Good packaging No contact information ...", 
            "review_posted_date": "28 October 2014", 
            "review_text": "NIKON D3300 DSLR -Good priceOn time DeliveryGood packagingNo contact information of seller (No respond to mails)Not good free carry bagOverall i like it!!", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "TENZIN CHONJOR", 
            "review_header": "Amazing and compact DSLR", 
            "review_posted_date": "12 August 2014", 
            "review_text": "After much research I've finally chose to buy Nikon D3300 DSLR camera over many similar DSLR, Amazon.in delivered this on right time (2days delivery), package was intact with all its accessories and 2years warranty card. D3300 was much smaller and compact if compared to other DSLR, kit lens is enough if you are taking rudimentary photographs, high quality pictures makes this camera a perfect DSLR", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Mathur Sathya J", 
            "review_header": "Cost effective", 
            "review_posted_date": "2 September 2014", 
            "review_text": "I guess this does justice to its price. I dont think any other camera in this price gives such a performance. Excpet for screenloading time, everything is superb. And its very light and so convenient for travel.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Abhishek Saxena", 
            "review_header": "An excellent camera with very good picture quality", 
            "review_posted_date": "25 September 2014", 
            "review_text": "An excellent camera with very good picture quality.  Only thing lacking is the requirement of a single lens with 18-120 or 105mm because of which we need to carry two lens to take close and far pictures.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "GARVIT GARG", 
            "review_header": "For a beginner this is probably the best one to invest for", 
            "review_posted_date": "11 September 2016", 
            "review_text": "For a beginner this is probably the best one to invest for, the best part is nikon is providing the tutorials dvd with which you can enhance your skills for using this camera & can come out of auto mode.The only draw back is to take picture during dark with amature hands, which somehow will shake & make the picture blur.One can resolve this by using tripod.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Saunak", 
            "review_header": "bought from store at kolkata at 23500 with bag neck ...", 
            "review_posted_date": "9 March 2017", 
            "review_text": "bought from store at kolkata at 23500 with bag neck strap battery charger wifi 16gb card. just awsme camera", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Apurba Dutta", 
            "review_header": "Great camera", 
            "review_posted_date": "20 May 2014", 
            "review_text": "Lightweight, even with the kit lens, it weighed much less than my Nikon P&S.Kit lens is ok, not quite up to the mark. But it is kit lens, right?Great many options while clicking, so it is best to avoid Auto mode.To get the best out of this camera, prime lens/ telephoto lens is a must.Amazon same delivery option was superb, the packaging was top class.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "KESHAW K. SINHA", 
            "review_header": "buy Nikon D3300 and it will not disappoint you", 
            "review_posted_date": "4 December 2014", 
            "review_text": "I wanted a DSLR. I talked too many friends who knew photography for decades. They suggested that if you are looking for long term investment buy canon (lenses are cheaper/value for money) and other wise whatever you buy does not matter until you know how to click. Canon v/s Nikon is all about which camera model you are buying. There are some good models released by Canon and same by Nikon too for beginners (entry level)/mid level/professional. Now question is that which camera you want to buy?I wanted an entry level DSLR.....and after many research i bought Canon 1200D with 18-55 and 55-250 Lens Kit at the 21000 i clicked it for a day. result were depressing. Thanks to amazon,in, i returned it and again bought Nikon D3300@26249 with 18-55 kit. and it is much better and and more than that what i wanted in my Camera. the only things which lacking is the  \"tilt screen\" which gives flexibility.Well friends..if you will read reviews you will find that many people compare it with less auto focus points, censor size, brackets, sensitivity, ISO noise, wi fi,  etc. But i tell you one thing that its not the function which makes things look good it is your inside artist. angles, sides, positions, background, morning/evening session, lighting.I am still learning my Nikon D3300 and it is producing best images same what i wanted. Now I am planning to buy Nikon 50 mm 1.8 lens.So friends in simple words buy Nikon D3300 and it will not disappoint you.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "vysakh aerpalathinkal subramanyan", 
            "review_header": "Four Stars", 
            "review_posted_date": "16 December 2015", 
            "review_text": "One of my best purchase ..", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "varada", 
            "review_header": "Awesome but need 55_250 lens", 
            "review_posted_date": "22 October 2016", 
            "review_text": "Nice camera. The pics qulity is awesome. But only back drop is it comes with one lens i.e 18-55 lens. You can't zoom in too much.if you want to be professional photographer go for 55-250 lens. And the dealer delivered it in three days. Buy it at deddfoler.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Gaurav Bhatnagar", 
            "review_header": "Great Camera!", 
            "review_posted_date": "18 November 2014", 
            "review_text": "This is a great camera. Crisp and sharp pictures.I got it for about 7K discount from Amazon but was very disheartened upon switching the camera On. It didn't turn on. Tried  multiple times but it didn't work. Charged the battery and everything. Returned it next day.Bought it for 30K from a Nikon india local shop. Checked it and then took it. Worked like a charm. It maybe one of those exceptional case for me when it didn't work. But it definitely has left a bad taste in my mouth.I couldn't believe that the product was delivered the next day to me. Amazing.When i ordered a refund, he picked up next day, No questions asked ( i filled the reason online while requesting the return though). That maybe because i live in NCR.Amazon's service is great!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "shailendram", 
            "review_header": "Good value DSLR", 
            "review_posted_date": "4 January 2016", 
            "review_text": "I have used the camera for over six weeks now. The two lenses purchased with the camera 18-55 and 55-200 are good enough for me to start with learning the DSLR, but would advise others to explore 55-300 04 70-300 NIKKOR and skip 55-200. Ideally you should buy camera tripod because no sooner you start using the camera enthusiastically you feel like shooting night/ evening photos which require long exposure and stable positioning for 1 few seconds. I could register the camera on NIKON site as well. Additionally it comes with Amazon backing. Overall a great camera for enthusiasts.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Rupak Basak", 
            "review_header": "New Nikon D3300", 
            "review_posted_date": "31 July 2014", 
            "review_text": "Received the camera as per the promised time. 2 Year Nikon India warranty was promised during the sell. Only thing missing is the dealer stamp in the Nikon India warranty paper. Do not know if this will create any warranty issue in future.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "rohan haldiya", 
            "review_header": "One of Nikon’s smallest DSLR cameras carries a great price point", 
            "review_posted_date": "27 August 2016", 
            "review_text": "What We LikedMinimal noise in low light images24 megapixels of resolution works well in APS-C sized image sensorCamera provides fast performance in viewfinder modeOne of Nikon’s smallest DSLR cameras carries a great price pointWorks equally well in fully automatic mode or manual control modeWhat We Didn’tMissing touch capability on LCD screen, which would be great for beginnersNo WiFi connection optionCamera’s popup flash must be opened manuallyLive View mode causes camera to work sluggishlyOnly 11-point autofocus systemNIKON D3300 DSLR KEY SPECSImage Sensor Type Full FrameMegapixels 50.6Optical Zoom Lens NA, uses EF mount interchangeable lensesLCD Touch Screen red-x-iconViewfinder green-check-markHD Video green-check-markISO 100-12800Avg Battery Life 700 photosWeight 29.8 oz (body only)Size 5.98 x 4.58 x 3.01 inchesBuy NowDESIGN AND BUILDNikon D3300 DSLR cameraThe Nikon D3300 is a smaller than average DSLR camera, but it still creates great looking images.The Nikon D3300 has each of the manual control features you’d expect to find in a DSLR camera, including Manual mode, Aperture Priority, or Shutter Priority, all on a mode dial. But for those new to DSLR photography, Nikon did a great job of including automatic, easy to use features with this camera too.One feature aimed at those new to DSLR photography is the Nikon D3300’s Guide mode. The Guide explains the camera’s features on the screen as you activate them, and it even can help you make changes to the D3300’s settings when you want to perform certain tasks. This type of on-screen help mode simply isn’t found on advanced cameras or other DSLR cameras, which makes the D3300 a great camera for inexperienced photographers, either those new to digital photography or those new to DSLR photography.As with most DSLR cameras, you can shoot in two modes with the D3300 — Live View and viewfinder modes. This Nikon model works fast when you’re in viewfinder mode, providing minimal shutter lag and shot to shot delays. But if you switch to Live View mode, where you frame the scene using the LCD screen like you would with one of the best point and shoot cameras, the shutter lag can be 1 second or more. Be prepared to be ticked off occasionally over this camera’s sluggishness in Live View mode when you miss a photo because of shutter lag or long shot to shot delays.The D3300 also only offers an 11-point autofocus system, which ranks behind most other DSLR cameras and explains some of this camera’s slow performance in Live View mode.When considering DSLR cameras, be sure to look at the Nikon D3300 against a Nikon D5300, where you’ll find the D5300 has a higher price point by almost $200. And the Nikon D3300 vs. D5300 comparison also shows that the D5300 has some desirable features, including a tiltable LCD screen and built-in WiFi. One way Nikon keeps the D3300 DSLR at a lower price point is by not offering those features.IMAGE QUALITYNikon designed the D3300 DSLR around an APS-C image sensor with 24.2 megapixels of resolution, which results in very good image quality. The D3300’s image quality surpasses most of the models you’ll find in this price range.Another feature of this model that leads to great image quality is that Nikon removed the anti-aliasing filter from the image sensor. Although you run the risk of seeing a moire pattern without an anti-aliasing filter, this is a rare problem with modern image sensors. So manufacturers are removing this filter more often to allow for sharper images, and it works well with the D3300.When comparing the D3300 to a Nikon D5500 review, you’ll see both cameras have almost an identical image sensor, both in terms of physical size and in the number of megapixels of resolution, allowing the image quality of the two cameras to remain somewhat similar. But the D5500’s price point is nearly double that of the D3300, because it contains a host of extra features, such as a touchscreen LCD and a tilting LCD.LOW LIGHT PERFORMANCE AND MOVIE MODENikon D3300 DSLR reviewPlenty of control buttons allow you to easily make changes to the D3300’s settings.Against comparable cameras, the Nikon D3300 DSLR works very well in low light photography situations. Incorrect pixels (called noise) are minimal in dark scenes, whether you choose to use the D3300’s popup flash unit or to increase the ISO setting close to the camera’s maximum native setting of 12800. (An extended ISO setting of 25600 is available too, but it does provide quite a bit of noise.) You also can add an external flash to the camera’s hot shoe.With full-time autofocus, the D3300’s movie recording capabilities are stronger than other entry-level DSLRs. You’ll have access to full HD recording with the Nikon D3300 at up to 60 frames per second, which is above average performance against similarly priced models.BATTERY LIFEBattery life is one area where the D3300 easily wins a Nikon D3300 vs. Canon T5i comparison. Nikon estimates that the D3300 can record up to 700 photos per battery charge, whereas the T5i is rated for up to 440 shots per charge.Keep in mind that those battery life estimates are primarily for using these DSLR cameras in viewfinder mode and not Live View mode. Testing shows that using Live View mode causes the battery life to be about half for the D3300 of what you’ll receive by using the camera primarily in viewfinder mode.WRAP UPDSLR cameras can be expensive, especially when you add in the costs of extra gear beyond the camera body, such as lenses and flash units. So if you need a versatile DSLR camera at a low price point, the Nikon D3300 DSLR is a great option. It provides 24.2 megapixels of resolution and very good image quality, which is great to find in a DSLR camera under $500. When matching this model against its predecessor, the Nikon D3300 vs. D3200 comparison shows the D3300 has longer battery life and better low light image quality, both of which are desirable features. The D3300 has a good form factor and a slightly lighter camera body than the D3200 too, meaning those who own the older camera may find that an upgrade to the D3300 — which made our best DSLR cameras list — is a smart idea.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "The Shinigami", 
            "review_header": "Entry level camera with great value for money", 
            "review_posted_date": "1 July 2016", 
            "review_text": "I have done quite a bit of research. The value for money for entry level cams (nikon and cannon) are 200% (200 value for 100 bucks). The sensor used in this cam is a crop 24MP sensor which is the same as any mid level Nikon DSLR. The only place where it loses out is the fine tuning which the costlier variants possess. Interesting fact is the kit lens that comes with the cam doesn't even fully utilize the camera sensor to it's maximum abilities. You need to buy a costlier lens to fully appreciate the sensor capabilities.In total, I'd say the sensor is excellent. Although you migh lag in other fancy features that not that important if your new to photography.If your new to photography, I'd suggest you to read lots of articles by searching different tags and have a good understanding about the kinds of camera that are available and what suits you the best. See a lot of youtube videos as well.Don't just blindly invest money into something that you don't know. First learn and then come to a conclusive decision.I am a beginner and for an entry level camera, I found this to be most suitable for me.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "One Star", 
            "review_posted_date": "26 November 2016", 
            "review_text": "Received AF-S lens instead of AF-P and 8 gb sd card instead of 16gb.", 
            "review_rating": "1.0 "
        }, 
        {
            "review_author": "Sujay Satam", 
            "review_header": "Excellent! Awesome camera.", 
            "review_posted_date": "17 May 2016", 
            "review_text": "I purchased this camera for the purpose of having a great travel camera, and a \"go to\" camera when I don't feel like lugging along a lot of equipment. The image quality is superb. Where the D3300 really excels over the 3100 & 3200 is the ISO range. It takes beautiful shots in lower natural lighting situations, but realize that the lens has something to do with this as well. There were some complaints about the camera, but again, I believe this to be due to the limitations of the included kit lens (which has a limited range of aperture & depth of field). The settings on the camera can only go so far as the lens allows. It would be best to match your lens with the type(s) of photography you like to do rather than expecting the camera to work like a point and shoot. As far as the image processing and video the camera performs very well. Nikon D3300 is very easy to use, and would be a perfect entry level camera for the anyone not familiar with DSLRs. There are tons of features with this camera, and some interesting modes for certain effects that are quite simply fun & easy for anyone to use. If you'd like the ease of a point and shoot camera yet want much more professional looking and beautiful images, this is the camera for you. Realize that you may need lenses (prime, longer range zoom, or macro) to get the most from this camera, that's up to you in choosing what matches your needs. Personally, I'd purchase it again in a heartbeat, and am looking forward to using it during my travels and the holidays. I'm very pleased. Highly recommended!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Navaneethakumar s", 
            "review_header": "Go for it", 
            "review_posted_date": "2 December 2015", 
            "review_text": "Good basic DSLR , you can able to shoot stunning pictures also.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Jesse Daniel Antony", 
            "review_header": "Undoubtedly the BEST Camera for this price!", 
            "review_posted_date": "10 December 2014", 
            "review_text": "Undoubtedly the best camera you can ever find for this price range! Bring all the Canons and Sony you want, up until 45K!This will outshine all of them!If you want something as good as this, you have to spend at least 40K on a Canon or a Sony just to be on par with this Baby Nikon!TOTAL Value for Money!! :)", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "hafis rahman", 
            "review_header": "Excellent for money", 
            "review_posted_date": "2 February 2016", 
            "review_text": "Excellent for money, fantastic results and easy to use", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Subhransu", 
            "review_header": "Great product @ such a good price( I bought it ...", 
            "review_posted_date": "31 October 2016", 
            "review_text": "Great product @ such a good price( I bought it Rs 23200).Though this is my 1st DSLR, I m very excited to use this product.. I was confused to go for which model.But after reading so many reviews decided to go for D3300.Very good camera for new users of DSLR.If u r thinking to buy or nt to buy it I suggest to go for it.Good professional camera @good price,clearly outweighs other options.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Suresh", 
            "review_header": "Best Cam for learning Photography", 
            "review_posted_date": "28 February 2016", 
            "review_text": "Had my first hands on and the clicks are amazing...Don't forget to go through tutorial CD's that come along with camera and you will never go wrong in Manual Mode.Enjoying my photography experience with NIKON...:)", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "abhishek virmani", 
            "review_header": "The biggest confusion ryt now...Cannon 1200D vs Nikon D3300... Go for Nikon D3300...The best one can get at this price range...", 
            "review_posted_date": "21 October 2014", 
            "review_text": "Wonderful product and great deals offered by amazon which makes this product worth it...Lots of confusion, loads of discussions, loads of youtube and lots of analysis which finally ended in choosing the right product.M happy!!!!But I am not sure on the warranty front, as I tried registering the product the very moment i received it but the nikon website declined the serial no. I even called customer care and they have asked me to wait for 48 hours... will try registering the product tomorrow again and will keep you posted...Though I am really disappointed with the courier service... as i received this product after 13 days of placing the order...", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amol Sontakke", 
            "review_header": "Excellent But Warranty Issue", 
            "review_posted_date": "18 February 2015", 
            "review_text": "Product is excellent but I have doubt regarding warranty as Nikon said on there online portal  that \"E-Commerce Websites like FLIPKART, SNAPDEAL are not our authorized partner/dealer\" Please amke sure before purchasing it though E-Commerce Websites.CHECK THIS : http://www.nikon.co.in/en_IN/product_news/2015/Q1.tag/news/products/Flipkart-news.dcr", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Anudeep", 
            "review_header": "Five Stars", 
            "review_posted_date": "17 March 2015", 
            "review_text": "Definetly worth the money. Compared with Sony and Canon, Nikon is awesome. I have never been in photography. But I managed to take some beautiful pics with this camera.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Hardik Danak", 
            "review_header": "Four Stars", 
            "review_posted_date": "21 March 2015", 
            "review_text": "i get problem in came after few days.....", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "ARIMA", 
            "review_header": "and highly satisfied with the camera results", 
            "review_posted_date": "5 November 2014", 
            "review_text": "I got this camera for 25,696 which is the lowest price for this camera ever , and highly satisfied with the camera results :) The best camera at unmatched price :)", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Aanjan", 
            "review_header": "Best entry level DSLR", 
            "review_posted_date": "13 February 2016", 
            "review_text": "I have been using this Camera from last 6 months, I first bought it offline and again bought this one from Amazon for my sister, this is an entry level DSLR from Nikon and I just love it! I have used entry level Canon DSLRs too but this one just nails down the Canon in dim lights! I just love its matte finish, its picture quality is great, its shutter speed is nice too!While I was buying this one, some of the dealers and shopkeepers said that you won't be able to get NIKON official warranty if you will buy it online, but this is not the case! The warranty will be there so don't worry about it!Trust me it's a great camera, all the technical camera websites have ranked this one as the best entry level DSLR, please find in-depth reviews for the same at \"thewirecutter\"Thank me if you find this answer useful :)", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "SATBIR SINGH", 
            "review_header": "Visit local authorized dealers first", 
            "review_posted_date": "14 September 2015", 
            "review_text": "Amazon has undoubtedly very good service; but could not gather courage to buy expensive product online. Interestingly I purchased it for Rs.35200/- three days ago from Nikon authorized dealer along with two UV filters worth Rs. 1000 (Maruma make) included. Warranty card duly filled and stamped with cash memo given by dealer.This camera definitely gives u wings, with endless settings. Sky is the limit. No need to buy any other more expensive camera. Start saving for lens only.This will help u decide :Taking an analogy, we get decent power and mileage , pickup etc in 150 cc pulsar or unicorn etc. Though we like Harley but can't afford and hate 100cc delicate bikes due to a feeling that it won't go for long heavy journey n so would be waste of money.D3300 is pulsar / unicorn ; very satisfactory durable powerful and decent to pocket.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "The PhoneGeek", 
            "review_header": "Much better than the 1200d.", 
            "review_posted_date": "11 August 2016", 
            "review_text": "Really awesome dslr. Much better than the canon 1200d though there is significant price difference, i would still recommend to go for this as i have seen both the dslr and quite frankly i like this one much better. Only one drawback according  to me is the confusing manual mode it takes time get to know how to change the settings. But the overall image quality is excellent. And the night photography is also great.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Dikshant Shahi", 
            "review_header": "Good product but aminous about the warranty!", 
            "review_posted_date": "8 August 2014", 
            "review_text": "The product is good and in new condition. Delivered on time. Overall satisfied. Only concern is am ominous about the warranty.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "SUKHJIT SINGH", 
            "review_header": "Superb Camera Nikon D3300", 
            "review_posted_date": "23 May 2015", 
            "review_text": "If you are afraid of buying online then please do not scare if you are buying through Amazon. I did complete research on this.before  I placed an order for Nikon D3300.The delivery was done before stipulated date  with superb packaging. For warranty I contacted Nikon office at Gurgaon and at Mumbai and they ensure that product is fully covered under their comprehensive warranty for 2 years.Please keep the warranty cards and bill with you to seek warranty if required.About camera this camera is equipped with latest censor and processing engine.Menus are user friendly and you can easily set the camera according to your shooting skills.Nikon D3300 give stunning result and  has better image quality.It is very good camera for the person who wish to enhance their shooting skills from point & shoot camera to DSLR.", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "venkata pramod bhattaram", 
            "review_header": "It is a fantastic camera in its segment", 
            "review_posted_date": "16 November 2015", 
            "review_text": "It is a fantastic camera in its segment. Its really great for the new enthusiasts and also serves the pros well. If you are looking for a good quality camera to see if photography is your  in-thing, you can buy this without any doubt. It's the top class camera for a beginner. it s not ideal(best buy) for taking videos.(short films) the reason for me giving it 4 stars.but if you are a photographer, just go for it.its for you. Morover, its not just about the camera. Its about you. And also, lenses make a great difference in ur pics than the camera. Happy clicking :-)", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Roju V", 
            "review_header": "Five Stars", 
            "review_posted_date": "11 March 2015", 
            "review_text": "One of the best starter DSLR. Camera bag is average. May require additional lens for better photography experience.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "dr.chandini kumar", 
            "review_header": "Five Stars", 
            "review_posted_date": "25 March 2015", 
            "review_text": "Good entry level DSLR.a bit over priced but overall experience is good with product and seller.good delivery time.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Niranjan Kshirsagar", 
            "review_header": "Happy with the right decision", 
            "review_posted_date": "20 October 2014", 
            "review_text": "I am a photography enthusiast but on tight budget. My desire to buy DSLR was lifted by the Canon 1200D selling lowest at 25k with 2 lenses. After a brief research on internet sites, D3300 came out as a better alternative. You can google if you want to compare features/results. For me it was a long term investment and so I wanted it to be wise. I was keen with picture quality and low light capabilities. D3300 seemed to deliver that. I also bought 55-200 mm at 7.5k & 35 mm prime at 7.5k. And at this price, these were icing on the cake!After getting my hands over it, I shot a very low light scene using 55-200 mm lens from about 20ft, at 12,800 ISO with 10 seconds exposure without flash. The grains were acceptable for me. Same shot at 100 ISO, 13 seconds was fabulous and it was difficult to identify for anyone whether it was a day shot or a night shot.Recently, I shot an event in my office with my new DSLR. With couple of other DSLRs around, the photos by D3300 were far better!I am not a professional to evaluate this product professionally. I'm still exploring the camera features and learning. But I am happy with the decision to buy D3300.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Rajudhs", 
            "review_header": "Five Stars", 
            "review_posted_date": "31 March 2017", 
            "review_text": "Excellent camera and light weight, Compact.Very good picture quality and good for enthusiasts", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Robin Rana", 
            "review_header": "MY first and best ....Really happy with choice", 
            "review_posted_date": "4 December 2014", 
            "review_text": "Its my first ever DSLR and it is just gr8Some times it creates small buzz noises inside the body but I guess every dslr does during processing and focusingBought two other lenses with it 35mm 1.8f premium lens and 70-300mm non vr tamron lenses.Will post my photography in my facebook profile [Can't show the link or else post will get deleted.Search my name with shimla]and any one check out the clarity over thereI think it is better to buy this than 5300 cause with the prize diff U can get a good lenesonly diff between 5300 and d3300 are :-1.rotatable screen2.Inbuild gps3.Inbuild wifi4.more focal points which is seriously not a big deal .I have seen the diff in so many videos", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Jatin Patel", 
            "review_header": "extremely happy with product and service.", 
            "review_posted_date": "11 November 2015", 
            "review_text": "First of all thanks to Amazon for delivering the camera 📷 very fast. It came 3 days earlier than Amazon estimated and made my festival. Second thanks to seller for giving me such a fantastic offer. Got it for just ₹ 23,500.About product:It came in compact packaging.Camera bag is nice, 8 gb sd card is of sandisk (class 10 ).Camera is superb in its price segment.Had wonderful shots.Must buy for photography enthusiastic.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "avishek behera", 
            "review_header": "UD3300 is pgraded model of Nikon D3200!! Just awesome!", 
            "review_posted_date": "6 December 2015", 
            "review_text": "I bought Nikon D3200 before 6 months and now I bought it for a friend. After a through use of a week I  can say that D3300 has many more advantages over D3200. There is a very minimal price difference between both. I would suggest to GO for D3300 instead of D3200. It has great PANOROMA feature, Superb preset EFFECTS in the dailer, I love that. Bets part is D3300 has faster shutter speed.Better video resolution, better battery life. Nice model!!", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Amazon Customer", 
            "review_header": "Four Stars", 
            "review_posted_date": "8 October 2016", 
            "review_text": "Really great product!", 
            "review_rating": "4.0 "
        }, 
        {
            "review_author": "Andy", 
            "review_header": "Best entry-level DSLR !", 
            "review_posted_date": "9 February 2015", 
            "review_text": "In the beginning i was bit puzzled between D5300 & D3300 but after doing some thorough research i decided to buy D3300 & it was worth every penny spent! The image quality is sharp and fine & it is an Excellent DSLR entry level camera from Nikon.Regarding Product - It was a sealed package having Nikon seal and signs of tampering were not there. This product comes with free SanDisk 8GB Class10 SDHC Card and a Nikon DSLR Bag. Overall satisfied but the packaging and delivery by the Amazon could have been better. I haven't read through the entire booklet but will surely read it. I will recommend this DSLR to everyone who is tight on budget and is beginning his/her photography journey.", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "yeshwant", 
            "review_header": "AFS lens upgraded to AFP , product description should be updated", 
            "review_posted_date": "5 September 2016", 
            "review_text": "Its AFP lens recently upgraded by Nikon . You wont get AFS lens now.Overall good .", 
            "review_rating": "5.0 "
        }, 
        {
            "review_author": "Santosh Panda", 
            "review_header": "Worth your bucks! Best in the business...", 
            "review_posted_date": "31 August 2016", 
            "review_text": "Before noting down my review let me tell you one thing, My review on this Product is written considering the fact that I had a budget of Rs.30,000 for buying a DSLR.I always had a passion for photography. I like to click pictures, be it of Birds or Peoples. So finally when I put some of my month savings to buy a DSLR, I searched various online sites reading the reviews of several DSLR. And finally I decided to buy the NIKON D3300. And trust me, right now, after using the camera for around 4 months, I proudly announce that I'm happy with my decision. There are other company's camera available in the market but within a range of 30000 you can't get a better camera than NIKON D3300.With excellent features, this camera is worth your buck. I'm using a 18-55mm lens (bought with the camera) and the pictures I click are awesome. I entered the world of Digital Images with the help of this Camera. Meanwhile my passion turned into professionalism and nowadays I click pictures at various wedding events. That makes me earn some money too. Now it's time to buy an upgraded lens. So I'm ending my review here and going to check the Amazon site for lenses.P.S. I'm sharing some of my clicks so that you can know the quality of the camera.", 
            "review_rating": "5.0 "
        }
    ], 
    "name": "Nikon D3300 24.2MP Digital SLR Camera, Black with  AF-P DX NIKKOR..."
}